<?xml version="1.0" encoding="UTF-8"?>
<schedule>
  <conference>
    <title>FOSSGIS 2010</title>
    <subtitle>Freie und Open Source Software f&#252;r Geoinformationssysteme</subtitle>
    <venue>Universit&#228;t Osnabr&#252;ck</venue>
    <city>Osnabr&#252;ck</city>
    <start>2010-03-02</start>
    <end>2010-03-05</end>
    <days>4</days>
    <release>#&lt;Conference_release::Row:0x2b5477c25910&gt;</release>
    <day_change>07:00</day_change>
    <timeslot_duration>00:15</timeslot_duration>
  </conference>
  <day date="2010-03-02" index="1">
    <room name="Gro&#223;er H&#246;rsaal (Geb. 66, E33/34)">
      <event id="1">
        <start>13:00</start>
        <duration>00:45</duration>
        <room>Gro&#223;er H&#246;rsaal (Geb. 66, E33/34)</room>
        <slug>eroeffnung</slug>
        <title>Er&#246;ffnung</title>
        <subtitle></subtitle>
        <track>Allgemeines</track>
        <type>other</type>
        <language>de</language>
        <abstract>Offizielle Er&#246;ffnung und Begr&#252;&#223;ung.


</abstract>
        <description>Offizielle Er&#246;ffnung und Begr&#252;&#223;ung.
Redner:
Dr. Georg L&#246;sel (Vorsitzender des FOSSGIS e.V.)
Zu verlesendes Gru&#223;wort von Staatssekret&#228;r Dr. Josef Lange (Nieders. Ministerium f&#252;r Wissenschaft und Kultur) 
Prof. Dr. May-Britt Kallenrode (Vizepr&#228;sidentin f&#252;r Forschung und Nachwuchsf&#246;rderung Universit&#228;t Osnabr&#252;ck)
Prof. Dr. Erhard Mielenhausen (Pr&#228;sident der Fachhochschule Osnabr&#252;ck)
Prof. Dr. Manfred Ehlers (Vorsitzender des IGF).
</description>
        <persons>
          <person id="113">Roland Hachmann</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="145">
        <start>13:45</start>
        <duration>00:30</duration>
        <room>Gro&#223;er H&#246;rsaal (Geb. 66, E33/34)</room>
        <slug></slug>
        <title>Lightning-Talks</title>
        <subtitle></subtitle>
        <track>Vortr&#228;ge</track>
        <type>lightning</type>
        <language>de</language>
        <abstract>Lightning-Talks sind Kurzvortr&#228;ge (max. 5 Minuten), in denen ein Thema nur kurz angerissen wird.</abstract>
        <description></description>
        <persons>
          <person id="51">Arnulf Christl</person>
          <person id="23">Till Adams</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="31">
        <start>14:15</start>
        <duration>00:45</duration>
        <room>Gro&#223;er H&#246;rsaal (Geb. 66, E33/34)</room>
        <slug></slug>
        <title>HTML 5, ECMAScript 5 und die Wolke</title>
        <subtitle>Potenziale f&#252;r zuk&#252;nftige WebGIS-Anwendungen</subtitle>
        <track>Vortr&#228;ge</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Webanwendungen -- nicht nur geografischer Natur -- liegen nach wie vor im Trend und es ist kein Ende dieses Paradigmenwechsels zu erkennen. Man denke in diesem Zusammenhang nur an das neue Betriebssystem (!) Chromium (http://www.chromium.org/chromium-os) von Google, welches den Webbrowser eines Computers in den Mittelpunkt stellt. Die Grundlagen und Hauptbestandteile des Webs sind dabei mitnichten statisch sondern werden permanent weiterentwickelt und -gedacht.

Der Vortrag m&#246;chte einige aktuelle Entwicklungen und Technologien kurz vorstellen und das Potenzial im Hinblick auf GIS im Web beleuchten. In wie fern wird also die neuste Version von HTML (der Auszeichnungssprache des Webs) von Relevanz f&#252;r zuk&#252;nftige WebGIS-Applikationen sein? Wie steht es mit der neuesten Version von ECMAScript (dem Standard, der z.B. durch JavaScript realisiert wird). Und wie passt die allgegenw&#228;rtige Cloud ins Bild? Neben den genannten Technologien / Konzepten werden weitere aktuelle oder zuk&#252;nftige Themen behandelt werden.</abstract>
        <description></description>
        <persons>
          <person id="34">Marc Jansen</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="89">
        <start>15:30</start>
        <duration>00:30</duration>
        <room>Gro&#223;er H&#246;rsaal (Geb. 66, E33/34)</room>
        <slug></slug>
        <title>FreeGIS.org</title>
        <subtitle>Die f&#252;nfte Generation</subtitle>
        <track>Vortr&#228;ge</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Vorstellung von FreeGIS.org und Ausblick auf die f&#252;nfte Generation (soziales Netzwerken mit FreeGIS.org).</abstract>
        <description>FreeGIS.org
Die f&#252;nfte Generation

Was wird an GIS-Funktionalit&#228;t auf Basis Freier Software geboten? Dieser Frage widmet sich das FreeGIS-Projekt. Das Ziel von FreeGIS.org ist, die Freiheit im Bereich Geographischer Informationssysteme (GIS) zu f&#246;rdern. Seit Oktober 1999 werden in einer moderierten Liste Verweise auf Freie GIS Software, Bibliotheken, Projekte und Daten gesammelt, um eine m&#246;glichst aktuelle &#220;bersicht mit dem Status der jeweiligen Freien GIS Software und mit pr&#228;ziser Angabe der Lizenz zu bieten. Das Merkmal des FreeGIS-Projektes ist die ausschlie&#223;liche Ber&#252;cksichtigung von Freier Software. In vielen anderen &#220;bersichten werden Shareware und Probe-Versionen mit in die Auflistungen &#252;bernommen und f&#228;lschlicherweise als Freie Software deklariert. Teilweise werden die Begriffe v&#246;llig durcheinander gebracht.

Um die Entwicklung zu koordinieren und Synergien zu wecken, verf&#252;gt die Liste zus&#228;tzlich &#252;ber Kreuzverweise auf &#228;hnliche Projekte einer Kategorie. Dies soll versehentliche Mehrfach-Implementierungen von Freier GIS Software verhindern.

Momentan werden an die 400 Eintr&#228;ge zu Software, Daten, Projekten und Dokumenten verwaltet. FreeGIS.org wird zweisprachig gef&#252;hrt, deutsch und englisch. &#220;ber 500 eingeschriebene Interessierte der Mailing-Liste diskutieren zu Themen rund um Freie GIS Software und geben Neuigkeiten bekannt oder schicken Hinweise zu Freier GIS Software.

Seit der vierten Generation befindet sich das Konzept in einer inhaltlichen Umsetzung. So wurde mit der Einf&#252;hrung neuer Kategorien begonnen, um dem Benutzer bei seiner Suche in der Vielzahl der Eintr&#228;ge nach Freier GIS Software besser unterst&#252;tzen zu k&#246;nnen. Beispielsweise kann zur Zeit in der Kategorie Standards nach in FreeGIS.org gelisteten OGC WMS Klienten / Server gesucht werden.

Im Jahr 2010 soll die f&#252;nften Generation von FreeGIS.org soziales Netzwerken erm&#246;glichen, um mehr Interessierte zum Mitmachen zu gewinnen und neue Formen der Zusammenarbeit und des Austausch zu erm&#246;glichen. Die Analysephase hierf&#252;r n&#228;hert sich dem Ende und es schlie&#223;t sich die konzeptionelle Phase an. Auf der FOSSGIS 2010 soll das Konzept f&#252;r die f&#252;nfte Generation von FreeGIS.org vorgestellt werden, so dass Vorschl&#228;ge und Idee in die Entwicklung einflie&#223;en k&#246;nnen.</description>
        <persons>
          <person id="57">Bjoern Schilberg</person>
        </persons>
        <links>
          <link href="http://freegis.org">http://freegis.org</link>
          <link href="http://">http://</link>
        </links>
      </event>
      <event id="84">
        <start>16:00</start>
        <duration>00:30</duration>
        <room>Gro&#223;er H&#246;rsaal (Geb. 66, E33/34)</room>
        <slug></slug>
        <title>GDI Quergedacht</title>
        <subtitle>OGC Standards und andere GIS-Normen im Zusammenspiel</subtitle>
        <track>Vortr&#228;ge</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Das Open Geospatial Consortium OGC ist ohne Zweifel eine der wichtigsten Institutionen des GIS-Marktes. Seine Standards in Kombination mit den Vorgaben der ISO sind Grundlage f&#252;r den Aufbau moderner GIS-Applikationen und bilden so das R&#252;ckgrat f&#252;r die entstehenden regionalen, nationalen und internationalen Geodateninfrastrukturen.

Doch leider sind die OWS-Standards nicht die einzigen Vorgaben im GIS-Umfeld. Um genau zu sein, hat fast jeder Bereich seine Standards und Regularien. Neben den bekannten Vorgaben der Geodatenbranche wie dem ALKIS-Datenmodell und der GeoInfoDok sind dieses auch moderne Quasistandards des Web 2.0 oder das communitygesteuerte Datenmodell von OpenStreetMap. Hinzu kommen Anforderungen an die Barrierefreiheit, ein googleartiges Look-and-Feel, die Anbindung an ein CMS oder - nicht zu Letzt - eine beeindruckende Performance. Nicht ohne Grund ist der Massenmarkt auch der Aufmerksamkeit des OGC nicht entgangen und tritt mit zunehmender Datenverf&#252;gbarkeit und schnellem Internet immer mehr in den Vordergrund.

Der Vortrag stellt Projekte vor, die durch Ihre Anforderungen zu einem kreativen Umgang mit den OGC-Standards f&#252;hrten. Einzelne Fragestellungen werden erl&#228;utert und ihre L&#246;sung vorgestellt:

Kann man eine Flashanwendung durch eine OGC-konforme GDI ersetzen? Und wenn ja, warum eigentlich? Wie um alles in der Welt soll ich denn OSM-Daten mit ALKIS-Daten kombinieren? Was passiert eigentlich, wenn sich absolute GIS-Laien dran machen, eine freie Weltkarte zu erstellen? Ohne Standards, Regeln, Vorgaben und - noch schlimmer - Chefs? Kann ich eine Massenanwendung bauen, ohne von den Statuten des OGC abzuweichen? Warum sind Konzeptionen eigentlich immer so aufw&#228;ndig, wo Simple Features, WMS und WFS doch eigentlich ausreichen sollten?

Diese und weitere Fragen werden zur Diskussion gestellt und beantwortet. Der Schwerpunkt liegt hierbei auf dem Zusammenspiel der OGC-Standards mit anderen wichtigen Regeln und Normen. </abstract>
        <description></description>
        <persons>
          <person id="70">Olaf Knopp</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="18">
        <start>16:30</start>
        <duration>00:30</duration>
        <room>Gro&#223;er H&#246;rsaal (Geb. 66, E33/34)</room>
        <slug></slug>
        <title>Gibt es Alternativen zu OpenLayers?</title>
        <subtitle>&#220;ber das Wesen von FOSS4G Projekten</subtitle>
        <track>Vortr&#228;ge</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Der Vortrag besch&#228;ftigt sich mit dem Ph&#228;nomen OpenLayers und stellt die Frage, ob es f&#252;r OpenSource Projekte generell und f&#252;r OsGeo-Projekte im Einzelnen f&#246;rderlich ist, wenn praktisch keine Konkurrenz im OpenSource Umfeld vorhanden ist. Webmapping-Clienten wie MapBuilder oder Chameleon sterben, die Entwickler integrieren sich in das OpenLayers Projekt. Diese spezielle Situation von OpenLayers wird vor dem Hintergrund anderer OpenSource GIS Projekte wie UMN Mapserver, GeoServer, PostGIS, QGIS, gvSIG und weiteren betrachtet.
Der generelle Hintergrund des Vortrags ist aufzuzeigen, wie OsGeo-Projekte eigentlich funktionieren.</abstract>
        <description></description>
        <persons>
          <person id="23">Till Adams</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="96">
        <start>17:00</start>
        <duration>00:30</duration>
        <room>Gro&#223;er H&#246;rsaal (Geb. 66, E33/34)</room>
        <slug></slug>
        <title>OSGeo, Ziele, Mission und Aufgaben</title>
        <subtitle>Einf&#252;hrung in die OSGeo</subtitle>
        <track>Vortr&#228;ge</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Die Open Source Geospatial Foundation, kurz OSGeo, ist eine non-Profit Organisation, die sich f&#252;r die F&#246;rderung von Freier und Open Source Software in der r&#228;umlichen Datenverarbeitung einsetzt.

OSGeo bietet ihren Projekten finanziellen, organisatorischen und rechtlichen Beistand in allen Fragen der Entwicklung und Verbreitung, die nicht durch bestehende Mechanismen abgedeckt werden. Als unabh&#228;ngige, rechtlich eigenst&#228;ndige Organisation bietet sie ihren Mitgliedern die Sicherheit, dass die investierte Zeit, beigesteuerter Code, Dokumentationen und auch finanzielle Mittel sinnvoll f&#252;r die gemeinsamen Ziele eingesetzt werden. Die OSGeo k&#252;mmert sich auch um die Verbreitung richtiger Informationen &#252;ber das Freie Software Konzept und Open Source Entwicklungsmethodologien und nimmt Stellung zu &#246;ffentlichen Anfragen. Die Gemeinschaft profitiert auch durch bessere Kontakte zwischen den Softwareprojekten sowie besserer Kooperation und Integration der verscheidenen Werkzeuge.</abstract>
        <description>Folgende Punkte beschreiben die konkreten Aufgaben und Ziele der OSGeo:

    * Bereitstellung von Resourcen f&#252;r OSGeo Projekte- z.B. Infrastruktur, Finanzierung, Rechtsbeistand.
    * Zugang zu Geodaten - ohne Daten ist auch Freie Software wertlos.
    * F&#246;rderung der Nutzung von Open Source Software in der r&#228;umlichen Datenverarbeitung (nicht nur der OSGeo Projekte) - z.B. &#214;ffentlichkeitsarbeit, Schulung, Werbung.
    * Implementierung von offenen Standards und Standard-basierter Interoperabilit&#228;t in OSGeo Projekten.
    * Hoher Qualit&#228;t der Projekte, um die Marke OSGeo zu st&#228;rken.
    * OSGeo und anverwandte Software f&#252;r Endbenutzer zug&#228;nglicher zu machen - z.B. Bin&#228;rpakete und &#252;bergreifende Dokumentationen erstellen
    * Unterst&#252;tzung f&#252;r die Nutzung von OSGeo Software in der Ausbuldung durch vollst&#228;ndige Studien- und Lehrpl&#228;ne, &#214;ffentlichkeitsarbeit und Support.
    * Ermutigung zur Kommunikation und kooperation wzischen OSGeo Gemeinschaften unterschiedlicher Sprachen (z.B Java/C/Python) und Betriebssysteme (z.B. GNU Linux, Win32, Unix, MacOS).
    * Verbreiterung der Gemeinschaften weltweit durch &#220;bersetzungen und Internationalisierung der Software.
    * Die Durchf&#252;hrung der j&#228;hrlichen Hauptkonferenz FOSS4G der OSGeo in Kooperation mit regionalen und internationalen Veranstaltungen (z.B. EOGEO, FOSSGIS).
    * Die Verleihung des Sol Katz Preises f&#252;r besondere Leistungen in der OSGeo Gemeinschaft.
</description>
        <persons>
          <person id="51">Arnulf Christl</person>
        </persons>
        <links>
          <link href="http://www.osgeo.org">http://www.osgeo.org</link>
          <link href="http://arnulf.us/publications/osgeo_spatially-empowered-open-source_gfoss.it.odp">http://arnulf.us/publications/osgeo_spatially-empowered-open-source_gfoss.it.odp</link>
        </links>
      </event>
    </room>
    <room name="Kleiner H&#246;rsaal (Geb. 35, E01)">
      <event id="45">
        <start>15:30</start>
        <duration>00:30</duration>
        <room>Kleiner H&#246;rsaal (Geb. 35, E01)</room>
        <slug></slug>
        <title>FOSSGIS in Schweden</title>
        <subtitle>Die Anwendung von FOSSGIS in schwedischen Gemeinden und Verwaltungen</subtitle>
        <track>Vortr&#228;ge</track>
        <type>lecture</type>
        <language></language>
        <abstract>Die Verwendung von FOSSGIS in schwedischen Gemeinden und Verwaltungen nimmt rapide zu. Obwohl es von Regierungsseite in Schweden noch keine Aufforderung gibt, auch freie Alternativen in Erw&#228;gung zu ziehen, entscheiden sich immer mehr Verwaltungen und Gemeinden dazu, freie Software einzusetzen, auch wenn dies nur in Teilen der Organisation der Fall sein sollte. Die angewendete Software reicht von PostgreSql/PostGIS &#252;ber Geoserver bis hin zu OpenLayers, aber auch andere Software.
In meinem Vortrag werde ich beleuchten, welche freie GIS Software in Schweden vorzugsweise angewendet wird und in welchen Konstellationen. In der zweiten H&#228;lfte des Vortrages werde ich einige Fallbeispiele geben, so z.B. die Stadt G&#246;teborg, die in ihrer Strategie, auf WebServices umzustellen, deutlich auf FOSSGIS setzt.
</abstract>
        <description></description>
        <persons>
          <person id="50">Johannes Schulte S&#252;dhoff</person>
        </persons>
        <links>
          <link href="http://">http://</link>
        </links>
      </event>
      <event id="12">
        <start>16:00</start>
        <duration>00:30</duration>
        <room>Kleiner H&#246;rsaal (Geb. 35, E01)</room>
        <slug></slug>
        <title>FOSSGIS im Blaulichteinsatz - Die Alarmzentrale Solothurn</title>
        <subtitle></subtitle>
        <track>Vortr&#228;ge</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Die Alarmzentrale (AZ) der Kantonspolizei Solothurn betreut alle 125 Gemeinden des Kantons und deckt damit ein Gebiet von 791 Quadratkilometern mit &#252;ber 250000 Einwohnern ab. S&#228;mtliche Notrufe (Polizei, Feuerwehr, Sanit&#228;t) aus dem Kantonsgebiet gehen auf der AZ ein. Zus&#228;tzlich werden weitere 78 Gemeinden der Region Oberaargau im Bereich Sanit&#228;t betreut.

Von der Regierung wird f&#252;r polizeiliche Notf&#228;lle eine Interventionszeit in st&#228;dtischem Gebiet von weniger als 10 Minuten in 85 % aller F&#228;lle verlangt. In l&#228;ndlichem Gebiet wird eine Interventionszeit von weniger als 10 Minuten in 80% aller F&#228;lle verlangt. Um diese Vorgaben zu erreichen und zu messen, muss eine aktuelle &#220;bersicht &#252;ber die mobilen Einsatzmittel der Polizei geschaffen und die Auftragserteilung sowie die Navigation der mobilen Einsatzmittel unterst&#252;tzt werden.

Die Alarmzentrale umfasst zur Zeit sieben regul&#228;re Arbeitspl&#228;tze. Jeder Arbeitsplatz  umfasst dabei unter anderem einen Client des Einsatzleitsystems (ELS) und einen Web-Client des kantonalen GIS (SO!GIS). 

SO!GIS-Infrastruktur

Die SO!GIS-Infrastruktur besteht serverseitig aus einer PostgreSQL/PostGIS-Datenbank sowie dem UMN MapServer. Als Webserver kommt Apache mit PHP als Skriptsprache zum Einsatz. Der GIS-Client ist browserbasiert und entspricht im wesentlichen dem Standardclient SO!MAP welcher in der gesamten kantonalen Verwaltung im Einsatz ist.
&#220;ber den SO!MAP-Client werden ca. 20 verschiedene thematische Layer des SO!GIS aufbereitet und zur Verf&#252;gung gestellt. Eine Suchfunktion erm&#246;glicht die Suche nach Gemeinden, Strassen, Hausnummern, Flurnamen und Punkten von Interesse (POIs). &#220;ber die Abfragefunktion lassen sich weitere Information gewinnen, wie zum Beispiel die Zust&#228;ndigkeiten der verschiedenen Schadenwehren.

Das Einsatzleitsystem

Alle ankommenden Notrufe werden im Einsatzleitsystem registriert und bearbeitet. Zur genaueren Lokalisierung eines Notrufers wird bei Bedarf bei Mobiltelfonaten via NotDB (DB der Mobilfunkanbieter) der Standort der genutzten Mobilfunkantenne sowie die Ausbreitungsellipse dieser Antenne abgefragt und dargestellt. Bei Festnetzanschl&#252;ssen wird die Adresse &#252;ber die entsprechenden Verzeichnisse ermittelt. Ebenfalls wird der Einsatzort als Adresse im ELS registriert. Alle diese Informationen stellt das ELS dem SO!GIS-Integrationsserver zur Verf&#252;gung. Das Einsatzleitsystem kann weiterhin Auftr&#228;ge in Textform sowie Koordinaten als Fahrziel an einzelne Einsatzmittel &#252;bermitteln. Die Koordinaten einer bestimmten Adresse erf&#228;hrt das ELS beim SO!GIS-Integrationsserver, welcher Zugriff auf die SO!GIS-Datenbank hat. Die Zielfindung und Routenberechnung l&#228;uft im Navigationssystem des Einsatzmittels ab.

Die mobilen Einsatzmittel

Die Fahrzeuge der Polizei sind mit einem Modul bestehend aus GPS-Empf&#228;nger, Navigationssystem, einem Frontend mit Display f&#252;r die Bedienung sowie einer GPRS-Komponente ausger&#252;stet. Das Modul ist in der Lage via GPRS seine Positionsdaten und einen Status der Patrouille (zum Beispiel &#8222;vor Ort&#8220;) zu senden. Die Position wird automatisch, abh&#228;ngig von der zur&#252;ckgelegten Strecke und der verstrichenen Zeit der letzten Meldung, gesendet. Ebenfalls kann es &#252;ber diesen Kanal Text f&#252;r Auftr&#228;ge sowie Koordinaten f&#252;r ein Fahrziel erhalten. Die Daten werden an ein GPRS-Gateway gesendet, von wo sie dann weiterverarbeitet werden.

Der SO!GIS-Integrationserver

Der SO!GIS-Integrationsserver (SIS) ist eine Middleware, welche Java Message Services (JMS) von JBoss nutzt, um die Kommunikation zwischen allen beteiligten Systemen zu koordinieren. Vom ELS erh&#228;lt der SIS eine Einsatzadresse, die er mit Koordinaten ausstattet und in die SO!GIS-Datenbank schreibt. Ein im SO!MAP-Client integriertes Java-Applet &#252;bernimmt Anweisungen vom SIS und fokussiert die Kartendarstellung am Arbeitsplatz automatisch auf das aktuelle Ereignis. Der GPRS-Gateway sammelt alle Standortsmeldungen der mobilen Einsatzmittel. Der SIS holt diese ab, rechnet sie in das schweizerische Projektionssystem um und schickt sie weiter an den Client zur Darstellung auf der Karte. So k&#246;nnen die Eins&#228;tze von der Alarmzentrale ohne weiteres Zutun laufend &#252;berwacht und koordiniert werden.

Zur Zeit in Arbeit ist die Erweiterung des Systems um eine Komponente zur Elektronischen Lagedarstellung. Diese erlaubt das rasche Erstellen und verbreiten von aktuellen Situationsberichten im Einsatz und im Falle aussergew&#246;hnlicher Lagen. Mit dieser Komponente soll in Zukunft auch der Kantonale (Krisen-)F&#252;hrungsstab bedient werden.

Durch den engen Verbund des Einsatzleitsystem, die Anbindung der mobilen Einsatzmittel und des GIS steht den Mitarbeitenden in der Alarmzentrale ein modernes Hilfsmittel zur Verf&#252;gung, welches die Arbeit erheblich vereinfacht. Auf einen Blick lassen sich im SO!MAP-Client die aktuellen r&#228;umlichen Informationen ablesen. Die Aktualit&#228;t der Lagedarstellung ist gew&#228;hrleistet und die &#220;bersicht &#252;ber die Lage wird wesentlich verbessert. Dies f&#252;hrt zu besseren und schnelleren Entscheiden und letztlich zu einer Verk&#252;rzung der Interventionszeiten.
</abstract>
        <description>Beschreibung der Infrastruktur und Anwendungsf&#228;lle wie sie in der Alarmzentrale des Kantons Solothurn im Einsatz sind:

-Webmap-Anwendung (UMN MapServer, PostGIS, SO!GIS WebClient)
-Zusammenspiel/Anbindung des Einsatzleitsystems
-Lokalisierung von Notrufen (Festnetz- und Mobilnetzanrufe)
-Lokalisierung/Flottenmangement der Einsatzmittel (Polizeistreifen und Rettungswagen)
-Auftrags- und Einsatzsors&#252;bermittlung an die Streifen

Je nach Stand des Projekts: Elektronische Lagedarstellung und Anbindung der Alarmzentrale an den Kantonalen Krisenf&#252;hrungsstab (zumindest Konzeption)</description>
        <persons>
          <person id="14">C&#233;dric M&#246;ri</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="87">
        <start>16:30</start>
        <duration>00:30</duration>
        <room>Kleiner H&#246;rsaal (Geb. 35, E01)</room>
        <slug></slug>
        <title>Raumordnung und Bauleitplanung mit kvwmap</title>
        <subtitle>Der Einsatz eines Open Source WebGIS im Ministerium f&#252;r Verkehr, Bau und Landesentwicklung Mecklenburg-Vorpommern</subtitle>
        <track>Vortr&#228;ge</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Der Beitrag behandelt die Bauleitplanung aus der Sicht des Raumordnungskatasters und der Landkreise in MV unter Verwendung des OpenSource Internet-GIS kvwmap. kvwmap ist in 11 Landkreisen und einigen Landesverwaltungen im Einsatz. Zun&#228;chst werden die Anforderungen an die Daten der Bauleitplanung durch das Raumordnungskataster auf Landesebene und der Landkreise beschrieben. Im Rahmen der kvwmap-User Group wurde ein einheitliches Modell f&#252;r Daten der Bauleitplanung erstellt. Dies wird f&#252;r die Erfassung in kvwmap verwendet. Im letzten Teil wird die Erfassung in unterschiedlichen Oberfl&#228;chen in kvwmap f&#252;r die Raumordnung und der Landkreise beschrieben.
Den Abschlu&#223; stellt das Konzept f&#252;r den Austausch von neuen und &#196;nderungsdaten dar. Im Beitrag soll vor allem die Zusammenarbeit der Nutzer der OpenSource Software kvwmap hervorgehoben werden, die es erm&#246;glicht &#252;ber Verwaltungsgrenzen hinweg Datenmodelle zu vereinheitlichen und &#252;ber offene Infrastrukturen auszutauschen.
</abstract>
        <description></description>
        <persons>
          <person id="64">Stefan Rahn</person>
        </persons>
        <links>
          <link href="http://kvwmap.geoinformatik.uni-rostock.de">kvwmap-Wiki</link>
          <link href="http://sourceforge.net/projects/kvwmap/">SourceForge Projektseite</link>
        </links>
      </event>
      <event id="114">
        <start>17:00</start>
        <duration>00:30</duration>
        <room>Kleiner H&#246;rsaal (Geb. 35, E01)</room>
        <slug></slug>
        <title>Never change a running system - oder warum Neues wagen?</title>
        <subtitle>Ein Rundgang durch 10 Jahre WebMapping in der Kreisverwaltung Recklinghausen</subtitle>
        <track>Vortr&#228;ge</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Seit 1999 werden beim Kreis Recklinghausen WebMapping-Anwendungen zur Standortinformation im Internet eingesetzt. In dieser Zeit haben sich die Rahmenbedingungen stark ver&#228;ndert, insbesondere im Bereich der Open Source-Anwendungen. Sie bieten Vorteile bei der Reduzierung von Kosten, erlauben den Einbau eigener Funktionen und das Einbringen eigener Ideen und werden den gestiegenen Usability-Anforderungen und M&#246;glichkeiten (wie GoogleMaps &amp; Co) gerecht. Beim Kreis Recklinghausen wurde daher f&#252;r die WebMapping-Anwendungen ein Systemwechsel von MOIMS &#252;ber ArcIMS zum Open Source Web-Framework Mapbender bis hin zu Mapfish durchgef&#252;hrt.</abstract>
        <description>Der Vortrag behandelt folgende Fragen:

Wie haben sich die Rahmenbedingungen in dieser Zeit ver&#228;ndert?

Wann ist die Zeit reif f&#252;r einen Wechsel der Software-Plattform?

Welche Erfahrungen konnten dabei gemacht werden?


Insbesondere werden die "Wechselgr&#252;nde" aus Sicht eines Kartendienst-Betreibers im &#246;ffentlichen Dienst dargestellt. Ein visueller Rundgang durch die Anwendungen (Fl&#228;chenatlas, www.regioplaner.de, www.regiofreizeit.de, www.chemieatlas.de und die neue MapFish-Anwendung) rundet die Zeitreise ab.
</description>
        <persons>
          <person id="48">Anja Sigesmund</person>
        </persons>
        <links>
          <link href="http://www.chemieatlas.de/">Chemieatlas</link>
          <link href="http://www.regiofreizeit.de/">Regiofreizeit</link>
          <link href="http://www.standortvest.de/">Standort Vest</link>
        </links>
      </event>
    </room>
    <room name="Workshop 1 (Geb. SI, SI0201)">
      <event id="44">
        <start>11:00</start>
        <duration>01:30</duration>
        <room>Workshop 1 (Geb. SI, SI0201)</room>
        <slug></slug>
        <title>Einf&#252;hrung in Geodatenbanken mit PostGIS</title>
        <subtitle></subtitle>
        <track>Workshops</track>
        <type>workshop</type>
        <language>de</language>
        <abstract>Programm:
 * Was ist PostGIS?
 * Einspielen/Exportieren von Geodaten
 * R&#228;umliche Indizierungen effizient nutzen
 * Abfragen mit r&#228;umlichen Operationen
 * Einbinden in Freie Clients zur Kartengenerierung (UMN MapServer)


Ablauf und Zielgruppe:
Der Workshop zielt auf Interessierte GIS-Anwender, die den Umgang mit PostGIS kennenlernen und darauf aufbauen wollen. Dabei werden Shapedateien in PostGIS importiert und in einem GIS dargestellt. 
Einfache r&#228;umliche Operationen werden gezeigt, um den Umgang mit PostGIS zu veranschaulichen. Der Workshop sieht sich als Einf&#252;hrung und ist so konzipiert, dass aktive Mitarbeit der Teilnehmer nicht m&#246;glich ist.

Ein grunds&#228;tzliches Verst&#228;ndnis von Datenbanken sowie SQL sollte vorhanden sein, um dem Workshop folgen zu k&#246;nnen.
</abstract>
        <description></description>
        <persons>
          <person id="31">Harald Schwenk</person>
          <person id="46">Stephan Holl</person>
        </persons>
        <links>
          <link href="http://www.postgis.org">http://www.postgis.org</link>
          <link href="http://www.intevation.de/geospatial">http://www.intevation.de/geospatial</link>
        </links>
      </event>
      <event id="157">
        <start>17:45</start>
        <duration>01:00</duration>
        <room>Workshop 1 (Geb. SI, SI0201)</room>
        <slug></slug>
        <title>BOF GeoJQuery</title>
        <subtitle></subtitle>
        <track>BoFs</track>
        <type>developer_meeting</type>
        <language></language>
        <abstract>Die AJAX-Javascript Bibliothek "ExtJs" bietet eine Menge an Web-Funktionalit&#228;t. Daraus ist letztenendes das OpenSource Projekt GeoExt erwachsen, welches OpenLayers um ExtJs-Komponenten erweitert.

Zwar eine andere Philosophie und Struktur, aber &#228;hnliche M&#246;glichkeiten bietet JQuery. In der BOF wollen wir pr&#252;fen, inwiefern es Sinn macht, ein eigenes OS-Projekt mit Namen "GeoJQuery" zu starten, welches OpenLayers um sinnvolle JQuery-Elemente erweitern k&#246;nnte bzw. welche Komponenten sich ggf. f&#252;r einen Start anbieten w&#252;rden.

Es besteht in unserer Firma bereits eine Menge an Anwendungen und Code, der sich f&#252;r den Start eines solchen Projektes verwenden liesse.

Wir wollen die Idee vorstellen und gerne mit m&#246;glichst vielen Interessierten, Entwicklern und potentiellen Nutzern und Anwendern diskutieren. Wichtig ist uns, da&#223; wir keine Konkurrenz zu GeoExt aufbauen wollen, sondern die im OS-Feld &#252;bliche Vielfalt bereichern wollen. 
</abstract>
        <description></description>
        <persons>
          <person id="23">Till Adams</person>
        </persons>
        <links>
        </links>
      </event>
    </room>
    <room name="Workshop 2 (Geb. SI, SI0202)">
      <event id="33">
        <start>11:00</start>
        <duration>01:30</duration>
        <room>Workshop 2 (Geb. SI, SI0202)</room>
        <slug></slug>
        <title>Rasterdatenprozessierung mit GDAL</title>
        <subtitle>Performancetuning und Bezugssystemwechsel</subtitle>
        <track>Workshops</track>
        <type>workshop</type>
        <language>de</language>
        <abstract>Der Workshop befasst sich mit der Geodata Abstraction Library (GDAL). GDAL wird in vielen OpenSource-Softwarepaketen wie zB. im UMN Mapserver, in PostGIS oder von QGIS verwendet und erm&#246;glicht den Zugriff auf &#252;ber 70 verschiedene Rasterdateiformate. 

Dar&#252;ber hinaus stellt die Bibliothek zahlreiche Hilfsprogramme bereit, die sich hervorragend zur Umrechnung, Umprojizierung und f&#252;r das Performancetuning von Rasterdaten eignen. So l&#228;sst sich durch eine gezielte Vorverarbeitung mit diesen Hilfsprogrammen das Antwortzeitverhalten f&#252;r die Darstellung von Rasterdaten am Bildschirm oftmals erheblich steigern. Auch die Transformation von Rasterdatenbest&#228;nden in das neue Bezugssystem ETRS89/UTM kann mit leistungsstarken Tools dieser Bibliothek bewerkstelligt werden.

Der Workshop gibt einen &#220;berblick &#252;ber ausgew&#228;hlte Hilfsprogramme und erm&#246;glicht den Teilnehmerinnen und Teilnehmern in einer &#220;bungsreihe verschiedene M&#246;glichkeiten der Rasterdatenverarbeitung an praktischen Beispielen kennenzulernen. Es wird &#220;bungen zur Erzeugung von Rasterdatenkatalogen, Overviews und Bildpyramiden geben. Dar&#252;ber hinaus werden Beispieldaten (Raster- und Vektordaten) in das neue Bezugssystem ETRS89/UTM transformiert und in ein neues Blattschnittgitter &#252;berf&#252;hrt. Dieser Workshop versteht sich als allgemeine Einf&#252;hrung in die Thematik und setzt keine spezifischen Vorkenntnisse voraus. 

Der Workshop basiert auf dem Workshop, den der Hauptentwickler Frank Warmerdam auf der FOSS4G bereits 2007 und 2008 durchgef&#252;hrt hat, und wurde erstmals auf der FOSSGIS 2009 in Hannover angeboten. Dieses Jahr wird es einige Erweiterungen zum Bezugssystemwechsel geben (ETRS89/UTM).</abstract>
        <description>Ablauf:
kurze, theoretische Einf&#252;hrung (Folienpr&#228;sentation)
- Welche Hilfsprogramme gibt es und f&#252;r welchen Zweck k&#246;nnen sie eingesetzt werden?
- Bezug, Installation und Hilfe
- Einf&#252;hrung in den Aufbau der Kommandozeilenaufrufe (Parameter)

praktische &#220;bungen (Beispiele)
- gdalinfo
- gdaltindex
- gdal_translate
- gdalwarp
- gdaladdo
- gdalrasterize
- ogr2ogr</description>
        <persons>
          <person id="17">Andreas Fischer</person>
          <person id="23">Till Adams</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="67">
        <start>15:30</start>
        <duration>01:30</duration>
        <room>Workshop 2 (Geb. SI, SI0202)</room>
        <slug></slug>
        <title>Vom DesktopGIS ins Web</title>
        <subtitle></subtitle>
        <track>Workshops</track>
        <type>workshop</type>
        <language>de</language>
        <abstract>Ziel des Workshops soll es sein im DesktopGIS aufbereitete Geodaten in einer WebGIS-Anwendung zu implementieren. Die Teilnehmer lernen einen OGC-konformen Webmappingdienst mit OS DesktopGIS zu erstellen und diesen Dienst in WebGIS-Clients einzubinden.

Die Geodaten (Shape oder Postgisdaten) werden im DesktopGIS zun&#228;chst aufbereitet. Mit der entsprechenden Erweiterung sollen Teilnehmer die Konfigurationsdatei f&#252;r Mapserver erstellen und dabei die unterschiedlichen Konfigurationsm&#246;glichkeiten kennen lernen. Das generierte Mapfile wird danach in den WebGIS-Client Mapbender eingebunden und visualisiert. Des Weiteren lernen die Teilnehmer aus im Mapbender konfigurierten Diensten einen OpenLayers-Client zu erzeugen.

    * Einf&#252;hrung WebGIS-Architekturen
    * Einf&#252;hrung in DesktopGIS gvSIG/ QGIS
    * Installation und Konfiguration Plugin zur Konfigurationsfile-Erstellung
    * Einbindung und Visualisierung von Geodaten in DesktopGIS gvSIG/ QGIS
    * Einbindung und Visualisierung von WMS-Diensten und weiteren Remotediensten in DesktopGIS gvSIG/ QGIS
    * Einbindung/Konfiguration/Visualisierung des erzeugten WMS-Dienst in WebGIS-Client Mapbender
    * Erstellung eine OpenLayers Client mit zuvor in Mapbender konfigurierten Dienst mittels Mapbender </abstract>
        <description>Ziel des Workshops soll es sein im DesktopGIS aufbereitete Geodaten in einer WebGIS-Anwendung zu implementieren. Die Teilnehmer lernen einen OGC-konformen Webmappingdienst mit OS DesktopGIS zu erstellen und diesen Dienst in WebGIS-Clients einzubinden.

Die Geodaten (Shape oder Postgisdaten) werden im DesktopGIS zun&#228;chst aufbereitet. Mit der entsprechenden Erweiterung sollen Teilnehmer die Konfigurationsdatei f&#252;r Mapserver erstellen und dabei die unterschiedlichen Konfigurationsm&#246;glichkeiten kennen lernen. Das generierte Mapfile wird danach in den WebGIS-Client Mapbender eingebunden und visualisiert. Des Weiteren lernen die Teilnehmer aus im Mapbender konfigurierten Diensten einen OpenLayers-Client zu erzeugen.

    * Einf&#252;hrung WebGIS-Architekturen
    * Einf&#252;hrung in DesktopGIS gvSIG/ QGIS
    * Installation und Konfiguration Plugin zur Konfigurationsfile-Erstellung
    * Einbindung und Visualisierung von Geodaten in DesktopGIS gvSIG/ QGIS
    * Einbindung und Visualisierung von WMS-Diensten und weiteren Remotediensten in DesktopGIS gvSIG/ QGIS
    * Einbindung/Konfiguration/Visualisierung des erzeugten WMS-Dienst in WebGIS-Client Mapbender
    * Erstellung eine OpenLayers Client mit zuvor in Mapbender konfigurierten Dienst mittels Mapbender </description>
        <persons>
          <person id="119">Toni Pignataro</person>
        </persons>
        <links>
        </links>
      </event>
    </room>
    <room name="Seminarraum 1 (Geb. 66/E01)">
    </room>
  </day>
  <day date="2010-03-03" index="2">
    <room name="Gro&#223;er H&#246;rsaal (Geb. 66, E33/34)">
      <event id="72">
        <start>09:00</start>
        <duration>00:30</duration>
        <room>Gro&#223;er H&#246;rsaal (Geb. 66, E33/34)</room>
        <slug></slug>
        <title>Eine Typisierung: OpenLayers, Mapbender und MapFish</title>
        <subtitle>Eine Antwort auf die Frage, welche Software sich f&#252;r welchen Zweck eignet.</subtitle>
        <track>Vortr&#228;ge</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Dieser Vortrag entstand aus dem Wunsch heraus, ein klareres Verst&#228;ndnis f&#252;r die Aufgaben und Ziele der drei Web Mapping-Komponenten der OSGeo, OpenLayers, Mapbender und MapFish, zu entwickeln. Es gibt eine Vielzahl weiterer Web Mapping-Komponenten, die meist Bestandteil eines Serverframeworks wie deegree oder MapGuide Open Source sind, auf die hier aber nicht n&#228;her eingegangen wird. Hier geht es um drei Typen von Software, die f&#252;r unterschiedliche Herangehensweisen entwickelt wurden, aber auch ausgezeichnet miteinander kombinierbar sind. 

Kurz zusammengefasst kann man OpenLayers als JavaScript-Bibliothek f&#252;r Web-Entwickler beschreiben, Mapbender als Softwarepaket zum Management von GDI in Geoportalen und MapFish als Entwickler-Framework f&#252;r komplexe WebGIS Anwendungen. Nat&#252;rlich kann man alle drei auch in den jeweils anderen Kontexten einsetzen, bezahlt das aber mit deutlichen Mehraufw&#228;nden. Nachfolgend werden die Gemeinsamkeiten und Unterschiede der drei OSGeo-Projekte detailliert vorgestellt.
</abstract>
        <description>Ein Vergleich von OpenLayers, Mapbender und MapFish. Zun&#228;chst scheinen die drei Software-Projekte direkt miteinander zu konkurrieren, da sie jeweils Karten anzeigen und grundlegende Navigationsm&#246;glichkeiten bieten. Die Unterschiede der Software sind vor allem "unter der Haube" zu finden sind. Dort bilden sie so unterschiedliche Spektren ab, dass die Entscheidung f&#252;r eine der drei Software-Projekte oder auch einer Kombination daraus nicht schwer fallen sollte und entsprechend der Fragestellung, die es zu l&#246;sen gilt, ausgew&#228;hlt werden. 

Inhalt:
* Zur Geschichte der Projekte
** Mapbender
** OpenLayers
*** Exkurs I: Gekachelte oder ungekachelte Dienste?
*** Exkurs II: Warum brauchen wir &#252;berhaupt noch OGC WMS-Dienste?
** MapFish
* Komponentenanalyse Client
* Komponentenanalyse Server
* Lizenz und Copyright
* Welches Framework f&#252;r welche Aufgabe?
* Verweise und Referenzen
</description>
        <persons>
          <person id="51">Arnulf Christl</person>
          <person id="115">Christoph Baudson</person>
        </persons>
        <links>
          <link href="http://www.mapbender.org/Eine_Typisierung:_OpenLayers,_Mapbender_und_MapFish">Aktualisierte, gepflegte Online Version des Vortrags</link>
          <link href="http://">http://</link>
        </links>
      </event>
      <event id="80">
        <start>09:30</start>
        <duration>00:30</duration>
        <room>Gro&#223;er H&#246;rsaal (Geb. 66, E33/34)</room>
        <slug></slug>
        <title>Webmapping 2.0 mit freier Software und freien Daten</title>
        <subtitle></subtitle>
        <track>Vortr&#228;ge</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Durch die Technologien des sog. Web 2.0 haben Internetnutzer die M&#246;glichkeit Karten basierend auf unterschiedlichen Datenquellen und Anwendungen ohne Expertenwissen selbst zu erzeugen, zu gestalten und in eigenen Webseiten, Blogs, Wikis, etc. einzubinden. Dieses sog. Webmapping 2.0 wird u.a. durch offene Programmierschnittstellen (APIs), Standards (z.B. KML, GeoRSS, GPX) und eine einfache Bedienung und Handhabung erm&#246;glicht. Damit k&#246;nnen auf einfache Art und Weise und gr&#246;&#223;tenteils ohne Programmierkenntnisse nutzergenerierte Karten und Kartenanwendungen (z.B. als mashup) erstellt werden, um raumbezogene Informationen (z.B. Fotos, Routen, Anfahrtswege, POIs,  Reisebeschreibungen, etc.) zu visualisieren. 

Freie Daten und freie Software bilden ein wesentliches Element des Webmapping 2.0, weil dadurch erst eine Partizipation und Kollaboration sowie eine freie Nutzung und Gestaltung von r&#228;umlichen Daten und Karten uneingeschr&#228;nkt m&#246;glich ist. Jedoch ist der Bereich Webmapping 2.0 stark gepr&#228;gt von propriet&#228;ren Daten- und Software-Anbietern (z.B. Google, Microsoft, Yahoo), so dass die Nutzungsrechte z.B. aufgrund der urheberrechtlich gesch&#252;tzten Daten oder durch beschr&#228;nkte Zugriffszahlen oft eingeschr&#228;nkt sind (z.B. nur private Nutzung). 

Beispielhaft sollen die M&#246;glichkeiten und Grenzen einiger Webmapping 2.0-Anwendungen aufgezeigt werden, die das Erstellen von nutzergenerierten Karten (kollaborativ, personalisiert und als mashup) mit freier Software und/oder freien Daten erm&#246;glichen. Zu nennen sind hier z.B. die Webmapping-Anwendungen GeoCommons und MapsGeek zum Erstellen thematischer Karten, Mapstraction und OpenLayers als freie APIs sowie der Style Editor der Firma CloudMade zur eigenen Gestaltung von OpenStreetMap-Karten. Als freie Datenquellen bieten sich nat&#252;rlich die Daten von OpenStreetMap an aber auch frei verwendbare statistische Daten stehen zur Verf&#252;gung. Neben einer technisch m&#246;glichst einfachen und unbeschr&#228;nkten Erzeugung und Verwendung von nutzergenerierten Karten bildet die Qualit&#228;t der kartographischen Darstellung ein weiteres Problemfeld, worauf im Vortrag auch eingegangen wird. Vor allem bei der Erstellung von thematischen Karten sind gewisse Regeln bei der Datenaufbereitung und der Darstellung zu beachten. 
</abstract>
        <description></description>
        <persons>
          <person id="42">Karsten Hoffmann</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="100">
        <start>10:00</start>
        <duration>00:30</duration>
        <room>Gro&#223;er H&#246;rsaal (Geb. 66, E33/34)</room>
        <slug></slug>
        <title>Aktuelle Entwicklungen aus MapFish</title>
        <subtitle></subtitle>
        <track>Vortr&#228;ge</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>MapFish ist ein Framework, welches die Bildung von individuell gestalteten und erweiterbaren Web-GIS Anwendungen vereinfacht. MapFish ist so gestaltet, dass es einfach zu benutzen ist, entweder als selbst&#228;ndige Anwendung oder als Bestandteil einer bestehenden Webseite. Als selbst&#228;ndige Anwendung ist MapFish via einige Parameter konfigurierbar und bietet schnell ein funktionales Web-GIS. MapFish kann auch in bestehenden Webseiten wie CMS oder Informations System
orientierte Anwendungen ohne Aufwand  integriert werden. Der Client Teil erm&#246;glicht es via OpenLayers und ExtJS (GeoExt), weiterf&#252;hrende WEB2.0 Funktionalit&#228;ten einzubauen. Der Server Teil stellt in verschiedene Programmiersprachen flexible Prozesse zur Verf&#252;gung (Routing, Suchmaschine, thematische Kartografie, usw).</abstract>
        <description></description>
        <persons>
          <person id="76">Emmanuel Belo</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="107">
        <start>11:00</start>
        <duration>00:30</duration>
        <room>Gro&#223;er H&#246;rsaal (Geb. 66, E33/34)</room>
        <slug></slug>
        <title>Geoprocessing von Massendaten in PostGIS</title>
        <subtitle>Probleme und L&#246;sungsans&#228;tze</subtitle>
        <track>Vortr&#228;ge</track>
        <type>lecture</type>
        <language></language>
        <abstract>In verschiedenen Projekten am Institut f&#252;r L&#228;ndliche R&#228;ume des Johann Heinrich von Th&#252;nen-Instituts (vTI, Bundesforschungsinstitut f&#252;r L&#228;ndliche R&#228;ume, Wald und Fischerei) werden r&#228;umliche Informationen genutzt, um Landnutzungs&#228;nderungen im Agrarbereich zu quantifizieren und Aussagen &#252;ber m&#246;gliche Ursachen und Auswirkungen treffen zu k&#246;nnen. Dabei werden je nach Projektfokus einzelne Bundesl&#228;nder, ganz Deutschland oder die EU betrachtet. Relevant sind hierbei Daten zur Landnutzung (z.B. Atkis, Corine, InVeKoS), zu naturr&#228;umlichen Gegebenheiten (z.B. Boden, Klima, Gel&#228;ndeh&#246;he und &#8211;neigung) und zu administrativen Einheiten (z.B. Verwaltungsgrenzen, Schutzgebiete).
Aufgabe der GIS-Verarbeitung ist es, alle ben&#246;tigten r&#228;umlichen Daten miteinander zu verschneiden, so dass im Endergebnis eine r&#228;umliche Datenbank entsteht, in der alle Informationen der Ursprungskarten enthalten sind (Komplettverschneidung). F&#252;r eine sinnvolle Auswertung ist dabei Bedingung, dass das Ergebnis keine Fl&#228;chendopplungen oder &#8211;&#252;berlappungen enth&#228;lt und dass f&#252;r jeden Punkt des Untersuchungsgebiets eine eindeutige Aussage &#252;ber die Zugeh&#246;rigkeit und die entsprechende Auspr&#228;gung hinsichtlich jeder einzelnen Ursprungskarte getroffen werden kann.
Aufgrund der Gr&#246;&#223;e der zu verarbeitenden Datenpakete bot sich die Datenhaltung und &#8209;verarbeitung in einer Datenbank an, was zum Einsatz der OpenSource Produkte PostGIS und PostGreSQL f&#252;hrte. Im Vortrag werden zwei der hierbei aufgetretenen Probleme sowie der aktuelle Stand der erarbeiteten L&#246;sungen beschrieben und zur Diskussion gestellt.
Ein wesentliches Problem stellte die f&#252;r die Forschungszielstellung grundlegend erforderliche Komplettverschneidung mehrerer Datens&#228;tze dar, die in PostGIS bisher nicht als einfache Funktion umgesetzt ist. Aus mehreren vorhandenen Funktionen wurde mit der internen Programmiersprache pl/pgsql eine neue Funktion entwickelt, die eine Komplettverschneidung realisiert.
Ein weiteres Problem ist, dass viele Eingangsdaten neben invaliden Geometrien auch Polygone enthalten, die doppelt vorhanden sind oder &#220;berlappungen mit anderen Polygonen aufweisen. Diese Datens&#228;tze m&#252;ssen bereinigt werden, damit bei der Fl&#228;chenbilanz im Rahmen der Auswertung keine Fehler auftreten. Der Vortrag beleuchtet, wie dabei vorgegangen wurde und wie bei der erforderlichen Aggregation Informationsverluste vermieden werden k&#246;nnen.</abstract>
        <description></description>
        <persons>
          <person id="78">Birgit Laggner</person>
          <person id="120">Helge Meyer-Borstel</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="30">
        <start>11:30</start>
        <duration>00:30</duration>
        <room>Gro&#223;er H&#246;rsaal (Geb. 66, E33/34)</room>
        <slug></slug>
        <title>WYTIWYS (What You Type Is What You See) </title>
        <subtitle>Webbasierter interaktiver Terminal als Schnittstelle zwischen OpenLayers und PostGIS</subtitle>
        <track>Vortr&#228;ge</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Im Rahmen einer Ver&#246;ffentlichung die insbesondere didaktische Zwecke verfolgt, hat der Autor einen OpenSource WebGIS-Prototypen entwickelt, der die Interaktion eines Benutzers mit PostGIS anschaulich auf einem OpenLayers-Client visualisiert.

R&#228;umliche Anfragen an PostGIS (z. B. "Erzeuge ein Polygon mit den Koordinaten ...", "Gib mir die L&#228;nge des LINESTRING(...)", "Vereinfache die Linie 'ABC' mit einem Toleranzwert von 'k'" ...) k&#246;nnen in einen HTML-Terminal eingegeben werden und die Antwort des Datenbankservers wird direkt an den Benutzer weitergegeben. Im Falle von Geometrien als R&#252;ckgabewert werden die Ergebnisse des SQLs direkt auf einer Karte visualisiert. Die Anschaulichkeit geographischer Konzepte wie etwa Vereinigung, Differenz, etc. ist sicherlich h&#246;her als in einer alternativen Repr&#228;sentation wie etwa WKT (Well Known Text).

Der Vortrag m&#246;chte den Prototypen vorstellen und diskutieren, wo Anwendungsgebiete liegen k&#246;nnten. Daneben sollen Ideen zur Weiterentwicklung vorgestellt und diskutiert werden. Da das Projekt in einer extrem fr&#252;hen Phase vorgestellt wird, ist das Feedback des Auditoriums sehr wichtig und vergleichsweise einfach zu integrieren.</abstract>
        <description></description>
        <persons>
          <person id="34">Marc Jansen</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="64">
        <start>12:00</start>
        <duration>00:30</duration>
        <room>Gro&#223;er H&#246;rsaal (Geb. 66, E33/34)</room>
        <slug></slug>
        <title>Geoprozessieren mit PostgreSQL/PostGIS und R</title>
        <subtitle>Automatisierte Ableitung einer Gebietsgliederung aus Punktdaten</subtitle>
        <track>Vortr&#228;ge</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Gezeigt wird die automatisierte Ableitung einer Gebietsgliederung aus Punktdaten.

Ausgangsdaten sind Punktkoordinaten mit einem Hinweis auf die Gebietszugeh&#246;rigkeit: PLZ, Stimmbezirk, Verkehrszelle oder schlicht eine Adresse.

F&#252;r die Fl&#228;chenbildung wird aus den Punktdaten ein Voronoi-Diagramm erstellt. Anbindung der R-Bibliotheken an PostgreSQL/PostGIS. Die Fl&#228;chenerstellung erfolgt durch &#220;bergabe der Punktkoordinaten an den Voronoi-Algorithmus der R-Bibliothek. Ergebnis ist ein unregelm&#228;&#223;iges Mosaik dessen Zentren jeweils ein Punkt, in Relation zu den Nachbarpunkten, darstellt.

Die Voronoi-Fl&#228;chen werden mit dem zugeh&#246;rigen Gebietsmerkmal verbunden. Zusammengeh&#246;rende Fl&#228;chen vereinigt.

Das Bild (Anhang) zeigt ein Ergebnis dieses Verfahrens. Hier wurde die Gebietsgliederung mit Verwaltungsgrenzen verschnitten / veredelt.</abstract>
        <description></description>
        <persons>
          <person id="31">Harald Schwenk</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="42">
        <start>13:30</start>
        <duration>00:30</duration>
        <room>Gro&#223;er H&#246;rsaal (Geb. 66, E33/34)</room>
        <slug></slug>
        <title>Das Projekt &#8222;newGIS&#8220;</title>
        <subtitle>Bereitstellung einer auf Webservices basierten GIS-Infrastruktur unter Verwendung von gvSIG als Standardclient </subtitle>
        <track>Vortr&#228;ge</track>
        <type>lecture</type>
        <language></language>
        <abstract>Die Pr&#228;sentation dient der Erl&#228;uterung und Vorstellung der innovativen Architektur newGIS und der Funktionen und Kozepte des auf gvSIG basierenden Clients geneSIG. </abstract>
        <description>Das Projekt newGIS der Autonomen Provinz Bozen &#8211; S&#252;dtirol (APB) beinhaltet die Realisierung einer neuen GIS-Infrastruktur unter Verwendung von gvSIG als Standardclient und unter Verwendung von nach M&#246;glichkeit auf offenen Standards aufgebauten Schnittstellen. Die neue GIS Infrastruktur deckt s&#228;mtliche Bereiche von der Eingabe und Verwaltung georeferenzierter Daten bis hin zu deren  Manipulation und Visualisierung ab. Die im Rahmen von Analysen und basierend auf der Erfahrung mit ersten prototypischen Anwendungen definierte Infrastruktur sieht eine mehrschichtige &#8220;three-tier&#8221; Architektur mit folgender Auspr&#228;gung vor:

Anwendungsschicht: Auf dieser Ebene werden der Zugang und die Dienste f&#252;r den Anwender bereit gestellt.  Dies erfolgt typischer Weise &#252;ber geografische Webportale oder aber speziell entworfene, spezifische Clients.
Serviceschicht (middleware-layer): Diese Schicht beinhaltet s&#228;mtliche Komponenten und Dienste welche f&#252;r die Kommunikation zwischen der &#252;bergeordneten Anwendungsschicht und der darunter liegenden Datenschicht notwendig sind. Diese Schicht ist gem&#228;&#223; einer SOA-Architektur aufgebaut und kommuniziert &#252;ber Webservices und die Datenformaten XML/GML.
Datenschicht: Diese Ebene ist f&#252;r die Speicherung s&#228;mtlicher zugrunde liegender Daten verantwortlich. Ein wichtiger Aspekt ist der Umstand, dass diese Schicht auch f&#252;r die persistente Topologie und Sicherheit der geografischer Daten zust&#228;ndig ist sowie f&#252;r deren Integration und Verkn&#252;pfung mit alphanumerischen Daten. 

Die wichtigsten Konzepte der Infrastruktur newGIS sind ein modularer Aufbau sowie die Verwendung von standardisierten Schnittstellen. Aufgrund dieser Konzepte wird sicher gestellt, dass beliebige GIS-L&#246;sungen und -Produkte eingebunden werden k&#246;nnen (f&#252;r einige Bed&#252;rfnisse auch L&#246;sungen, die nicht aus dem GIS-Umfeld stammen) und Clients f&#252;r &#8222;newGIS&#8220; bereit stellen k&#246;nnen.
Die APB verfolgt das Ziel, sich von propriet&#228;ren Anwendungen zu l&#246;sen und hat in diesem Zusammenhang entschieden, gvSIG als neuen Standardclient einzusetzen. Aus diesem Grunde und um ein vollst&#228;ndiges und testbares System zu erhalten, wurde &#8211; parallel zur Umsetzung der allgemeinen Infrastruktur newGIS &#8211; eine Client-Anwendung als Pilotprojekt aufgesetzt. Dieses Pilotprojekt, &#8222;geneSIG&#8220;, wird unter der Verwendung der freien SW gvSIG umgesetzt.
Im Rahmen von geneSIG werden eine Reihe von Standardfunktionen entwickelt, welche dem Anwender die Interaktion mit der Infrastruktur newGIS erlauben. Es ist geplant, auch die Datenschicht auf eine freie und open-source-Technologie (PostgreSQL-PostGIS) umzustellen, sobald sich ein f&#252;r die Verwaltung gangbarer Weg abzeichnet.</description>
        <persons>
          <person id="133">Wolfgang Moser</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="108">
        <start>14:00</start>
        <duration>00:30</duration>
        <room>Gro&#223;er H&#246;rsaal (Geb. 66, E33/34)</room>
        <slug></slug>
        <title>QGIS im Einsatz f&#252;r Gemeinde-GIS</title>
        <subtitle>ein Praxisbericht</subtitle>
        <track>Vortr&#228;ge</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Der Beitrag zeigt wie QGIS als Desktop-GIS in der Gemeinde Uster, Kanton Z&#252;rich, eingef&#252;hrt wurde. Es wird ausgef&#252;hrt, welche H&#252;rden bei der Einf&#252;hrung von QGIS bew&#228;ltigt werden mussten, wie die Weiterentwicklung von QGIS mitgestaltet und unterst&#252;tzt wird (inhaltlich und finanziell) und &#252;ber welche Kan&#228;le der Support erfolgt. Schliesslich wird ein Vergleich zu kommerziellen Alternativen aufgezeigt und die Vor- und Nachteile gegen&#252;bergestellt. Anhand von Beispielen aus der Praxis werden einige neue Features von QGIS gezeigt die das Erfassen, Visualisieren und Auswerten von Geodaten vereinfachen.</abstract>
        <description>Die Stadt Uster hat sich vor 2.5 Jahren dazu entschieden die vorhanden GIS-Themen (Amtliche Vermessung und Leitungskataster) mit weiteren Themenfeldern und Datens&#228;tzen zu erg&#228;nzen um eine ganzheitliche Sicht auf die r&#228;umlichen Verh&#228;ltnisse im Stadtgebiet zu erhalten. Beim Ausbau hat man sich entschlossen die bestehenden kommerziellen GIS-Produktionssysteme (Produktlinie Autodesk Topobase) mit OS-GIS Komponenten zu erg&#228;nzen. Webdienste, sowie neue Themen werden mit OS-GIS umgesetzt, die bestehenden Themen werden mittelfristig mit der kommerziellen Software weitergef&#252;hrt. Als OS-GIS-Komponenten kommen Postgis, Geoserver, QGIS, GDAL/OGR und FDO zum Einsatz, neben der Basis-Infrastruktur bestehend aus Linux, Apache, PHP und Python.

Im Beitrag wird der "Werdegang" von QGIS innerhalb der Gemeindeverwaltung aufgezeigt. Fehlende Features mussten erst neu entwickelt werden um den Mitarbeitern ein benutzerfreundliches Arbeiten zu erm&#246;glichen. Davon betroffen waren etwa Editierfunktionen, Kartenlayout und Drucken, sowie Formularfunktionen. Heute ist QGIS soweit, dass es in vielen Bereichen mit kommerziellen Desktop-GIS mithalten kann, in einigen Bereichen diesen sogar &#252;berlegen ist. Ein grosser Vorteil gegen&#252;ber grossen kommerziellen Systemen ist etwa die schnellere Weiterentwicklung, die M&#246;glichkeit der Beeinflussung der Weiterentwicklung und der schneller Support. W&#228;hrend bei grossen Firmen erst das gut-abgeschirmte Entwicklerteam erreicht und &#252;berzeugt werden muss, dass die gew&#252;nschte Funktion auch f&#252;r andere Kunden von Nutzen sein kann, werden neue Features in QGIS oft in wenigen Tagen/Wochen implementiert.

Im Vortrag werden werden neue Digitalisierwerkzeuge und neuen Funktionen im Bereich Kartenlayout und Drucken vorgestellt. Die M&#246;glichkeit mit Python und dem QGIS-API eigene Plugins zu entwickeln wird auch in der Stadt Uster genutzt, etwa um andere Applikationen zu integrieren oder um andere Datenquellen in Formulare einzubinden. Ein grosser Fortschritt war die M&#246;glichkeit eigene Formulare mit qtDesigner zu gestalten. Damit kann der Standard-Attributdialog &#252;berschrieben und an die eigenen Bed&#252;rfnisse angepasst werden. Zudem k&#246;nnen so Webdienste eingebunden werden, wie z.B. ein webbasiertes Parzelleninformationssystem.

Anwendungsbeispiele aus den Bereichen Werkplan Abwasser, Leitungskataster, Gr&#252;nfl&#228;chenverwaltung und Parzellenauskunftssystem werden gezeigt.</description>
        <persons>
          <person id="79">Andreas Neumann</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="15">
        <start>14:30</start>
        <duration>00:30</duration>
        <room>Gro&#223;er H&#246;rsaal (Geb. 66, E33/34)</room>
        <slug></slug>
        <title>iGeoDesktop: deegree basiertes Desktop- und WebGIS, personalisierbar in Layout und Funktion</title>
        <subtitle></subtitle>
        <track>Vortr&#228;ge</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Mit iGeoDesktop hat deegree die Palette der angebotenen Komponenten um ein Desktop GIS erweitert. Neben dem Einsatz als eigenst&#228;ndige Anwendung l&#228;sst sich iGeoDesktop mittels Java Web Start zudem als WebGIS betreiben. In beiden Betriebsarten stehen Funktionen zur Personalisierung von Layout und Funktionalit&#228;t zur Verf&#252;gung. Damit ist es m&#246;glich, jedem Nutzer und jeden Arbeitsprozess die optimale Zusammenstellung an Funktionen mit einer jeweils optimierten Oberfl&#228;che anzubieten. Dies wird erm&#246;glicht durch die vollst&#228;ndige Modularisierung sowohl der Oberfl&#228;che als auch der verf&#252;gbaren GIS-Funktionalit&#228;t. Jede Funktion bzw. Funktionsgruppe wird in Form eines Moduls bereitgestellt und kann mittels verschiedener Nutzeroberfl&#228;chen und Men&#252;punkte in ein Projekt eingebunden werden. Nicht standardm&#228;&#223;ig bereitgestellte Funktionen k&#246;nnen durch zus&#228;tzliche, nicht zwingend in deegree entwicklte Module (plugins) integriert werden.

Neben den &#252;blichen GIS-Funktionalit&#228;ten bietet iGeoDesktop im Bereich der Anbindung von Datenquellen verschiedene Optionen, wie das Lazy-Loading, die es erm&#246;glichen, auch auf sehr gro&#223;er Datenbest&#228;nden von mehreren Millionen Objekten performant zu arbeiten. Neben g&#228;ngigen Formaten wie OGC WMS/WFS/WCS oder ESRI shapefiles etc. werde auch Direktzugriff auf Geodatenbanken (Oracle, Postgis) und Bildreferenzierungen mittels Exif-Header unterst&#252;tzt. Zahlreiche Digitialisier- und Konstruktionsfunktionen gestatten zudem die umfangreiche Manipulation von Datenbest&#228;nden. Verschiedene Analysefunktionen runden die Palette der gebr&#228;uchlichen GIS-Funktionen ab.

Ein besonderes Merkmal von iGeoDesktop ist der ebenfalls als eigenst&#228;ndiges Modul realisierte StyleEditor. Durch geschickten Einsatz der &#252;ber die OGC Styled Layer Descriptor definierten Elemente lassen sich problemlos auch komplexe Zeichenvorschriften realisieren. Das aus Jasper Reports aufsetzende Druckmodul erlaubt es, auch aufw&#228;ndig gestaltete Karten kombiniert mit Benutzereingaben wie Titel, Beschreibung oder einem Logo in hoher Qualit&#228;t als Druckvorlagen im PDF-Format zu erstellen. Unterst&#252;tzt werden Gr&#246;&#223;en von  DinA5 bis DinA0; die verwendete DPI-Zahl kann von Nutzer vorgegeben werden.

</abstract>
        <description></description>
        <persons>
          <person id="18">Andreas Poth</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="132">
        <start>15:30</start>
        <duration>00:30</duration>
        <room>Gro&#223;er H&#246;rsaal (Geb. 66, E33/34)</room>
        <slug></slug>
        <title>Neues vom QGIS Projekt</title>
        <subtitle></subtitle>
        <track>Vortr&#228;ge</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Das QGIS Projekt hat zum Ziel, ein plattformunabh&#228;ngiges, einfach zu bedienendes und offenes Desktop GIS zu entwickeln. Im vergangenen Jahr hat die Aktivit&#228;t in der QGIS-Community erneut zugenommen. Seit der letzten FOSSGIS Konferenz in Hannover hat sich QGIS, in Versionsnummern ausgedr&#252;ckt, von 1.0 zu 1.4 weiterentwickelt. Sucht man sich (aus der Liste der svn commits) alle Neuerungen seit 1.0 heraus, so kommt man auf eine Liste, die den Rahmen dieses Artikels bei weitem sprengen w&#252;rde. Daher stellen wir mit den Attributformularen, dem Field calculator und dem GPS tracking lediglich eine kleine Auswahl der Entwicklungen in 1.4 und der kommenden Version 1.5 vor.

-Attributformulare: QGIS bietet ab der Version 1.4 nun auch die M&#246;glichkeit mit dem Qt Designer entworfene Formular als Attributformulare zu verwenden. Diese k&#246;nnen aus dem Abfrageergebnisfenster heraus ge&#246;ffnet werden
-GPS live tracking: In der aktuellen Entwicklerversion (1.5) gibt es jetzt aber auch die M&#246;glichkeit, ein GPS Ger&#228;t am seriellen Port (oder mit USB Adapter) anzustecken und auf die Daten zuzugreifen, die das Ger&#228;t gerade im Moment liefert.
So kann z.B. die aktuelle Position mit einem Symbol auf der Karte dargestellt werden und es koennen auch Objekte digitalisiert werden.
- FieldCalculator: Seit Version 1.4 gibt es in QGIS auch das beliebte Taschenrechnertool. Damit kann man ein neues Attribut als Formel berechnen, wobei man auf die Werte anderer Attribute in die Berechnung miteinbeziehen kann. Es ist auch m&#246;glich, ein bereits bestehendes Attribut zu &#252;berschreiben.



</abstract>
        <description></description>
        <persons>
          <person id="121">J&#252;rgen Fischer</person>
          <person id="100">Marco Hugentobler</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="83">
        <start>16:00</start>
        <duration>00:30</duration>
        <room>Gro&#223;er H&#246;rsaal (Geb. 66, E33/34)</room>
        <slug></slug>
        <title>FOSS-basiertes Desktop Mapping</title>
        <subtitle>Kartographische Visualisierung mit Freier und Open Source Software</subtitle>
        <track>Vortr&#228;ge</track>
        <type>lecture</type>
        <language></language>
        <abstract>Im Zeitalter von Internet und Multimedia ist Visualisierung eines der Schl&#252;sselkonzepte f&#252;r die Gewinnung und Analyse raumbezogener Informationen. Geodaten - als Basiselemente zur Ableitung von Geoinformation - sind seit jeher in kartografischen Darstellungen dokumentiert. Kartografische Visualisierungen in Form von fachgerecht modellierten Karten oder kar-tenverwandten Darstellungen sind zentrale Medien zur Pr&#228;sentation und Nutzung von Geoin-formation. Die digitale Produktion hochqualitativer Kartengrafiken ist bis heute klassische Aufgabe des Desktop Mapping (DTM) und wird als Dienstleistung &#252;berwiegend von Klein- und Mittelst&#228;ndischen Unternehmen (KMU) angeboten. Aufgrund des exponentiellen Zu-wachses an Geodaten &#252;ber die letzten Dekaden kann der Nachfrage nach hochqualitativen Kartengrafiken auf diese traditionelle Weise jedoch kaum mehr entsprochen werden. Daher w&#228;chst der Bedarf an Systemen und Anbietern, die es erm&#246;glichen aus Geodatenbest&#228;nden schnell und kosteng&#252;nstig hochqualitative Visualisierungen (u.a. Kartengrafiken) zu generie-ren. Vor diesem Hintergrund ergibt sich f&#252;r die meisten KMU die Notwendigkeit, ihre Produk-tionsbasis der DTM-Systeme auf eine stabile und interoperable Basis einer Geodatenbank oder eines Geoinformationssystems (GIS) umzustellen bzw. zu erweitern. Diesen Umstieg mittels FOSS-Komponenten zu gestalten, kann nicht nur KMU einen freien und kosteng&#252;ns-tigen Weg er&#246;ffnen gekoppelte GIS/DTM-Funktionalit&#228;ten zu nutzen, um kartografisch hoch-wertige Kartengrafiken zu kompilieren und zu produzieren. Dieser Beitrag stellt eine Analyse m&#246;glicher Systemkomponenten (z.B. Inkscape, Sodipodi, GRASS, QGIS) zur FOSS-basierten kartografischen Visualisierung und Kartenproduktion vor.</abstract>
        <description></description>
        <persons>
          <person id="59">Rita Engemaier</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="127">
        <start>16:30</start>
        <duration>00:30</duration>
        <room>Gro&#223;er H&#246;rsaal (Geb. 66, E33/34)</room>
        <slug></slug>
        <title>SpatiaLite, das Shapefile der Zukunft?</title>
        <subtitle></subtitle>
        <track>Vortr&#228;ge</track>
        <type>lecture</type>
        <language></language>
        <abstract>Aufbauend auf der etablierten Embedded-Datenbank SQLite, steht seit M&#228;rz 2008 das neue Geodatenformat &#8222;SpatiaLite&#8220; zur Verf&#252;gung. &#196;hnlich der PostGIS-Bibliothek f&#252;r die Client-Server Datenbank PostgreSQL, erweitert SpatiaLite die SQL-Funktionalit&#228;t von SQLite um geografische Objekte und Funktionen.
Damit steht erstmals ein offenes und leistungsf&#228;higes Format zur Verf&#252;gung, dass die guten alten Shapefiles abl&#246;sen k&#246;nnte.

SpatiaLite basiert auf den OGC-Spezifikationen f&#252;r Geometrie-Formate (WKT, WKB) und Funktionen wie AsText(), GeomFromText(), Area(), PointN(), usw. Dank der integrierten GEOS-Bibliothek wird wie bei PostGIS ein kompletter Satz von geometrischen Operationen unterst&#252;tzt. Weitere Eigenschaften sind:
- Speicherung mehrerer Tabellen und Indizes in einem einzelnen Datenbankfile
- Unterst&#252;tzung f&#252;r Metadaten
- Eingebaute Shapefile Import- und Exportfunktionen
- Koordinatentransformation mittels integrierter PROJ.4 Bibliothek
- Zeichensatzkonversionen mit eingebauter GNU libiconv
- Einbindung externer Shapefiles und Textdateien als virtuelle Tabellen
- Bibliothek f&#252;r Rasterdaten
- Kommandozeilen- und GUI-Tools

Trotz des jungen Alters wird das Format schon von mehreren GIS-Tools unterst&#252;tzt. QGIS hat SpatialLite bereits eingebaut und bietet nahezu die gleiche Editier- und Analyse-Funktionalit&#228;t wie mit Shapefiles und PostGIS-Daten. Auch OGR/GDAL und FDO enthalten in den aktuellen Versionen Treiber f&#252;r SpatiaLite.</abstract>
        <description></description>
        <persons>
          <person id="99">Pirmin Kalberer</person>
        </persons>
        <links>
          <link href="http://www.gaia-gis.it/spatialite/">http://www.gaia-gis.it/spatialite/</link>
          <link href="http://www.sourcepole.ch/spatialite">http://www.sourcepole.ch/spatialite</link>
        </links>
      </event>
    </room>
    <room name="Kleiner H&#246;rsaal (Geb. 35, E01)">
      <event id="126">
        <start>09:00</start>
        <duration>00:30</duration>
        <room>Kleiner H&#246;rsaal (Geb. 35, E01)</room>
        <slug></slug>
        <title>GIS mit Ruby on Rails</title>
        <subtitle></subtitle>
        <track>Vortr&#228;ge</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Ruby on Rails ist ein quelloffenes Web-Framework, mit dessen Erscheinung im Jahr 2004 eine neue &#196;ra in der Entwicklung von Web 2.0 Anwendungen begonnen hat. Aktuelle Aush&#228;ngeschilder von beliebten Rails-Applikationen sind Twitter und GitHub.
Auch f&#252;r Open Source GIS Entwickler stehen mit Plugins f&#252;r OpenLayers und Mapfish zwei umfangreiche Web-GIS Frameworks zur Verf&#252;gung.

Nach einem kurzen &#220;berblick &#252;ber das Ruby on Rails Framework wird auf die Eigenschaften der verf&#252;gbaren Plugins im GIS-Bereich eingegangen:
* MapFish: Web Mapping Framwork mit REST-Protokoll als Client-Server Schnittstelle
* MapLayers: Integration von OpenLayers und OGC Service-Publikation von Geodaten
* GeoRuby: Adapter f&#252;r PostGIS und MySQL
* GeoKit, Graticule und acts_as_geocodable: Geokodierung und Distanzberechnungen
* GDAL/OGR Ruby bindings</abstract>
        <description></description>
        <persons>
          <person id="99">Pirmin Kalberer</person>
        </persons>
        <links>
          <link href="http://rubyonrails.org/">Homepage Ruby on Rails</link>
          <link href="http://mapfish.org/doc/implementations/rails.html">Mapfish Rails Plugin</link>
          <link href="http://wiki.github.com/pka/map_layers">Openlayers Rails Plugin</link>
        </links>
      </event>
      <event id="47">
        <start>09:30</start>
        <duration>00:30</duration>
        <room>Kleiner H&#246;rsaal (Geb. 35, E01)</room>
        <slug></slug>
        <title>GIS GRASS als WPS Backend</title>
        <subtitle>Neue Entwicklungen in GIS GRASS zur Unterst&#252;tzung von Web-Processing-Services</subtitle>
        <track>Vortr&#228;ge</track>
        <type>lecture</type>
        <language></language>
        <abstract>Das GIS GRASS bietet sich durch seinen modularen Aufbau und automatisierbarer Arbeitsabl&#228;ufe ideal als Backend f&#252;r Web-Processing-Services (WPS) an. Bisher war es allerdings aufw&#228;ndig das GIS GRASS als Backend in die meisten bestehenden Open Source WPS Server zu integrieren. Dies &#228;ndert sich nun durch neue Entwicklungen in GIS GRASS Version 7.

GIS GRASS 7 wurde dahingehend erweitert, das nun jedes in GRASS implementierte Modul (egal ob in C, C++, Shell oder Python) die automatische Erzeugung eines validen WPS process description XML Dokumentes unterst&#252;tzt. Damit entf&#228;llt die aufw&#228;ndige und meist per Hand erfolgte Generierung der Prozessbeschreibungen f&#252;r GRASS Module. Des Weiteren stellt GIS GRASS 7 ein Python Modul bereit, welches sich um die Generierung der korrekten Koordinatensysteme, der Erzeugung von temporalen GRASS Locations und Mapsets, dem Import und Export von Geodaten und der Ausf&#252;hrung des in der Prozessbeschreibung spezifizierten GRASS-Moduls k&#252;mmert.

In diesem Vortrag werden diese Neuerungen vorgestellt und Strategien zur Implementierung in bestehende Open Source WPS Server kurz erl&#228;utert.</abstract>
        <description></description>
        <persons>
          <person id="35">S&#246;ren Gebbert</person>
        </persons>
        <links>
          <link href="http://grass.osgeo.org/wiki/WPS">GIS GRASS WPS Support</link>
        </links>
      </event>
      <event id="46">
        <start>10:00</start>
        <duration>00:30</duration>
        <room>Kleiner H&#246;rsaal (Geb. 35, E01)</room>
        <slug></slug>
        <title>Unbekannte Features des UMN MapServer</title>
        <subtitle>Kleine Nettigkeiten und unbekannte F&#228;higkeiten des weit verbreiteten MapServers</subtitle>
        <track>Vortr&#228;ge</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Der UMN MapServer, einer der &#228;ltesten und am weitesten verbreitetsten
Kartenserver erfreut sich auch vor dem Hintergrund der
JavaScript-basierten Karten-Klienten wachsender Beliebtheit. Dies liegt
nicht zuletzt an der einfachen Konfigurierbarkeit sowie der guten
Dokumentation. Dennoch gibt es neben den weit verbreiteten Funktionen auch
Funktionalit&#228;ten, die der breiten Masse nicht bekannt sind, im
Arbeitsalltag mit dem UMN MapServer aber ungemein helfen.

Dieser Vortrag wird daher die Seiten des UMN MapServer beleuchten, die noch nicht
jeder zu Gesicht bekommen hat. Viele der Nettigkeiten sind aus der
jahrelangen Erfahrung im Umgang mit dem UMN enstanden.

Programm:
* Kurzportrait des UMN MapServer
* Mapfile-Hacking
* MapServer-Basierte Dienste in Google-Maps und Virtual Earth
* Kartodiagramme
* Performance-Tuning
* Debugging
* Ausblick auf noch ausstehende Features in den n&#228;chsten Versionen
</abstract>
        <description></description>
        <persons>
          <person id="46">Stephan Holl</person>
        </persons>
        <links>
          <link href="http://www.mapserver.org">http://www.mapserver.org</link>
          <link href="http://www.intevation.de/geospatial">http://www.intevation.de/geospatial</link>
        </links>
      </event>
      <event id="9">
        <start>11:00</start>
        <duration>00:30</duration>
        <room>Kleiner H&#246;rsaal (Geb. 35, E01)</room>
        <slug></slug>
        <title>Gastronomief&#246;rderung durch OSM-Geodaten, WebMapping, mobile Navigation und City2Click-Codes</title>
        <subtitle></subtitle>
        <track>Vortr&#228;ge</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Das Projekt &#8222;Osnago&#8220; wird zurzeit am Institut f&#252;r Geoinformatik und Fernerkundung der Universit&#228;t Osnabr&#252;ck im Rahmen einer Dissertation entwickelt. Osnago stellt ein Informations- bzw. Verwaltungssystem f&#252;r (Osnabr&#252;cker) gastronomische Einrichtungen dar. In dem System k&#246;nnen eine Vielzahl von relevanten Informationen f&#252;r Gastronomiebesucher gespeichert werden. Die Informationen sind &#252;ber ein Portal und einen sog. &#8222;WebMapping-Klienten&#8220; (eine dynamische Kartenanwendung im Internet) von der Allgemeinheit abrufbar. Ein umfassendes Datenmodell erm&#246;glicht eine komplexe Suche basierend auf individuellen Nutzereingaben. &#220;ber den Webmapping-Klienten k&#246;nnen sich interessierte Gastronomiebesucher orientieren und z.B. Routen ausgeben lassen. Zudem k&#246;nnen eine Vielzahl von gastronomisch relevanten Faktoren (z.B. Service, Preis/Leistungsverh&#228;ltnis etc.) bewertet werden. Die Bewertungsergebnisse sind frei einsehbar. &#220;ber das Anbringen von sog. City2Click-Codes direkt an gastronomischen Einrichtungen k&#246;nnen Bewertungsergebnisse unterwegs z.B. via Handy abgerufen bzw. eigene Bewertungen get&#228;tigt werden. Nutzer k&#246;nnen zudem auf ihrem mobilen Ger&#228;t schnell erkennen, welche Objekte sich in ihrer N&#228;he befinden aber auch, welche Einrichtungen bestimmte Attribute aufweisen (z.B. &#214;ffnungszeiten, besondere Angebote etc.). Das Gesamtsystem wird unter einer Open Source Lizenz entwickelt.</abstract>
        <description>Das Projekt &#8222;Osnago&#8220; wird zurzeit am Institut f&#252;r Geoinformatik und Fernerkundung der Universit&#228;t Osnabr&#252;ck im Rahmen einer Dissertation entwickelt. Osnago stellt ein Informations- bzw. Verwaltungssystem f&#252;r (Osnabr&#252;cker) gastronomische Einrichtungen dar. Die Informationen sind &#252;ber ein Portal, einen mobilen Klienten und einen WebMapping-Klienten von der Allgemeinheit abrufbar. In einem CMS (Eigenbau, GNU LGPL) k&#246;nnen eine Vielzahl von relevanten Informationen f&#252;r Gastronomiebesucher gespeichert werden. Anders als bei bisher bestehenden Orientierungssystemen f&#252;r gastronomische Einrichtungen wird in diesem Falle ein sehr komplexes Datenmodell (in PostgreSQL/PostGIS) aufgebaut.

Neben den &#252;blichen Kontakt- und Adressdaten, &#214;ffnungszeiten und Bildern werden zudem sehr umfangreiche Grunddaten pr&#228;sentiert. F&#252;r Gastst&#228;tten-Objekte existieren z.B. Attribute hinsichtlich preislicher Sonderaktionen, Live-Musik, Ausstattung wie z.B. Kicker-Tisch, Billard, Fussball-Live&#220;bertragung oder Internetzugang f&#252;r G&#228;ste etc. Zudem kann beispielsweise angegeben werden, ob eine Einrichtung behindertengerecht gestaltet ist und ob M&#246;glichkeiten f&#252;r Raucher bestehen. In einer WebMapping-Applikation (OpenLayers/Mapfish) kann der Nutzer erkennen, welche Objekte wo verortet sind und zu diesen Abfragen stellen. Abfragbar sind alle Attribute, welche in dem Content Management System durch den Eigent&#252;mer der gastronomischen Einrichtung vergeben wurden. Zudem kann in der Karte navigiert werden (Zooming, Kartenausschnitt verschieben), Karten als PDF gedruckt und verschiedene Datenschichten an- und ausgeschalten werden.

Au&#223;erdem ist in der Anwendung ein Routingalgorithmus (pgRouting) integriert, welcher in dem Projekt ausgebaut wurde. Der Nutzer kann sich bequem z.B. den Weg von seinem Wohnort zu einer bestimmten gastronomischen Einrichtung ausgeben und sich diesen als PDF ausdrucken lassen. Die verwendeten Geodaten in dem Projekt stammen mit Ausnahme eines Google-Satellitenlayers ausschlie&#223;lich aus OpenStreetMap.

Das System ist an den Attributen gastronomischer Objekte (pub, fast_food, restaurant etc.) in OSM ausgerichtet. Werden beispielsweise Objekte dieser Art einer bestimmten Stadt exportiert so k&#246;nnen diese auf simple Art und Weise in die im Rahmen des Systems konzipierte Datenbank eingelesen werden und anschlie&#223;end in dem CMS attributiert werden.

In Osnago ist ein Bewertungssystem integriert. Jeder Besucher einer gastronomischen Einrichtung kann mittels eines Notensystems von 1-10 unterschiedliche Bereiche bewerten z.B. &#8222;Preis/Leistung Essen&#8220;, &#8222;Preis/Leistung Getr&#228;nke&#8220;, &#8222;Freundlichkeit Personal&#8220;, &#8222;Schnelligkeit Personal&#8220;, &#8222;Eingehen des Personals auf individuelle W&#252;nsche&#8220;, &#8222;Auswahl Speisen&#8220;, &#8222;Auswahl Getr&#228;nke&#8220;, &#8222;Sauberkeit&#8220; sowie textliche Anmerkungen schreiben. Zudem ist eine komplexe Suchm&#246;glichkeit eingebunden. Der interessierte Gast soll auf einfache Art und Weise herausfinden welche Einrichtungen z.B. Chinesisches Essen anbieten, mindestens 40 Sitzpl&#228;tze aufweisen, rollstuhlgerecht angelegt sind und z.B. an einem bestimmten Wochentag preisliche Sonderangebote anbieten.

Unterst&#252;tzt wird das System durch eine mobile Komponente. An m&#246;glichst vielen gastronomischen Einrichtungen der Stadt Osnabr&#252;ck soll ein sog. &#8222;City2Click-Code&#8220; auf speziellen Schildern angebracht werden.

Durch Abfotografieren dieses &#8222;Mobile-Tag-Codes&#8220; mit einem Handy, I-Phone oder PDA und die Nutzung einer kostenlosen Software (die in dem Projekt zu verwendende Software "Beetagg-Reader" (allerdings kein Open Source) kann mittlerweile von &#252;ber 80 unterschiedlichen Handy bzw. PDA-Typen genutzt werden, diese wird nach Absenden einer SMS kostenlos auf dem mobilen Ger&#228;t installiert) wird man direkt via Internet zu einem mobilen Kartenklienten (&#8222;Osnamobil&#8220; (GNU LGPL)) u.a. mit den Bewertungsergebnissen des jeweiligen Objektes hingeleitet und bekommt somit schon vor dem Besuch der Einrichtung einen Eindruck von deren Qualit&#228;t. &#8222;Osnamobil&#8220; basiert auf MapServer-Technologie, ist erstellt mit PHP/MapScript und hat ebenfalls eine Routingfunktion integriert (pgRouting).

Um eine Nachhaltigkeit des Systems zu unterst&#252;tzen erhalten B&#252;rger die M&#246;glichkeit &#252;ber ein Eingabeformular bzw. eine Karte im Internet eine neu dazukommende bzw. wegfallende Einrichtung zu &#8222;melden&#8220;. Gerade im gastronomischen Bereich ist eine hohe Fluktuation von Objekten bzw. Besitzern zu konstatieren, welche durch den &#8222;B&#252;rgerinput&#8220; registriert werden soll. Geplant ist es den Quellcode des gesamten Systems am Tag des Vortrages erstmalig f&#252;r die Allgemeinheit frei zu schalten, so dass das System von beliebigen St&#228;dten und Kommunen als eigene Plattform installiert, ver&#228;ndert und eingesetzt werden kann Ein produktiver Einsatz des Systems ist f&#252;r Osnabr&#252;ck ab Mai 2010 geplant.</description>
        <persons>
          <person id="11">Kai Behncke</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="131">
        <start>11:30</start>
        <duration>00:30</duration>
        <room>Kleiner H&#246;rsaal (Geb. 35, E01)</room>
        <slug></slug>
        <title>Mobile Geodatenvisualisierung mit Android</title>
        <subtitle></subtitle>
        <track>Vortr&#228;ge</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Diese Arbeit besch&#228;ftigt sich mit der Visualisierung von zwei- und dreidimensionalen Geodaten mit Googles mobilem Open Source Betriebssystem Android.</abstract>
        <description>Mit der zunehmenden Leistungsf&#228;higkeit mobiler Endger&#228;te wird es immer reizvoller, Desktopanwendungen mobil verf&#252;gbar zu machen. Nicht nur der st&#228;ndig verf&#252;gbare Netzzugriff, sondern vor allem die steigende Rechengeschwindigkeit, GPS Empf&#228;nger, Beschleunigungssensoren und Kameras in heutigen Smartphones machen es m&#246;glich, Daten &#252;berall standortbezogen abzufragen. W&#228;hrend ein Geoinformationssystem (GIS) im herk&#246;mmlichen Sinn hohe Rechenkapazit&#228;t f&#252;r immer komplexere Werkzeuge fordert und enorme Datenmengen bearbeitet, macht es besonders die Arbeit mit georeferenzierten Daten oft erforderlich, sich &#8222;vor Ort&#8220; ein Bild zu machen. Als erster Schritt in Richtung eines freien mobilen Geoinformationssystems wurde im &#8222;Studienprojekt Geoinformatik&#8220; an der Universit&#228;t Osnabr&#252;ck eine Applikation f&#252;r Googles mobiles Open-Source-Betriebssystem Android entwickelt, auf deren Basis die Eignung verschiedener Ans&#228;tze untersucht wird. Zu Beginn der Betrachtung steht die Darstellung zweidimensionaler Geodaten mit Hilfe der standardisierten Schnittstellen Web Map Service (WMS) f&#252;r Rasterdaten und Kartenmaterial sowie Sensor Observation Service (SOS) f&#252;r raumbezogene Sensordaten. Weiterhin werden Really Simple Syndication (RSS) Feeds mit Raumbezug (GeoRSS) genutzt. An ihnen wird &#252;berpr&#252;ft, wie der Endnutzer &#252;ber raumbezogene Ereignisse, wie sie beispielsweise bei Fr&#252;hwarnsystemen gegen Naturgefahren ben&#246;tigt werden, informiert werden kann. Zur Beurteilung der potentiellen Leistungsf&#228;higkeit mobiler Geoinformationssysteme werden am Ende der Betrachtung dreidimensionale geologische Daten mit OpenGL ES auf dem mobilen Ger&#228;t visualisiert. Den speziellen Anforderungen der Applikationsentwicklung auf mobilen Endger&#228;ten wird dabei Rechnung getragen. Die Applikation soll schlie&#223;lich im ersten Quartal 2010 als freie Software ver&#246;ffentlicht werden.</description>
        <persons>
          <person id="102">Mathias Menninghaus</person>
        </persons>
        <links>
          <link href="http://code.google.com/p/mobiledroidgis/">Quellcode</link>
        </links>
      </event>
      <event id="34">
        <start>12:00</start>
        <duration>00:30</duration>
        <room>Kleiner H&#246;rsaal (Geb. 35, E01)</room>
        <slug></slug>
        <title>Augmented Reality basierte Fu&#223;g&#228;ngernavigation</title>
        <subtitle>Bew&#228;hrte und Neue Software</subtitle>
        <track>Vortr&#228;ge</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Die Navigation von Fu&#223;g&#228;ngern unterscheidet sich grunds&#228;tzlich von bisher bekannten Systemen aus Fahrzeugen. Permanente Navigation wird nicht ben&#246;tigt. Vielmehr soll auf einfache und leicht verst&#228;ndliche Weise jederzeit die Technik als Hilfsmittel an Entscheidungspunkten hinzugezogen werden. Dabei ist der Detailgehalt der Anweisung von entscheidender Bedeutung. Die Schwierigkeit f&#252;r den Nutzer liegt darin R&#252;ckschl&#252;sse aus der Anweisung auf die reale Situation zu ziehen. Abstrakte Darstellungen in virtuellen Welten oder nicht ma&#223;stabsgerechte Kartendarstellungen verunsichern den Anwender. Die Kombination von Echtzeit Kamerabildern und lagegetreuen virtuellen Routenanweisungen in Form einer Augmented Reality (Erweiterten Realit&#228;t) bietet die notwendige Basis einer zielgruppengerechten Navigation und deckt die Bed&#252;rfnisse von Fu&#223;g&#228;ngern vollst&#228;ndig ab.
	
Augmented Reality (AR) beschreibt die Synthese von detailreichen realen Bilddaten mit virtuellen Routeninformationen. Der Vorteil besteht in der klaren und unmissverst&#228;ndlichen Darstellung der Anweisungen vor der realen Ansicht, so dass AR besonders f&#252;r Fu&#223;g&#228;nger geeignet ist. 

Mit der neuesten Smartphone-Generation h&#228;lt die Technik auch in mobilen Applikationen Einzug. Um die Darstellung von Kamerabildern und Virtuellem Modell nahezu deckungsgleich zu &#252;berlagern, wird die Lage und Ausrichtung des Ger&#228;tes sensorisch erfasst. Das Konzept basiert auf dem Abfilmen der Umgebung mit Hilfe einer Kamera. Daraufhin werden georeferenzierte Informationen, wie etwa Stra&#223;en oder interessante Punkte, mit der Lage des Ger&#228;tes verrechnet und &#252;ber die Kameraansicht abgebildet.

Das Ergebnis stellt eine nahezu deckungsgleiche Mischung realer und virtueller Bilddaten dar, die die beiden Vorteile Aktualit&#228;t und Pr&#228;zision verbinden. Somit ist es m&#246;glich, die betreffenden Entscheidungspunkte, wie etwa Fu&#223;wege, Ampelkreuzungen oder Hauseing&#228;nge, direkt und frontal zu betrachten. Mit Hilfe eines &#8222;Reality View&#8220; wird das eingeschr&#228;nkte, reale  Sichtfeld des Benutzers durch weitsichtige Routeninformationen angereichert und in Kombination aus beiden Elementen als AR wiedergegeben.	
Der &#8222;Reality View&#8220; basiert auf dem Open Source (GNU) Fahrzeugnavigationssystem Navit f&#252;r Linux Systeme. Navit war eines der ersten freien und funktionsf&#228;higen  Navigationssysteme mit eigenst&#228;ndiger Routingfunktion und der M&#246;glichkeit Open Street Map Daten zu verwenden. Aus diesem Grund lag es nahe die Entwicklung der &#8222;Reality View&#8220;-Spezialisierung zum Fu&#223;g&#228;ngernavigationssystem auf Basis von Navit zu realisieren. Mit dem Aufkommen der Android basierten Smartphone Generation war es m&#246;glich den Prototyp von einem Ultra Mobile PC (UMPC) auf eine fu&#223;g&#228;ngertaugliche Gr&#246;&#223;e zu reduzieren. Seither wird Navit und speziell der &#8222;Reality View&#8220; auch als Android Version angeboten und ver&#246;ffentlicht. Derzeit wird in einer ersten und umfangreichen Nutzerevaluation die Einsatzf&#228;higkeit und Effizienz des &#8222;Reality View&#8220; untersucht. Diese Ergebnisse und eine daran angeschlossene Trendstudie zu neuen Darstellungsm&#246;glichkeiten sollen helfen die Fu&#223;g&#228;ngernavigation noch mehr auf deren Zielgruppe anzupassen und den &#8222;Reality View&#8220; als alternatives Fu&#223;g&#228;ngernavigationssystem zu etablieren.   
&#8222;Augmented Reality ist immer dort von Vorteil, wo man eine Information direkt vor Ort braucht, aber weder Zeit noch Lust f&#252;r Abstraktionsleistungen hat&#8220; [BARCZOK, A. HIMMELEIN, G. &amp; K&#214;NIG, P., (20/2009). Mit den Dritten sieht man besser. ct`-Magazin f&#252;r Computer und Technik] Das bedeutet, dass AR-Anwendungen sich gut zur Visualisierung r&#228;umlicher Daten eignen, da diese an der tats&#228;chlichen Position angezeigt werden k&#246;nnen. Diese Schlussfolgerung belegt, dass die navigationsbegleitende Umsetzung, wie der &#8222;Reality View&#8220;, den richtigen Weg f&#252;r flexible und mobile Fu&#223;g&#228;ngernavigation gefunden hat. 
</abstract>
        <description></description>
        <persons>
          <person id="37">Mario Kluge</person>
        </persons>
        <links>
          <link href="http://wiki.navit-project.org/index.php/Navit_with_Augmented_Reality">Navit Reality View</link>
          <link href="http://www.geographie.uni-potsdam.de/component/option,com_portfol/Itemid,625/task,viewcategory/vcatid,295/view,fullview/refid,60">Universit&#228;t Potsdam</link>
        </links>
      </event>
      <event id="86">
        <start>13:30</start>
        <duration>00:30</duration>
        <room>Kleiner H&#246;rsaal (Geb. 35, E01)</room>
        <slug></slug>
        <title>Webbasierte Erfassung von Tierartenvorkommen unter Verwendung von Open Source Software</title>
        <subtitle></subtitle>
        <track>Vortr&#228;ge</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Die Beh&#246;rde f&#252;r Stadtentwicklung und Umwelt der Freien und Hansestadt Hamburg ist unter anderem f&#252;r die Koordination staatlicher Aufgaben auf dem Gebiet des Umwelt- und Naturschutzes zust&#228;ndig. So wird im Amt f&#252;r Natur- und Ressourcenschutz zurzeit das IT-Vorhaben &#8222;Artenkataster&#8220; umgesetzt. 

Artenrelevante Daten werden von diversen Stellen intern und extern erhoben. Hierbei kommen unter-schiedliche Softwarel&#246;sungen f&#252;r die Datenerfassung, -haltung und -fortf&#252;hrung zum Einsatz. Infolge-dessen liegen die Informationen an verschiedenen Stellen und in unterschiedlichen Formaten vor. Sie weisen zum Teil inhomogene Strukturierungen auf und eine Georeferenzierung ist, obwohl in der Regel ein Raumbezug vorhanden ist, nicht immer gegeben. 

Ziel ist es daher, alle &#8222;Altanwendungen&#8220;
&#8226;	auf eine leistungsf&#228;hige Datenbank
&#8226;	bei gleichzeitigem Re-Design und
&#8226;	notwendiger Erweiterung der Datenstruktur und der Benutzeroberfl&#228;che
&#8226;	sowie unter Einbindung von ArcGIS

zu migrieren.

Dienststellen der Stadt Hamburg und Externe sollen &#252;ber geeignete Intranet- bzw. Internetschnittstellen auf die Daten lesend und schreibend zugreifen k&#246;nnen. Zu diesem Zweck wird zurzeit, im Auftrag der Beh&#246;rde f&#252;r Stadtentwicklung und Umwelt vom Landesbetrieb f&#252;r Geoinformation und Vermessung f&#252;r das Internet eine Webanwendung, bestehend aus einer Erfassungs- und einer Auskunftskomponente als ein Baustein des Artenkatasters entwickelt.


Webanwendung
Um eine Integration des Systems in die Geodateninfrastruktur Hamburg zu gew&#228;hrleisten, wurde bei der Entwicklung der Webanwendung auf die Einhaltung bestehender Standards und Normen gem&#228;&#223; OGC-Spezifikationen Wert gelegt. Die Visualisierung und Erfassung der Geofachdaten erfolgt &#252;ber Web-Map- bzw. transaktionale Web-Feature-Services. Die WMS-Dienste werden &#252;ber das OpenSource-Framework deegree bereit gestellt. F&#252;r die WFS-T-Dienste kommt der Geoserver zum Einsatz. Als Datenbank wird PostgreSQL / PostGIS verwendet und als Web-Frontend dient die Client-Anwendung Mapbender.

Die Darstellung der Fachdaten erfolgt auf Basis verschiedener Hintergrundkarten wie der Regional- oder Stadtkarte von Hamburg, der Digitalen Karte 1:5.000 (DK5) oder digitalen Orthophotos. 

Abb. 1 zeigt die grafische Benutzeroberfl&#228;che der Webanwendung. Neben den &#252;blichen Standard-funktionen wie PDF-Druck oder Adresssuche verf&#252;gt das System &#252;ber die M&#246;glichkeit, Objekte zu kopieren und die Visualisierung der erfassten Daten hinsichtlich des angemeldeten Benutzers oder einer bestimmten Tierart zu filtern. So wird bei der Digitalisierung von Tierartenvorkommen automa-tisch der Name des angemeldeten Benutzers erfasst. Diese Information wird verwendet, um die Visua-lisierung und den Datenzugriff per WFS auf die selbst erfassten Datens&#228;tze zu beschr&#228;nken. 

Weiterhin hat der Benutzer die M&#246;glichkeit, nach bestimmten Tierarten zu suchen und die &#252;brigen Tierartenvorkommen derselben Artengruppe automatisch im Kartenausschnitt auszublenden. F&#252;r die beschriebenen Darstellungsfilter werden zur Laufzeit SLD-Dateien erzeugt und dynamisch in den Web-Client eingebunden. 

F&#252;r die Digitalisierung von Objekten wurden verschiedene Featuretypes mit jeweils individuellem Datenschema erstellt. Neben den Vorkommen bestimmter Tierarten (Punktobjekte), k&#246;nnen, z. B. zur Abgrenzung von Untersuchungsgebieten, auch fl&#228;chenhafte oder linienf&#246;rmige Objekte digitalisiert werden. 

Um die Erfassungsmaske zur Eingabe der Sachdaten m&#246;glichst &#252;bersichtlich zu halten, wurde diese mit Hilfe von Karteireitern nach thematischen Gesichtspunkten gegliedert (s. Abb. 2). 

Mit der vorgestellten Web-GIS-L&#246;sung steht eine Anwendung zur Verf&#252;gung, die eine dezentrale Erfassung strukturierter Daten bei zentraler Datenhaltung erm&#246;glicht. Die Voraussetzungen zur Nutzung des Systems auf Anwenderseite beschr&#228;nken sich auf ein Eingabeger&#228;t mit Internetverbindung und einen aktuellen Browser. Die erfassten Daten sind ohne Konvertierungsaufwand interoperabel nutzbar.</abstract>
        <description></description>
        <persons>
          <person id="29">Dirk Rohrmoser</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="17">
        <start>14:00</start>
        <duration>00:30</duration>
        <room>Kleiner H&#246;rsaal (Geb. 35, E01)</room>
        <slug></slug>
        <title>Regionalisierung von organischem Kohlenstoff in B&#246;den Deutschlands</title>
        <subtitle></subtitle>
        <track>Vortr&#228;ge</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Die organische Substanz der B&#246;den ist eine Gr&#246;&#223;e, die durch das Klima ma&#223;geblich gesteuert wird. Die mittlere Verweildauer von Kohlenstoff in der organischen Substanz wird mit durchschnittlich 30 Jahren abgesch&#228;tzt. Die Bildungsrate stabiler Humussubstanz, die in den B&#246;den eingespeichert wird, ist relativ gering. Spannen von 0,2 bis 12 g C/m&#178;/a werden angegeben. Verweildauer und Bildungsrate sind stark an klimatische Faktoren gekoppelt. Feinstboden (Ton und Schluff) kann f&#252;r Anreicherung/Festlegung von organischer Substanz f&#246;rderlich sein. Die Nutzungsform hat entscheidenden Einfluss.

Um den Parameter &#8222;organischer Kohlenstoff&#8220; zur regionalen Bewertung der Bodeneigenschaften und deren Ver&#228;nderungspotentials (Klimafolgenforschung) einsetzen zu k&#246;nnen, sind die Darstellung der r&#228;umlichen Verteilung, die Beschreibung korrelativer Zusammenh&#228;nge mit Klimavariablen und Bodenparametern sowie die Interpretation der r&#228;umlichen Muster die Voraussetzung.

F&#252;r die ackerbaulich genutzte Fl&#228;che Deutschlands werden das Verfahren und die Ergebnisse vorgestellt. Die gesamte Arbeit wurde im Zusammenspiel von Software aus Open Source Projekten geleistet. Zum Einsatz kamen: GRASS, PostgreSQL, PostGIS, R und gstat. Neben der Ergebnisdarstellung und -diskussion, wie der aus verschiedenen Verfahren der Regionalisierung, geht es auch um die Beurteilung der Arbeitsweise mit Open Source Software (Kommando-Dateien, Skripttechnik, Reproduzierbarkeit ...), die sich deutlich von der mit propriet&#228;ren Softwareprodukten unterscheidet.</abstract>
        <description>Motivation und Datengrundlage
eingesetzte Verfahren: Statistik und Regionalisierung
organischer Kohlenstoff in Oberb&#246;den Deutschlands (Verteilung, Muster und Zusanmmenh&#228;nge)
Vergleich der Ergebnisse aus simple kriging und IDW Regionalisierung
Darstellung der modularen Arbeitsweise mit Software aus den Open Source Projekten    
 </description>
        <persons>
          <person id="21">Michael Fuchs</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="39">
        <start>14:30</start>
        <duration>00:30</duration>
        <room>Kleiner H&#246;rsaal (Geb. 35, E01)</room>
        <slug></slug>
        <title>Fernerkundung mit GRASS GIS</title>
        <subtitle>Ein Funktions&#252;berblick am Beispiel von Projekten zur semiautomatisierten Vegetationserfassung mittels digitaler Luftbilddaten.</subtitle>
        <track>Vortr&#228;ge</track>
        <type>lecture</type>
        <language></language>
        <abstract>Vegetationskartierungen sind aktuell wie in der Vergangenheit das wichtigste und genaueste Element zur fl&#228;chendeckenden Dokumentation des Ist-Zustandes. Dabei spielt die Auswertung und Analyse digitaler (multispektraler) Bilddaten eine wichtige Rolle, besonders wenn die zu kartierende Fl&#228;che sehr gro&#223; ist, Zeit- und Budgetrahmen aber begrenzende Parameter sind. Das Unternehmen nature-consult aus Hildesheim hat dazu seit 2003 ein sechsstufiges Verfahren entwickelt und etabliert, bei dem die klassische, fl&#228;chendeckende Vegetationskartierung mit den modernen Methoden der multispektralen Bilddatenanalyse kombiniert wird (siehe Literatur).

In dem Vortrag wird ein &#220;berblick zu dem gesamten Verfahren gegeben. Im Mittelpunkt stehen aber die fernerkundlichen Arbeitsschritte, die mit der Open Source Software GRASS durchgef&#252;hrt wurden. Dazu geh&#246;rt die Aufbereitung der multispektralen Luftbild- und Laserscandaten, das Erstellen zus&#228;tzlicher, &#8220;k&#252;nstlicher&#8221; Kan&#228;le, die &#252;berwachte geo-/radiometrisch kombinierte Klassifizierung sowie die Filterung der Klassifikation.  

Die direkte Anwendung der fernerkundlichen Arbeitsschritte wird anhand von Referenzprojekten f&#252;r die Nationalparkverwaltung Nds. Wattenmeer, die Nationalparkverwaltung Schleswig-Holsteinisches Wattenmeer, die Bundesanstalt f&#252;r Gew&#228;sserkunde und das Wasser- und Schifffahrtsamt Bremerhaven dokumentiert. Dabei kamen unterschiedliche Kamerasysteme zum Einsatz.

Kontakt zu den Autoren:

Otto Dassau					        Dr. J&#246;rg Petersen
Geoinformatik B&#252;ro Dassau			nature-consult
Davenstedter Str. 60, 30453 Hannover	Hackelbrink 21, 31139 Hildesheim
++49-(0)511-2615322				++49-(0)5121-287474
dassau@gbd-consult.de				petersen@nature-consult.de

Eine l&#228;ngere Version der vollst&#228;ndigen Methode finden Sie hier:
http://www.nature-consult.de/images/downl/Agit_2008_nature-consult.pdf
</abstract>
        <description></description>
        <persons>
          <person id="134">J&#246;rg Petersen</person>
          <person id="9">Otto Dassau</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="94">
        <start>15:30</start>
        <duration>00:30</duration>
        <room>Kleiner H&#246;rsaal (Geb. 35, E01)</room>
        <slug></slug>
        <title>GeoServer - Kleinigkeiten ganz gro&#223;?!</title>
        <subtitle></subtitle>
        <track>Vortr&#228;ge</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>GeoServer als ein Java-basierte Implementierung von OGC-Standards
unterst&#252;tzt im Web 2.0 eine Menge an Funktionen f&#252;r Geo-Mash-ups. U.a.
durch diese beiden Felder der offenen Standards und der Unterst&#252;tzung
der Breite an Einsatzfelder im Web 2.0 erfreut sich GeoServer
zunehmender Beliebheit.

Dieser Vortrag fokusiert auf typische Anwendungsf&#228;lle in den beiden
Gebieten und arbeitet "Kleinigkeiten" heraus, die die t&#228;gliche Arbeit
vereinfachen bzw. die Funktionsvielfalt kombinieren, um damit
interessante M&#246;glichkeiten neuer Applikationen zu erschaffen. Bei dem
Streifzug werden u.a. folgende Bereiche beleuchtet:

* REST Schnittstelle - neue M&#246;glichkeiten und Konsequenzen
* Serverseitiges Rendering mit OGC SLD und GML
* Nutzung von KML und GeoRSS in Mash-Ups
...

Dieser Vortrag wird Seiten von GeoServer beleuchten, die aus Details und
der Summe dieser neue Weg erschaffen. Viele der Nettigkeiten sind aus der
jahrelangen praktischen Erfahrung und Entwicklung mit und um
GeoServer/GeoTools enstanden.</abstract>
        <description></description>
        <persons>
          <person id="91">Tim Englich</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="56">
        <start>16:00</start>
        <duration>00:30</duration>
        <room>Kleiner H&#246;rsaal (Geb. 35, E01)</room>
        <slug></slug>
        <title>Verwebung von Sozialen Netzwerken und dem Sensor Web</title>
        <subtitle></subtitle>
        <track>Vortr&#228;ge</track>
        <type>lecture</type>
        <language></language>
        <abstract>Sensoren und komplexe Sensorsysteme k&#246;nnen heutzutage in jedem Haushalt gefunden werden. Ein Beispiel f&#252;r solche Systeme sind die zunehmend steigende Zahl von Heimwetterstationen. Heimwetterstationen sind ausgestattet mit einer Reihe von Sensoren, die das lokale Wetter in G&#228;rten und Balkonen vieler Menschen beobachten. &#220;blicherweise werden diese Daten nur privat vom Betreiber der Wetterstation genutzt. Viele der heutigen Heimwetterstations-Systeme bieten Schnittstellen, um sie mit dem PC zu verbinden. Daher ist die &#246;ffentliche Verteilung der gemessenen Daten &#252;ber das World Wide Web denkbar.</abstract>
        <description>Dieser Beitrag demonstriert die UWeather Anwendung, eine Internet Applikation, die es Nutzern erm&#246;glicht ihre Wetterstation zu registrieren und gemessene Daten zu ver&#246;ffentlichen. Die Anwendung ist basierend auf der Facebook Plattform entwickelt worden. Dies bringt den Vorteil mit sich, dass ein breites Spektrum der von diesem Sozialen Netzwerk bereits angebotenen Funktionalit&#228;t, wie z.B. die Nutzer-Verwaltung, Authentifikation oder Skalierung, wiederverwendet werden kann. Die Applikation integriert eine Google Maps Karte sowie eine Zeitreihen-Visualisierung. Die Kartenansicht zeigt die gemessenen Wetterdaten sowie Metadaten der Stationen in ihrem r&#228;umlichen Kontext. Die hochgeladenen Daten werden der &#214;ffentlichkeit frei und interoperabel &#252;ber den vom OGC standardisierten Sensor Observation Service (SOS) bereitgestellt. Dieser erlaubt es Messdaten standardisiert einzuf&#252;gen und ebenso abzufragen. Der Nutzer hat &#252;ber die UWeather Applikation Zugriff auf den SOS und kann den zeitlichen Verlauf der gemessenen Messgr&#246;&#223;en, z.B. Temperatur, Niederschlag oder Windgeschwindigkeit, visualisieren.
Die entwickelte Applikation demonstriert, wie ein Soziales Netzwerk mit Open Source Sensor Web Implementierungen erfolgreich verwoben werden kann. In Zukunft ergeben sich daraus spannende Entwicklungspotentiale. Beispielsweise ist angestrebt weitere Sensor Web Dienste, wie den Sensor Alert Service (SAS), einzubinden. Dies wird Nutzern erlauben, sich f&#252;r bestimmte Ereignisse zu registrieren und im Falle deren Eintretens Alarme zu empfangen (z.B. im Falle von sehr hohen Windgeschwindigkeiten). Weiterhin bildet die Applikation die Basis f&#252;r Studien &#252;ber die Nutzbarkeit freiwillig bereitgestellter Sensor Daten. Eine beispielhafte Forschungsfrage, die sich hierbei stellt ist: bis zu welchem Grad ist es m&#246;glich von Laien gemessene Sensordaten in professionellen Wetter- oder auch Hochwasser-Vorhersagesystemen zu verwenden?
</description>
        <persons>
          <person id="56">Arne Br&#246;ring</person>
          <person id="39">Simon Jirka</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="50">
        <start>16:30</start>
        <duration>00:30</duration>
        <room>Kleiner H&#246;rsaal (Geb. 35, E01)</room>
        <slug></slug>
        <title>Flexibles Change Management beim Betrieb abgesicherter Geowebdienste einer Geodateninfrastrukturen mit GISpatcher</title>
        <subtitle></subtitle>
        <track>Vortr&#228;ge</track>
        <type>lecture</type>
        <language></language>
        <abstract>Die Bereitstellung von Geodaten &#252;ber Web Map Services (WMS) in
Geodateninfrastrukturen ist heutezutage mehr die Regel als die Ausnahme.
Durch die standardisierten und offenen Schnittstellen der Dienste nach Standards des
Open Geospatial Consortium (OGC) ist der Zugang per se f&#252;r
jeden Nutzer m&#246;glich, der die Adresse des Dienstes kennt. Um die Vorteile eines
dienstebasierten Angebotes auch bei vertraulichen Daten weiter nutzen zu
k&#246;nnen, wird ein Absicherungsmechanismus ben&#246;tigt, &#252;ber den
Authentifizierung und Authorisierung geregelt werden k&#246;nnen. Da in
den Standards des OGC derartige Mechanismen weder abschlie&#223;end spezifiert
noch ver&#246;ffentlicht worden sind, besteht die Herausforderung darin, eine L&#246;sung
zu entwickeln, die das etablierte Miteinander von Diensten und Clients nur
minimal beeinflu&#223;t, um die Kosten bei bestehenden Komponeten gering zu halten
und auch weiterhin die M&#246;glichkeit zu behalten, um auf Anforderungs&#228;nderungen
auf den unterschiedlichen  Ebenen im laufenden Betrieb derart flexibel und nachhaltig reagieren
zu k&#246;nnen, dass die Servicequalit&#228;t nicht merklich beeinflusst wird.

Die technische L&#246;sung basiert durchg&#228;ngig auf den folgenden freien
Softwarekomponenten und hat sich bereits im Einsatz bew&#228;hrt:
- Inteproxy -- Nutzung des Absicherungsmechanismuses aus Desktop-GIS Clients,
- deegree owsProxy innerhalb von Apache Tomcat -- Unterst&#252;tzen von Authentifizierung und Authorisierung
- OSAAS -- Accountbezogene Auswertung von dienstebasierten Leistungen
- Apache Webserver -- Zertifikatsmanagement und Load-Balancer

Konzeptionelle Hintergr&#252;nde und technische Details sind bereits im Vortrag von
Holl, Fossgis 2009 dargestellt worden.

In diesem Vortrag wird nach einer Vorstellung der Konzepte, der
Komponenten und ihres Zusammenspiels der Schwerpunkt auf der nachhaltigen Realisierung
von Anforderungs&#228;nderungen bei gleichbleibender Servicequalit&#228;t liegen. Anhand
von Beispielen wird aufgezeigt, wie man auf die unterschiedlichsten neuen
Anforderungen im Umfeld einer wachsenden Infrastuktur im Webumfeld mit definierten Mechanismen
erfolgreich reagieren kann, die u.a. mit Paketbau und -management im Umfeld freier Softwareentwicklung
entstanden und etabliert sind.

- Wie kann der Wechsel des Backend-Produktes im laufenden Betrieb durchg&#228;ngig
realisiert werden?
- Welche konzeptionelle &#196;nderungen sind m&#246;glich und wie lassen sich diese
mit den vorhandenen Komponenten realisieren? Wo liegen M&#246;glichkeiten und
Grenzen?
- Welche Formen der Skalierung und des Failovers k&#246;nnen genutzt werden?

Im eigenes geschaffenen Projekt "GISpatcher" werden die Mechanismen u.a. zum Update- und
Packetbau im Rahmen eines freien Softwareentwicklungsprozesses verwaltet und
als qualit&#228;tsgesicherte Pakete f&#252;r debian- und rpm-basierte Systeme zum Download bereitgestellt. Sie bilden  die Grundlage f&#252;r eine nachhaltige, verl&#228;ssliche und managebare
GIS-Plattform, deren Hauptaugenmerk auf der Deployment-Phase liegt.
Damit wendet sich dieser Vortrag v.a. an Personen,
die eine Absicherung von OGC Webdiensten in einer produktiven Umgebung betreiben und
flexibel auf Anforderungs&#228;nderungen mit definierbaren Prozessen reagieren wollen
und m&#252;ssen.</abstract>
        <description></description>
        <persons>
          <person id="6">Hans Plum</person>
        </persons>
        <links>
        </links>
      </event>
    </room>
    <room name="Workshop 1 (Geb. SI, SI0201)">
      <event id="37">
        <start>09:00</start>
        <duration>01:30</duration>
        <room>Workshop 1 (Geb. SI, SI0201)</room>
        <slug></slug>
        <title>Praktische Einf&#252;hrung in OpenLayers </title>
        <subtitle></subtitle>
        <track>Workshops</track>
        <type>workshop</type>
        <language>de</language>
        <abstract>Programm

    * Einf&#252;hrung, Theorie, Historie
    * Grundlagen der API
    * Praktische &#220;bungen 

Die Teilnehmer erhalten die M&#246;glichkeit an einigen einfachen Beispielen mit OpenLayers zu arbeiten. Dabei werden u.a. - ein einfacher Weclient erstellt - MapControls hinzugef&#252;gt - ein tile-basierter Dienst von GoogleMaps, MS Virtual Earth oder YahooMaps zugef&#252;gt - dieser mit einem WebMapservice &#252;berlagert sowie eigene Daten als Textlayer zugef&#252;gt. Einfache Controls zur Kartennavigation werden im Workshop besprochen und in die Anwendung integriert.

Der Workshop legt seinen Fokus auf den praktischen Umgang und das direkte Arbeiten mit der JavaScript-Bibliothek OpenLayers. Ziel ist es, eine komplett nutzbare Anwendung zu erstellen, auf dessen Basis ein Weiterarbeiten m&#246;glich ist. </abstract>
        <description></description>
        <persons>
          <person id="71">Ingo Weinzierl</person>
          <person id="34">Marc Jansen</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="69">
        <start>11:00</start>
        <duration>01:30</duration>
        <room>Workshop 1 (Geb. SI, SI0201)</room>
        <slug></slug>
        <title>Vorstellung von Mapbender</title>
        <subtitle></subtitle>
        <track>Workshops</track>
        <type>workshop</type>
        <language></language>
        <abstract>Die WebGIS lient Software Mapbender hilft Ihnen, Ihre Karten- und Datendienste im Web zu ver&#246;ffentlichen. Dieser Workshop soll Ihnen einen Einblick in Mapbender geben und stellt die Basisfunktionalit&#228;ten vor. Anhand von Best-Practice Beispielen wird demonstriert, in welchen Bereichen Mapbender zum Einsatz kommen kann.

Die Mapbender Geoportal Software beinhaltet Oberfl&#228;chen f&#252;r die Anzeige, Navigation und Abfrage von OGC standardisierten Diensten, Daten und Formaten (z.B. WMS, WFS-T, GML). Zus&#228;tzlich stehen in der Administration Module und Oberfl&#228;chen f&#252;r die Verwaltung der standardisierten Dienste, Benutzer, Benutzergruppen und Berechtigungen zur Verf&#252;gung. Mapbender ist ein Projekt der Open Source Geospatial Foundation.


Administrationsdatenbank

Die Mapbender-Administrationsdatenbank erm&#246;glicht eine exakte benutzer- und projektspezifische Zuordnung von Kartenwerken und Funktionen. Die Protokollierung aller Aktionen, Abfragen und der Navigation gibt Aufschluss &#252;ber das Nutzerverhalten, kann zur Dokumentation von Zugriffen und f&#252;r Abrechnungsmodule genutzt werden.


Interoperabilit&#228;t und Kompatibilit&#228;t

Die Software ist kompatibel mit Kartendiensten und Datendiensten, die entsprechende OGC-Schnittstellenspezifikationen implementieren und kann deshalb als Rahmen f&#252;r eine breite Palette von GIS- und GDI-Softwareprodukten unterschiedlicher Hersteller genutzt werden. Die Palette der unterst&#252;tzten Software kann bei Bedarf erweitert werden und erm&#246;glicht es, auch herstellerspezifische Besonderheiten zu ber&#252;cksichtigen. Mapbender l&#228;&#223;t sich leicht in bestehende Architekturen und in Web Sites integrieren. 

Der Workshop gibt eine Einf&#252;hrung in die aktuell verf&#252;gbaren Funktionen der Software Mapbender.

    * Infrastruktur
    * Installation
    * Erstellen einer neuen Applikation
    * Hinzuladen von Kartendiensten
    * Konfigurieren von Karten
    * Oberfl&#228;che konfigurieren und erweitern Mapbender Module
    * Neue Kartendienste hinzuladen
    * Anlegen eines neuen Benutzers und einer Gruppe
    * Applikation Benutzern oder Gruppen zuweisen
    * Einbinden einer Mapbender Applikation in eine Webanwendung </abstract>
        <description>Die WebGIS lient Software Mapbender hilft Ihnen, Ihre Karten- und Datendienste im Web zu ver&#246;ffentlichen. Dieser Workshop soll Ihnen einen Einblick in Mapbender geben und stellt die Basisfunktionalit&#228;ten vor. Anhand von Best-Practice Beispielen wird demonstriert, in welchen Bereichen Mapbender zum Einsatz kommen kann.

Die Mapbender Geoportal Software beinhaltet Oberfl&#228;chen f&#252;r die Anzeige, Navigation und Abfrage von OGC standardisierten Diensten, Daten und Formaten (z.B. WMS, WFS-T, GML). Zus&#228;tzlich stehen in der Administration Module und Oberfl&#228;chen f&#252;r die Verwaltung der standardisierten Dienste, Benutzer, Benutzergruppen und Berechtigungen zur Verf&#252;gung. Mapbender ist ein Projekt der Open Source Geospatial Foundation.

Administrationsdatenbank

Die Mapbender-Administrationsdatenbank erm&#246;glicht eine exakte benutzer- und projektspezifische Zuordnung von Kartenwerken und Funktionen. Die Protokollierung aller Aktionen, Abfragen und der Navigation gibt Aufschluss &#252;ber das Nutzerverhalten, kann zur Dokumentation von Zugriffen und f&#252;r Abrechnungsmodule genutzt werden.


Interoperabilit&#228;t und Kompatibilit&#228;t

Die Software ist kompatibel mit Kartendiensten und Datendiensten, die entsprechende OGC-Schnittstellenspezifikationen implementieren und kann deshalb als Rahmen f&#252;r eine breite Palette von GIS- und GDI-Softwareprodukten unterschiedlicher Hersteller genutzt werden. Die Palette der unterst&#252;tzten Software kann bei Bedarf erweitert werden und erm&#246;glicht es, auch herstellerspezifische Besonderheiten zu ber&#252;cksichtigen. Mapbender l&#228;&#223;t sich leicht in bestehende Architekturen und in Web Sites integrieren.


Einsatzgebiete

Mapbender bietet sich als web-basierte Anwendungsschicht f&#252;r eine Vielzahl von Aufgabenbereiche an, dazu z&#228;hlen unter anderem:

    * Web-GIS Client (OGC WMS, WFS, Catalog Service Client)
    * Geo-CMS (Content Management System)
    * Web-basierte Digitaliseroberfl&#228;che (OGC WSF-T Client)
    * Metainformationssystem (ISO 19-einhundert Serie)
    * Katalogsystem (ISO 19119 Service Metadaten)
    * Securitymanagement (Authentifikation, Autorisation)
    * Abrechnungssystem (Zugriffsprotokolierung) 

In dem Workshop werden einige Best-Practice Beispiele dieser Einsatzbereiche vorgestellt.


Inhalte des Workshops

Der Workshop gibt eine Einf&#252;hrung in die aktuell verf&#252;gbaren Funktionen der Software Mapbender.

    * Infrastruktur
    * Installation
    * Erstellen einer neuen Applikation
    * Hinzuladen von Kartendiensten
    * Konfigurieren von Karten
    * Oberfl&#228;che konfigurieren und erweitern Mapbender Module
    * Neue Kartendienste hinzuladen
    * Anlegen eines neuen Benutzers und einer Gruppe
    * Applikation Benutzern oder Gruppen zuweisen
    * Einbinden einer Mapbender Applikation in eine Webanwendung </description>
        <persons>
          <person id="65">Astrid Emde</person>
          <person id="115">Christoph Baudson</person>
        </persons>
        <links>
          <link href="http://www.mapbender.org/">Mapender Wiki</link>
          <link href="http://www.mapbender.org/Tutorials">Mapender Tutorial im Wiki</link>
          <link href="http://www.fossgis.de/konferenz/wiki/Vorstellung_Mapbender">Links zum Workshop</link>
          <link href="http://trac.osgeo.org/mapbender/browser/trunk/documents/presentations/FOSSGIS2010/mapbender_workshop_on_fossgis2010_de.pdf?format=raw">Workshop Pr&#228;sentation (pdf)</link>
        </links>
      </event>
      <event id="68">
        <start>13:30</start>
        <duration>01:30</duration>
        <room>Workshop 1 (Geb. SI, SI0201)</room>
        <slug></slug>
        <title>Einf&#252;hrung in MapServer</title>
        <subtitle></subtitle>
        <track>Workshops</track>
        <type>workshop</type>
        <language></language>
        <abstract>Wir m&#246;chten damit denjenigen, die die Konferenz zum Kennenleren des MapServers nutzen wollen, die M&#246;glichkeit geben, sich pers&#246;nlich mit der Funktionweise vertraut zu machen ohne einen Teil des Vortragsprogramms zu verpassen.
Der Workshop soll einen Einblick in die Funktionalit&#228;t des UMN MapServers geben. Folgende Fragen sollen gekl&#228;rt werden:

    * Welche Rolle spielt ein Kartenserver in meiner WebGIS Anwendung?
    * Wie kann ich meine Daten mit dem UMN MapServer visualisieren?
    * Welche Formate unterst&#252;tzt der UMN MapServer?
    * Welche Klassifikations- und Stylem&#246;glichkeiten bietet der UMN MapServer?
    * Wie kann ich OGC konforme Dienste (WMS und WFS) mit dem UMN MapServer aufsetzen und was bedeutet das eigentlich? </abstract>
        <description>Workshopleiter: Toni Pignataro

Das Programm des Workshops sieht folgende Gliederung vor:

   1. Einf&#252;hrung
         1. Geschichte
         2. Funktionalit&#228;t
         3. DesktopGIS vs. WebGIS 
   2. Aufbau der Mapdatei
         1. Header
         2. Web
         3. Layer
         4. Class 
   3. Welche Datenformate werden unterst&#252;tz
         1. Raster
         2. Vektor
         3. Datenbank 
   4. OGC WMS
   5. OGC WFS </description>
        <persons>
          <person id="123">J&#246;rg Thomsen</person>
          <person id="119">Toni Pignataro</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="38">
        <start>15:30</start>
        <duration>01:30</duration>
        <room>Workshop 1 (Geb. SI, SI0201)</room>
        <slug></slug>
        <title> Erweiterte WMS-Funktionen mit OpenLayers - Ein Einblick</title>
        <subtitle></subtitle>
        <track>Workshops</track>
        <type>workshop</type>
        <language></language>
        <abstract>Workshopleiter: Stephan Holl (Intevation) &amp; Marc Jansen (terrestris)

Programm

    * Einf&#252;hrung
    * Aufbau der API
    * Praktische &#220;bungen 


Vorraussetzung

    * Grundkenntnisse von OpenLayers (oder gute JavaScript Kenntnisse)
    * JavaScript Grundkenntnisse 

Im Workshop werden der JavaScript-Bibliothek von OpenLayers eigene Funktionen hinzugef&#252;gt. Dabei wird zun&#228;chst die Architektur der Bibliothek erl&#228;utert. Als Erweiterungen werden OpenLayers Control zu OGC-konformen Abfragen und Legendendarstellungen zugef&#252;gt.

Das Ziel ist es, eine komplett nutzbare Anwendung zu erstellen, auf dessen Basis ein Weiterarbeiten m&#246;glich ist und Wissen zur eigenen Erweiterung von OpenLayers zu vermitteln. </abstract>
        <description></description>
        <persons>
          <person id="34">Marc Jansen</person>
          <person id="46">Stephan Holl</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="155">
        <start>17:15</start>
        <duration>01:45</duration>
        <room>Workshop 1 (Geb. SI, SI0201)</room>
        <slug></slug>
        <title>QGIS Anwender- und Entwicklertreffen</title>
        <subtitle></subtitle>
        <track>Anwendertreffen</track>
        <type>user_meeting</type>
        <language>de</language>
        <abstract>Treffen f&#252;r QGIS-Anwender und Entwickler.</abstract>
        <description></description>
        <persons>
          <person id="9">Otto Dassau</person>
        </persons>
        <links>
        </links>
      </event>
    </room>
    <room name="Workshop 2 (Geb. SI, SI0202)">
      <event id="82">
        <start>09:00</start>
        <duration>01:30</duration>
        <room>Workshop 2 (Geb. SI, SI0202)</room>
        <slug></slug>
        <title>gvSIG: Neuerungen der Version 1.9</title>
        <subtitle></subtitle>
        <track>Workshops</track>
        <type>workshop</type>
        <language></language>
        <abstract>gvSIG 1.9 in der stabilen Version ist ein leistungsstarkes DesktopGIS (GNU/GPL). In der aktuellen Version wurden zahlreiche neue GIS- Funktionen integriert.
Beschriftung und Symbologie wurden erheblich verbessert. Es sind nun erweiterte Beschriftungsdefinitionen, sowie individuelles Symboldesign mit Hilfe eines integrierten Editors m&#246;glich. Neue Editierfunktionen erm&#246;glichen das Teilen, Vereinen und Autocomplete von Geometrien. Die Erweiterung &#8222;Raster Pilot&#8220; wurde fester Bestandteil der Software und bietet zahlreiche Funktionen zur Rasteranalyse, wie z.B. Definition von Filtern, automatische Vektorisierung, Georeferenzierung, Generierung von ROI, Farbtabelle.
Neue Selektions- sowie Informations-M&#246;glichkeiten erweitern den Funktionsumfang von gvSIG. So l&#228;sst sich z.B. eine Quick- Info f&#252;r Geometrien erzeugen, mit der sich Attributwerte einfach und komfortabel abrufen lassen. Ein integriertes Drucktemplate erm&#246;glicht die schnelle Ausgabe von Geodaten in einem Druckformat.
Die Software wurde weiter internationalisiert und die Benutzeroberfl&#228;che ist nun auch in den Sprachen Englisch (USA), Portugiesisch (Brasilien), T&#252;rkisch, Russisch, Griechisch, Swahili und Serbisch verf&#252;gbar. Eine neue Erweiterung zur &#220;bersetzung erm&#246;glicht die einfache Aktualisierung  von Sprachpaketen in gvSIG 1.9.
Die Benutzeroberfl&#228;che wurde grafisch neu aufbereitet (neue Buttons) und die Handhabung und der Aufruf von Funktionen vereinfacht. Die GUI- Personalisierung ist u.a. durch das Ein- und Ausblenden von Schaltfl&#228;chen m&#246;glich. 
Der Workshop gibt einen &#220;berblick &#252;ber diese neuen Softwarekomponenten, an einem praktischen Beispiel werden die Neuerungen der Software pr&#228;sentiert. 
</abstract>
        <description></description>
        <persons>
          <person id="122">Jos&#233; Canalejo</person>
          <person id="68">Ruth Sch&#246;nbuchner</person>
        </persons>
        <links>
          <link href="http://www.gvsig.gva.es/eng/gvsig-desktop/">Download gvSIG 1.9 stabil</link>
          <link href="http://csgis.de/joomla/index.php?option=com_content&amp;view=article&amp;id=83:gvsig-19-stabil&amp;catid=39:neueste-nachrichten">&#220;berblick &#252;ber die Neuerungen der Version 1.9</link>
        </links>
      </event>
      <event id="11">
        <start>11:00</start>
        <duration>01:30</duration>
        <room>Workshop 2 (Geb. SI, SI0202)</room>
        <slug></slug>
        <title>Einf&#252;hrung in QGIS 1.4.0</title>
        <subtitle></subtitle>
        <track>Workshops</track>
        <type>workshop</type>
        <language></language>
        <abstract>Der Workshop richtet sich an alle Quantum GIS-Interessierten. Da QGIS in der Version 1.4 zahlreiche Plugins mit eigenen Analysefunktionen (z.B. geoprocessing, raster algebra, f-tools, interpolation) bietet, m&#246;chten wir diesen Aspekt anhand eines praktischen Workflows ins Zentrum des Workshops r&#252;cken und zeigen, dass QGIS auch ohne GRASS GIS interessante Analysen bietet.Ausserdem werden die neuen M&#246;glichkeiten der Datenbearbeitung und der Kartenproduktion von QGIS eingef&#252;hrt. </abstract>
        <description></description>
        <persons>
          <person id="13">Horst D&#252;ster</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="23">
        <start>13:30</start>
        <duration>01:30</duration>
        <room>Workshop 2 (Geb. SI, SI0202)</room>
        <slug></slug>
        <title>Praktische Einf&#252;hrung in MapFish</title>
        <subtitle>ein Web 2.0 Mapping Application Framework</subtitle>
        <track>Workshops</track>
        <type>workshop</type>
        <language>de</language>
        <abstract>Vorstellung der MapFish Client- und Serverkomponenten mit &#220;bungen</abstract>
        <description>Wird noch &#252;bersetzt !!!

***
MapFish is an open-source development framework for building web-mapping applications. MapFish is based on the GeoExt library which is a combination of ExtJS and OpenLayers, and extends the Pylons general-purpose web development framework with geo-specific functionalities. This workshop will introduce the usage of the MapFish development framework and will demonstrate how it can help developers implement rich web-mapping applications. On the client side, several MapFish widgets and components will be presented: The map panel for the representation of geographical information through OGC web services like WMS, WFS or TMS. The toolbar for the access to the functions within the GUI The layer tree for the organization and management of the geospatial layers The 3D widget for the 3D representation of geographical data using Google Earth The print widget for the creation of reports. The geostat widget for the creation of advanced representations of the data through chloropleth or proportional symbols The edit functions for the creation and update of data sets. The search and recenter widget for advanced navigation within the data. The query widget for getting information about the represented data
***</description>
        <persons>
          <person id="124">C&#233;dric Moullet</person>
          <person id="23">Till Adams</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="21">
        <start>15:30</start>
        <duration>01:30</duration>
        <room>Workshop 2 (Geb. SI, SI0202)</room>
        <slug></slug>
        <title>Einf&#252;hrung in deegree iGeoDesktop</title>
        <subtitle></subtitle>
        <track>Workshops</track>
        <type>workshop</type>
        <language>de</language>
        <abstract>Ziel des Workshops ist es, die Teilnehmer in die Lage zu versetzen, die vorhandenen Funktionen von iGeoDesktop zu nutzen und die weitreichenden Konfigurationsm&#246;glichkeiten so einzusetzen, dass sie Konfigurationen entsprechend ihren individuellen und projektbezogenen Anforderungen erstellen k&#246;nnen. Im Rahmen des Workshops werden die Teilnehmern daher in die Lage versetzt, die Konstruktionsprinzipien, auf denen iGeoDesktop beruht, nachzuvollziehen und iGeoDesktop selbst&#228;ndig den eigenen Anforderungen entsprechend anzupassen. 
In einem zweiten Teil werden die unterschiedlichen M&#246;glichkeiten zum Import- und Export von Daten sowie deren Kopplung an externe Ressourcen demonstriert und von den Teilnehmern nachvollzogen. Ferner wird anhand mehrerer Beispiele der Umgang mit den vorhandenen Funktionen zur Datenerfassung, Datenbearbeitung und zur Datenprozessierung erl&#228;utert. </abstract>
        <description></description>
        <persons>
          <person id="18">Andreas Poth</person>
        </persons>
        <links>
          <link href="http://www.deegree.org/deegree/portal/media-type/html/page/default.psml/js_pane/download">Download-Seite f&#252;r deegree</link>
        </links>
      </event>
    </room>
    <room name="Seminarraum 1 (Geb. 66/E01)">
    </room>
  </day>
  <day date="2010-03-04" index="3">
    <room name="Gro&#223;er H&#246;rsaal (Geb. 66, E33/34)">
      <event id="60">
        <start>09:00</start>
        <duration>00:30</duration>
        <room>Gro&#223;er H&#246;rsaal (Geb. 66, E33/34)</room>
        <slug></slug>
        <title>GeoWebServer - Geodateninfrastruktur-Komponenten einfach installieren und betreiben</title>
        <subtitle>Die freie Geodateninfrastruktur - einfach und sicher</subtitle>
        <track>Vortr&#228;ge</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Der Vortrag stellt den vom Bundesamt f&#252;r Kartographie und Geod&#228;sie (BKG)
initiierten GeoWebServer vor. Dieser wurde im Rahmen einer BMI-F&#246;rderung
zum E-Government Programm Einer-f&#252;r-Alle (EfA) von Intevation GmbH und
lat/lon GmbH vollst&#228;ndig auf OpenSource-Komponenten basierend entwickelt.

Der GeoWebServer beinhaltet alle ben&#246;tigten Komponenten, um eine
Geodateninfraktur aufzubauen.
Dazu z&#228;hlen die OGC-Geodienste
* CSW,
* WCS,
* WFS,
* WMS
und eine Administrationsanwendung, Metadateneditor sowie Kartenviewer.

Alle genannten Komponenten sind mit einem graphischen
Installationsprogramm sowohl f&#252;r GNU/Linux als auch f&#252;r Microsoft Windows
von einem Installationsmedium zu installieren.
Aufgrund der Verwendung von Freier Software k&#246;nnen die GDI-Knoten beliebig
oft installiert werden.

W&#228;hrend des Vortrags soll die einfache Installation sowie die
Inbetriebnahme eines GDI-Knoten gezeigt werden und die M&#246;glichkeiten der
Nutzung pr&#228;sentiert werden.

Programm:
* Hintergr&#252;nde
* Integrierte Software
* Installer
* Live-Installation auf einer Windows-VM
 * Starten einer Anwendung als Beispiel
* Fragen
</abstract>
        <description></description>
        <persons>
          <person id="60">Dr. Christian Kiehle</person>
          <person id="46">Stephan Holl</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="53">
        <start>09:30</start>
        <duration>00:30</duration>
        <room>Gro&#223;er H&#246;rsaal (Geb. 66, E33/34)</room>
        <slug></slug>
        <title>INSPIRE Geoportale mit OpenSource Software</title>
        <subtitle></subtitle>
        <track>Vortr&#228;ge</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Der Aufbau von Geoportalen kann - abh&#228;ngig von den funktionalen Anforderungen als Teil einer umfassenden Geodateninfrastruktur - sehr komplex sein. 
&#8233;Wie ein Workaround der Integration verschiedener mit OpenSourceSoftwarekomponenten aussehen kann, soll diese Vortrag verdeutlichen. Als Grundlage dient das Content Management System Drupal.

Durch Module wird Drupal, um zus&#228;tzliche Funktionen erweitert:
- Zugriff auf den Metadatenkatalog GeoNetwork opensource, sowohl zur Abfrage, als auch als Metadateneditor
- Einbindung von OpenLayers/MapFISH als Kartenclient
- Dienstemonitoring
- Up-/Download von Geodaten in eine PostGIS-Datenbank und Visualisierung &#252;ber WMS-Dienste
- Diensteabsicherung</abstract>
        <description>Abstract als Anhang.</description>
        <persons>
          <person id="38">David Arndt</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="97">
        <start>10:00</start>
        <duration>00:30</duration>
        <room>Gro&#223;er H&#246;rsaal (Geb. 66, E33/34)</room>
        <slug></slug>
        <title>Neue Wege f&#252;r Metadaten</title>
        <subtitle>Vorstellung der OSGeo Metadaten-Dienste</subtitle>
        <track>Vortr&#228;ge</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Der Vortrag stellt zun&#228;chst die Grundlagen der Metadatenverarbeitung vor. Es werden Syntax und Sematik von Metadaten in der r&#228;umlichen Datenverarbeitung erl&#228;utert und eine kurze &#220;bersicht zur Bedeutung von Ontologien gegeben. Aktuelle Richtlinien in der Geodatenverarbeitung (z.B. INSPIRE) schreiben vor, Metadaten in Katalogen zusammenzufassen, zu kategorisieren und als Dienste &#252;ber das Internet bereitzustellen. In der Theorie k&#246;nnen Anwender &#252;ber entsprechende Suchoberfl&#228;chen alle Dienste und Daten finden, um sie f&#252;r eigene Zwecke zu nutzen. In der Praxis zeigt sich jedoch h&#228;ufig, dass Kataloge zu statisch und wenig flexibel sind, um den Anforderungen der Anwender zu gen&#252;gen. In einem neuen Projekt der OSGeo k&#246;nnen sich Anbieter, Nutzer und Interessierte zusammenfinden, um diese Kluft zu &#252;berbr&#252;cken.</abstract>
        <description>Metadaten beschreiben Daten. In der r&#228;umlichen Datenverarbeitung ist die Verf&#252;gbarkeit von Metadaten eine wichtige grunds&#228;tzliche Voraussetzung f&#252;r die sinnvolle Anwendung und Nutzung von Geodaten, Diensten und Anwendungen. Deshalb weren derzeit mit viel Aufwand und durch gesetzliche Richtlinien wie INSPIRE teilweise verpflichtend, umfangreiche Metadatenbest&#228;nde aufgebaut. In der Praxis zeigt sich jedoch zunehmend, dass eine Kluft zwischen den Anbietern von Daten (Metadatenbereitsteller) und deren Anwendern (Nutzern der Metadaten) besteht. Ein Problem liegt in den unterschiedlichen Herangehensweisen und Motivation von Datennutzern und Anwendern, ein anderes in mangelndem Verst&#228;ndnis der ben&#246;tigten Technologien. 

Metadaten k&#246;nnen in Syntax und Semantik aufgeteilt werden. Beide Informationen sind wichtige Voraussetzungen f&#252;r die Nutzung von Geodaten und Diensten im Netz. Syntaktische Informationen beschreiben den Typ der Daten, die Art der Datenhaltung, Zugriffsm&#246;glichkeiten und inneren Aufbau. Syntaktische Informationen z.B. f&#252;r Dienste, k&#246;nnen gut in technischen Formaten abgelegt werden wie sie durch den ISO Standard 19115 beschrieben werden. Semantische Informationen sind ungleich komplexer, und weniger einfach strukturierbar. Sie beschreiben Daten auf inhaltlicher Ebene und beziehen dabei sich auf die Ontologien (Sinnzusammenh&#228;nge) der entsprechenden Anbieter und Nutzer. Genau hier besteht ein grunds&#228;tzliches Problem, weil Anbieter und Nutzer oft eine andere Sprache spechen. Der Sinnzusammenhang ist jedoch das wichtigste Kriterium, wenn es um die Auffindbarkeit von Geodaten und Diensten geht. Die mangelnde Abbildung von Sinnzusammenh&#228;ngen (Ontologiebezug) in den technischen Metadatenbeschreibungen f&#252;hrt dazu, dass Katalogsuchen oft nicht zu den gew&#252;nschten Ergebnissen f&#252;hren. Geodaten bleiben trotz umfangreichen Metadatenbest&#228;nden unauffindbar. 

Der Vortrag stellt die Grundlagen der Metadatenverarbeitung vor, skizziert die Anforderungen von Nutzern und stellt die M&#246;glichkeiten vor, wie eine Community &#252;ber die OSGeo Projekte entwickeln k&#246;nnte, die sowohl die Bereitstellung von Metadaten, als auch deren Nutzbarkeit verbessern. 
</description>
        <persons>
          <person id="51">Arnulf Christl</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="135">
        <start>11:00</start>
        <duration>00:30</duration>
        <room>Gro&#223;er H&#246;rsaal (Geb. 66, E33/34)</room>
        <slug></slug>
        <title>Flex-I-Geo-Web - ein interaktiver Software-Baukasten f&#252;r Geodaten am Beispiel der Standortanalyse &#8211; oder des Baul&#252;ckenmanagements</title>
        <subtitle></subtitle>
        <track>Vortr&#228;ge</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Flex-I-GeoWeb ist ein gemeinschaftliches Open Source Entwicklungsprojekt von 8 Mitgliedern der Geo-Initiative der Region Bonn. Projektpartner sind das Fraunhofer Institut IAIS, das Geographische Institut der Universit&#228;t Bonn, die Industrie- und Handelskammer, die Wirtschaftsf&#246;rderung der Stadt Bonn und 4 innovative GIS-Unternehmen aus der Region (lat/lon, Interactive Instruments, WhereGroup, CPA). Das Projekt wird im Rahmen des Technologie- und Innovationsprogramm NRW aus dem Europ&#228;ischen Fonds f&#252;r Regionale Entwicklung (EFRE) gef&#246;rdert und dient der St&#228;rkung des Geoinformatik-Standorts Bonn.

Das Projekt hat zum Ziel, einen Software-Baukasten aus webbasierten Bausteinen zu entwickeln, mit denen der Nutzer weitgehend intuitiv aus vorhandenen, neuen und eigenen Geodaten und -diensten dynamisch konfigurierbare Geodatenportale zusammenf&#252;gen kann. Diese Geodatenportale sollen zudem unterschiedliche Methoden zur Auswertung und Analyse der Geodaten bereitstellen.

Bei der Umsetzung des Projektes wurde vereinbart, auf bestehende Standards des Open Geospatial Consortium (OGC) zu setzen und die Entwicklung dieser weiter voranzutreiben.

Das Baukastenprinzip von Flex-I-Geo-Web soll mehrere Kernelemente beinhalten:
&#8226; eine einfach konfigurierbare Benutzeroberfl&#228;che &#252;ber einen Web-Browser, die auch ohne spezielle GIS Kenntnisse intuitiv zu bedienen sein wird
&#8226; die Auswahl und Integration von Datendiensten (WMS, WFS, WCS) oder Prozessierungsdiensten (WPS) &#252;ber einen Katalogdienst
&#8226; die Weiterentwicklung und Integration von Web Processing Services (WPS) zur Bereitstellung von GIS- und Analysefunktionalit&#228;ten
&#8226; vorkonfigurierte anwendungsspezifische Workflows aus zusammengesetzten Diensten
&#8226; ein standardkonformes Rechtemanagement f&#252;r den Zugriff auf Dienste und Daten

W&#228;hrend der Projektlaufzeit sollen zudem Konzepte f&#252;r eine Aktualisierung der verwendeten Daten erarbeitet werden. Die Visualisierung der Ergebnisse soll sowohl in 2D als auch in 3D erfolgen und zwar mittels eingebundener Karten- und Visualisierungsdienste, wie z.B. dem OGC Web3DService (W3DS). Die entwickelten Bausteine sollen nach Projektende der Allgemeinheit als OGC-implementierende open-source Bibliotheken verf&#252;gbar gemacht werden, so dass eine nachhaltige Wiederverwendbarkeit gew&#228;hrleistet werden kann. Als Demonstrator f&#252;r das Projekt soll ein Portal dienen, welches Standortanalysen zur Suche und individuellen Bewertung von Baul&#252;cken, Brachfl&#228;chen und Leerst&#228;nden in entwickelten
R&#228;umen erm&#246;glicht. Mit diesem Demonstrator entsteht zugleich ein neues Instrument f&#252;r Architekten und Bauherren, um eine fl&#228;chenschonende Stadtentwicklung zu gestalten und &#246;konomische und &#246;kologische Aspekte ausgewogen abzuw&#228;gen. Zus&#228;tzlich werden w&#228;hrend der Projektlaufzeit Gesch&#228;ftsmodelle f&#252;r eine kommerzielle Nutzung des Baukastens sowie des Demonstrators entwickelt.
</abstract>
        <description></description>
        <persons>
          <person id="107">Robert Kulawik</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="41">
        <start>11:30</start>
        <duration>00:30</duration>
        <room>Gro&#223;er H&#246;rsaal (Geb. 66, E33/34)</room>
        <slug></slug>
        <title>&#8222;WEGE&#8220; goes gvSIG:gvSIG als Client f&#252;r die Pflege der Stra&#223;eninformationender Autonomen Provinz Bozen &#8211; S&#252;dtirol</title>
        <subtitle>Referent: Susanne Rizzolli</subtitle>
        <track>Vortr&#228;ge</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Die Autonome Provinz Bozen S&#252;dtirol besch&#228;ftigt sich  seit 2002 mit dem Management und der Publikation von Geodaten zum Thema Verkehr und Stra&#223;en. Hierf&#252;r wurde im Rahmen des Projektes &#8222;WEGE&#8220; ein Verkehrsinformationssystem entwickelt. F&#252;r das Projekt WEGE soll in Zukunft  gvSIG  als Desktop Client f&#252;r die Pflege der Geodaten eingesetzt werden.</abstract>
        <description>Im Vortrag wird das Modul &#8222;WG_Edit vorgestellt und dessen Portierung auf gvSIG erl&#228;utert. Das Modul WG_Edit ist Teil des Verkehrsinformationssystems und verantwortlich f&#252;r  die Verwaltung der Stra&#223;eninformationen. In diesem Zusammenhang deckt es jene Funktionalit&#228;ten ab, welche die Bearbeitung (Editing) und den Import der Geodaten sowie die Pflege der Attributdaten erm&#246;glichen. Ebenso werden topologische Kontrollmechanismen zur Sicherstellung der Datenquali&#228;t implementiert. Eine Neuerung ist das Einf&#252;hren der z-Koordinate und dessen Pflege durch benutzerfreundliche Funktionalit&#228;ten.
Aus technischer Sicht baut das Modul auf einer Three-Tier-Architektur auf, wobei der Applikationsserver die Schnittstelle zwischen Datenbank und Client darstellt. Der Applikationsserver besteht aus Webservices, der Datenaustausch bzw. die Kommunikation erfolgt &#252;ber XML/GML. Als Client wurde gvSIG ausgew&#228;hlt, da es sich um ein vollst&#228;ndiges openSource GIS-Tool mit Kontinuit&#228;t handelt, w&#228;hrend bei der Datenbank vorerst die bestehende L&#246;sung (Oracle/ArcSde) beibehalten wird.
Mittelfristig soll gvSIG als StandardClient innerhalb der Autonomen Provinz Bozen &#8211; S&#252;dtirol eingesetzt werden. Die Bereitstellung von gvSIG als Desktopclient zur Pflege der Geodaten zum Thema Stra&#223;en und Verkehr ist ein erster Schritt in diese Richtung. Es ist dar&#252;ber hinaus geplant, gvSIG f&#252;r weitere Module des Verkehrsinformationssystems zu nutzen sowie in anderen Projekten (newGIS) einzuf&#252;hren.</description>
        <persons>
        </persons>
        <links>
        </links>
      </event>
      <event id="129">
        <start>12:00</start>
        <duration>00:30</duration>
        <room>Gro&#223;er H&#246;rsaal (Geb. 66, E33/34)</room>
        <slug></slug>
        <title>10 Jahre FOSSGIS</title>
        <subtitle>Ein R&#252;ckblick</subtitle>
        <track>Vortr&#228;ge</track>
        <type>lecture</type>
        <language></language>
        <abstract>Ein R&#252;ckblick auf 10 Jahre FOSSGIS-Verein.</abstract>
        <description></description>
        <persons>
          <person id="114">Georg L&#246;sel</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="144">
        <start>13:30</start>
        <duration>01:00</duration>
        <room>Gro&#223;er H&#246;rsaal (Geb. 66, E33/34)</room>
        <slug></slug>
        <title>OSM Keynote</title>
        <subtitle></subtitle>
        <track>OSM-Vortr&#228;ge</track>
        <type>lecture</type>
        <language></language>
        <abstract>Keynote OSM Fossgis 2010</abstract>
        <description>Auf vielfachen Wunsch hier der Text der Keynote vom 04.03.2010 zur Er&#246;ffnung des OSM-Teiles anl&#228;sslich der Fossgis-Konferenz 2010 in Osnabr&#252;ck.

</description>
        <persons>
          <person id="117">Michael Buege</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="55">
        <start>14:30</start>
        <duration>00:30</duration>
        <room>Gro&#223;er H&#246;rsaal (Geb. 66, E33/34)</room>
        <slug></slug>
        <title>Zusammenarbeit zwischen OpenStreetMap und der Hansestadt Rostock</title>
        <subtitle></subtitle>
        <track>OSM-Vortr&#228;ge</track>
        <type>lecture</type>
        <language></language>
        <abstract>Die Zusammenarbeit zwischen dem OpenStreetMap (OSM) Projekt und St&#228;dten ist sehr unterschiedlich ausgepr&#228;gt. Von Ablehnung bis konstruktiver Zusammenarbeit ist alles vertreten. Die Hansestadt Rostock, in Form des Kataster-, Vermessungs- und Liegenschaftsamtes (KVLA), steht freien Daten, Projekten und dem Web 2.0 offen gegen&#252;ber. Dies ist eine wichtige Voraussetzung f&#252;r eine Zusammenarbeit mit OpenStreetMap.
Die Stadt Rostock hat OSM anfangs ihre Stra&#223;enliste zur Verf&#252;gung gestellt. Es folgte Feedback durch die Community in Form von Meldungen &#252;ber fehlende oder falsch angebrachte Stra&#223;enschilder. Daraufhin hat die Stadt das Kopieren des amtlichen Stadtplans gestattet.
Ausgenommen vom Kopieren waren die exakten Geb&#228;udeumrisse, denn diese sind Teil eines Gesch&#228;ftsmodells. Von Seiten der Stadt gab es nun den Vorschlag mit Unsch&#228;rfe versehene Umrisse freizugeben. Diese Unsch&#228;rfe sichert der Stadt einerseits ihr Gesch&#228;ftsmodell und ist andererseits noch ausreichend klein f&#252;r die Verwendung in OpenStreetMap. Auch hier gab es wieder Feedback von der Community &#252;ber fehlende oder nicht mehr existierende Geb&#228;ude. 
Als weiteres Projekt wurden &#228;ltere Daten von Geb&#228;udeh&#246;hen ver&#246;ffentlicht. Auch hier behielt die Stadt die neueren und genaueren Daten f&#252;r sich, konnte jedoch ihren Beitrag zu freiem Wissen leisten. Als Resultat kann z.B. in OSM-3D ein Stadt&#252;berflug mit realen Geb&#228;udeh&#246;hen durchgef&#252;hrt werden.
Neben den oben erw&#228;hnten Ver&#246;ffentlichungen gab es noch weitere kleine Datenspenden. Das alles zeigt, dass St&#228;dte bzw. &#246;ffentliche Einrichtungen allgemein nicht nur in der Geberposition agieren, sondern auch davon profitieren.</abstract>
        <description></description>
        <persons>
          <person id="43">Martin Garbe</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="73">
        <start>15:30</start>
        <duration>00:30</duration>
        <room>Gro&#223;er H&#246;rsaal (Geb. 66, E33/34)</room>
        <slug></slug>
        <title>PRTR - Umweltbundesamt 2.0</title>
        <subtitle>Wie OpenStreetMap zum eGovernment kam</subtitle>
        <track>OSM-Vortr&#228;ge</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Im Sommer 2009 wurde in Berlin das neue Online Portal PRTR des Umweltbundesamtes er&#246;ffnet. Das allein w&#228;re an sich noch nicht besonders berichtenswert, stellen Beh&#246;rden doch regelm&#228;&#223;ig Informationsdienste ins Netz. Warum berichten aber ausgerechnet der Stern, die S&#252;ddeutsche, die taz und andere just &#252;ber diese neue Anwendung? Was das UBA dort der &#214;ffentlichkeit pr&#228;sentierte, ist bemerkenswert. Die zum Einsatz kommende Technik und insbesondere die Datengrundlage hebt sich von den meisten anderen beh&#246;rdlichen Angeboten deutlich ab.

Zum ersten Mal hat eine Bundesbeh&#246;rde mit dem PRTR-Portal ein Kartenwerk auf Basis der frei verf&#252;gbaren Daten des Projektes OpenStreetMap erstellt. Diese Geodatensammlung basiert auf dem Wikipedia-Prinzip und gilt daher in vielen Bereichen als tagesaktuell. Die Verwendung einer freien Datensammlung als Hintergrundkarte in einer offiziellen Anwendung des Bundes hat Pilotcharakter und ist auch ein klares Signal, dass mit diesen Daten seri&#246;s gearbeitet werden kann. Das PRTR soll die Beteiligungsrechte der B&#252;rgerinnen und B&#252;rger st&#228;rken und das Umweltbewu&#223;tsein vor Ort f&#246;rdern. Daher lebt das PRTR von und durch das Engagement der interessierten &#214;ffentlichkeit.

F&#252;r das neue Schadstofffreisetzungs- und -verbringungsregister PRTR Deutschland haben &#252;ber 4.000 Unternehmen erstmalig Daten zu ihren Schadstoffemissionen in Luft, Wasser und Boden sowie &#252;ber den Verbleib des Abfalls und des Abwassers berichtet.

Die Portalanwendung mit dem Karten dienst wurde von der Bonner WhereGroup in enger Zusammenarbeit mit der Bundesanstalt f&#252;r Landwirtschaft und Ern&#228;hrung (BLE) und der Risa Sicherheitsanalysen GmbH, Berlin konzipiert und erstellt. Das Portal basiert vollst&#228;ndig auf OpenSource-Software und wird in einem virtualisierten, skalierbaren Cluster betrieben. Dadurch ist das gesamte System beliebig skalierbar, um hohe Leistungs- und Verf&#252;gbarkeitsanspr&#252;che zu bedienen. In nachfrageschwachen Zeiten k&#246;nnen die Ressourcen anderweitig genutzt oder abgeschaltet werden, um eine m&#246;glichst emissionsarme Bereitstellung der Daten zu erzielen, wie es von einer Beh&#246;rde mit Umweltschwerpunkt erwartet werden kann. </abstract>
        <description></description>
        <persons>
          <person id="137">Holger B&#246;ken</person>
        </persons>
        <links>
          <link href="http://www.prtr.bund.de">http://www.prtr.bund.de</link>
        </links>
      </event>
      <event id="75">
        <start>16:00</start>
        <duration>00:30</duration>
        <room>Gro&#223;er H&#246;rsaal (Geb. 66, E33/34)</room>
        <slug></slug>
        <title>2 Jahre OpenRouteService.org</title>
        <subtitle>Mehr als ein Routenplaner auf Basis von OpenStreetmap </subtitle>
        <track>OSM-Vortr&#228;ge</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>In den letzten zwei Jahren ist mit OpenRouteService.org (ORS) ein Portal entstanden, in welchem auf der Basis von OpenStreetMap (OSM) Daten eine Vielzahl von verschiedenen standardisierten Web Services im Bereich Routenplanung und ortsbezogene Dienste f&#252;r ganz Europa zu Verf&#252;gung stehen. Neben einem Routenplaner mit Adresssuche stehen dem Nutzer auch eine POI-Suche, eine Erreichbarkeitsanalyse, TMC-Informationen, H&#246;henprofile und weitere Dienste zu Verf&#252;gung.

Im Vortrag werden diese Dienste vorgestellt. Dabei wird auf die Verwendung der OSM Daten in den Diensten und auf deren Entwicklung eingegangen. Inzwischen werden die Services hinter ORS aber nicht nur auf der Website, sondern auch in
anderen Projekten verwendet. Ferner konnte der Route Service prototypisch erweitert werden, so dass er auch mit Hilfe von OSM Daten f&#252;r das Rollstuhlrouting (www.rollstuhlrouting.de) verwendet werden kann. Neuere Arbeiten behandeln u.a.
die Erweiterung in 3D inklusive Indoor-Routing (OWS6).
</abstract>
        <description></description>
        <persons>
          <person id="66">Pascal Neis</person>
        </persons>
        <links>
          <link href="http://www.rollstuhlrouting.de/">Rollstuhlrouting</link>
          <link href="http://www.openrouteservice.org/">OpenRouteService</link>
        </links>
      </event>
      <event id="40">
        <start>16:30</start>
        <duration>00:30</duration>
        <room>Gro&#223;er H&#246;rsaal (Geb. 66, E33/34)</room>
        <slug></slug>
        <title>WebMapping-Radroutenplaner auf Basis von OSM-Geodaten und freier Software</title>
        <subtitle></subtitle>
        <track>OSM-Vortr&#228;ge</track>
        <type>student_project</type>
        <language>de</language>
        <abstract>WebMapping-Radroutenplaner auf Basis von OSM-Geodaten und freier Software

Andreas Mescheder/Bryan Hempen

Studentischer Beitrag in Form eines Vortrags zur FossGIS 2010

Der weltweite Markt ist mit unterschiedlichsten Routenplanern &#252;berh&#228;uft. Auch in Deutschland gibt es viele unterschiedliche Routenplaner, wie zum Beispiel Google Maps, ViaMichelin, und map24. F&#252;r den motorisierten Verkehr sind diese genannten Routenplaner nahezu vollkommen ausgereift, doch im Sinne der Nutzbarkeit f&#252;r Fahrradfahrer haben diese Routenplaner erhebliche L&#252;cken oder stehen noch in der Beta-Phase der Entwicklung. Gerade das fahrradtaugliche Kartenmaterial ist kaum vorhanden und so gut wie kein Fahrradfahrer m&#246;chte sich ausschlie&#223;lich auf Stra&#223;en f&#252;r den motorisierten Verkehr bewegen. Die von Fahrradfahrern und Wanderern gew&#252;nschten Routen liegen in der Regel bewusst abseits der f&#252;r den motorisierten Verkehr zul&#228;ssigen Strecken. 
Im Rahmen des Studienprojektes entwickeln die Studenten des Bachelorstudiengangs Geoinformatik der Universit&#228;t Osnabr&#252;ck einen Radroutenplaner unter ausschlie&#223;licher Verwendung von Open Source Software und auf Grundlage der freien Geodaten des Projektes OpenStreetMap. Um das Projekt zu realisieren werden unter anderem bew&#228;hrte Werkzeuge wie OpenLayers, UMN MapServer, PostgreSQL/PostGIS und pgRouting eingesetzt, deren Zusammenspiel eine bisher nie da gewesene Form der individuellen Radroutenplanung erm&#246;glicht. Der angebotene Service wird in erster Linie auf Benutzerfreundlichkeit ausgerichtet sein.
Um sicherzustellen, dass alle f&#252;r Radfahrer interessanten Wege, auch die sogenannten &#8222;Schleichwege&#8220;, aufgenommen sind, haben die Studenten das Stadtgebiet und den n&#228;heren Umkreis von Osnabr&#252;ck selbst mit GPS-Ger&#228;ten abgefahren. Dies diente der Gew&#228;hrleistung einer korrekten Routenberechnung und der Vervollst&#228;ndigung der Geodatengrundlage. Die Routenberechnung benutzt den von pgRouting zur Verf&#252;gung gestellten Djkstra-Algorithmus, welcher eine Ber&#252;cksichtigung der Orientierung von Stra&#223;en erm&#246;glicht. Die bisher in der Radroutenplanung kl&#228;glich vernachl&#228;ssigten Einbahnstra&#223;en, welche bei Weitem nicht alle in beide Richtungen von Radfahrern durchfahren werden d&#252;rfen, werden ebenfalls ber&#252;cksichtigt um den Radfahrer sicher zum Ziel zu bringen.
Weiterhin wurde ein besonderes Augenmerk nat&#252;rlich auf die f&#252;r Fahrradfahrer interessanten Merkmale wie bauliche Trennung des Radweges von der f&#252;r den motorisierten Verkehr vorgesehenen Spur und deren Vorhandensein in beiden Richtungen gesetzt. Dar&#252;ber hinaus steht die Oberfl&#228;chenbeschaffenheit der einzelnen Stra&#223;en und Wege im Vordergrund, die je nach Zustand einer Bewertung unterliegen und je nach Gewichtung als gut  oder eher schlecht zu befahren ausgegeben werden.
Des Weiteren wird es m&#246;glich sein spezielle Informationen zu interessanten Punkten wie Fahrradl&#228;den und -werkst&#228;tten, kulturellen Sehensw&#252;rdigkeiten und &#220;bernachtungsm&#246;glichkeiten wie Hotels, Pensionen etc. abzurufen. Zu Letztgenannten wird es dar&#252;ber hinaus Auskunft &#252;ber deren Radfahrerfreundlichkeit (z.B. Unterstellm&#246;glichkeiten f&#252;r Fahrr&#228;der) gegeben.
Erstmalig wird es dem User in einem Radroutenplaner m&#246;glich sein die Routenberechnung nach verschiedenen Profilen zu finden. So wird es ein sportliches Profil f&#252;r Rennradfahrer geben, welches asphaltierte Untergr&#252;nde f&#252;r das schnelle Vorankommen bevorzugt, ein Profil &#8222;Offroad&#8220; f&#252;r den Mountainbiker im Gel&#228;nde, wobei beispielsweise viel befahrene Hauptstra&#223;en explizit umgangen werden und schlie&#223;lich ein &#8222;gem&#252;tliches&#8220; Profil f&#252;r die Familientour durchs Gr&#252;ne. Das letztgenannte Profil wurde mit Hilfe von PostGIS-Operationen realisiert, welche es erm&#246;glichten Stra&#223;en ausfindig zu machen, welche in der N&#228;he von in den OpenStreetMap-Daten vorhandenen Gr&#252;nfl&#228;chen liegen. Die klassische k&#252;rzeste Verbindung zwischen zwei Punkten ist nat&#252;rlich ebenfalls implementiert, wobei der User &#252;ber das Setzen von Zwischenpunkte die M&#246;glichkeit hat die Route individuell anzupassen.
Als besonderes Feature wird es dem Nutzer m&#246;glich sein, die einzelnen Profile auch mobil zur Hand zu haben, indem man die gew&#252;nschten Routen auf ein fahrradtaugliches GPS-Ger&#228;t exportiert.
Die seit Mitte 2009 frei erh&#228;ltlichen ASTER-H&#246;hendaten in der Aufl&#246;sung 30m x 30m wurden benutzt, um die Steigungen der Stra&#223;en im Gebiet zu ermitteln. User k&#246;nnen je nach Vorliebe Steigungen unterschiedlichen Grades mit in die Routenberechnungen einbeziehen. Auch Gef&#228;lle kann bevorzugt werden. Als weiteres Feature kann sich der User das H&#246;henprofil der ermittelten Strecke ausgeben lassen.
Ebenso in dieser Auspr&#228;gung erstmalig ist die Integration sogenannter sozialer Funktionen, welche im Zeitalter des Web 2.0 immer wichtiger werden. Es stellt sich dem Nutzer die M&#246;glichkeit die neuen Interaktivit&#228;tsfunktionen des Netzes aktiv zu nutzen und somit ihre Autonomie zu st&#228;rken. Die Nutzer werden im weiteren Sinne nun selber zum Redakteur, Kommentator oder Networker, gestalten und organisieren das  Informations- und Beziehungs-Management im Internet aus eigener Hand. Den weitl&#228;ufigen Verbreitungsraten und aktuellen Funktionen folgt ein moderneres Level an Nutzerengagement und (Meinungs-) Macht[1]. Die Nutzer des Radroutenplaners k&#246;nnen also Routen anhand verschiedener Kriterien bewerten, Kommentare abgeben, selbst erstellte Routen weiterreichen und Erfahrungen austauschen. Dar&#252;ber hinaus wird die M&#246;glichkeit bestehen, die von den Usern im Durchschnitt sehr gut bewerteten Routen in die Routenberechnung mit einzubeziehen. 
Zus&#228;tzlich werden voreingestellte Themenrouten bereitgestellt, wie z.B. Freizeit- und Erholungsrouten entlang besonderer Sehensw&#252;rdigkeiten oder Erlebnisrouten durch besondere Naturgebiete sowie regionale Rad- und Wanderrouten. Ebenso geplant ist eine API, welches die Benutzung des Routenplanungsservices f&#252;r externe Anwendungen anbietet.

Kontakt zum Autor:
Andreas Mescheder                        Bryan Hempen
Universit&#228;t Osnabr&#252;ck                    Universit&#228;t Osnabr&#252;ck
D&#252;testra&#223;e 17                            Natruper Strasse 141
49134 Wallenhorst                        49076 Osnabr&#252;ck
05407/31027                              0541/76099001
amesched@uos.de                          brhempen@uos.de  


Literatur
[1] Prof. Wolfgang Prinz, 2007
online: http://www.competence-site.de/e-business/EInterview-Prof-Wolfgang-Prinz-zum-Virtual-Roundtable-Web-Competence-and-Responsibility-Teil1-Web-2-0-Bedeutung-Chancen-Risiken </abstract>
        <description></description>
        <persons>
          <person id="44">Andreas Mescheder</person>
        </persons>
        <links>
          <link href="http://www.fahrradies.net">Offizielle Seite des Projektes</link>
        </links>
      </event>
    </room>
    <room name="Kleiner H&#246;rsaal (Geb. 35, E01)">
      <event id="133">
        <start>09:00</start>
        <duration>00:30</duration>
        <room>Kleiner H&#246;rsaal (Geb. 35, E01)</room>
        <slug></slug>
        <title>Einsatzm&#246;glichkeiten von freier Software in der Fernerkundung f&#252;r die Lehre</title>
        <subtitle></subtitle>
        <track>Vortr&#228;ge</track>
        <type>lecture</type>
        <language></language>
        <abstract>Das Angebot an Open Source und freier Software mit r&#228;umlichen Bezug ist in den letzten Jahren stark gestiegen. Immer neue Softwareprojekte kommen hinzu und bestehende Projekte werden regelm&#228;&#223;ig erweitert. Die Softwareprojekte haben mittlerweile eine Qualit&#228;t erreicht, die es  erm&#246;glicht, freie Software in der Lehre f&#252;r Geoinformatik und Fernerkundung einzusetzen. F&#252;r welchen Zweck die unterschiedlichen Softwareprojekte allerdings eingesetzt werden k&#246;nnen, ist zumeist nicht auf den ersten Blick erkennbar. Einen &#220;berblick &#252;ber freie und kostenlose Softwareprojekte mit denen Fernerkundungdaten verarbeitet und analysiert werden k&#246;nnen, sollen in dieser Pr&#228;sentation dargestellt werden. Fernerkundungsdaten sind hier im Wesentlichen Rasterdaten, die durch passive und aktive Sensoren aufgenommen worden sind. Unter Fernerkundung versteht man dabei die ber&#252;hrungsfreie Erkundung der Erdoberfl&#228;che mit Hilfe unterschiedlicher Sensoren. F&#252;r diese Untersuchung wurden Luft- und Satellitenbilder eingesetzt.
In einem ersten Schritt wurden die Softwareprojekte ausgew&#228;hlt, die Rasterdaten verarbeiten k&#246;nnen. Eine Software wurde von der Untersuchung ausgeschlossen, wenn nur eine Rasterdatei anzeigt werden kann oder sich nur rudiment&#228;re Prozesse durchf&#252;hren lassen (wie z.B. einfache Kontrastver&#228;nderungen). 
F&#252;r die Bewertung der Software wurden sowohl allgemeine Merkmale wie die Installation, das Benutzerinterface und die angebotene Hilfe beurteilt, aber auch spezielle Funktionen, die f&#252;r die Fernerkundung von Interesse sind: Welche Formate werden unterst&#252;tzt (Import/Export), wie werden die Daten visualisiert (Visualisierung), welche M&#246;glichkeiten gibt es bei der Klassifizierung, Segmentierung, Filterung, Bildverbesserung oder der Atmossph&#228;renkorrektur? Zudem wurde untersucht, ob Transformationen des Farbraums oder mittels FFT und Wavelets m&#246;glich sind, sowie der Umfang der Georeferenzierung und Orthorektifizierung. Es wurde gepr&#252;ft, ob Stereo Verarbeitung, Koordinatentransformation, Vektoroperationen, Bildfusion und Ver&#228;nderungsanalysen m&#246;glich und Raster-GIS-Funktionen implementiert sind. Bewertet wurde, ob Histogrammver&#228;nderungen durchgef&#252;hrt,	Indizes	 berechnet oder H&#246;henmodelle integriert  werden k&#246;nnen. 
Die untersuchte Software umfasst sowohl die bekannteren Projekte wie GRASS, SAGA GIS, OSSIM, OpenEV und ILWIS, als auch die eher unbekannten Softwareprojekte ORFEO Toolbox und Opticks. In dieser Studie zeigt sich, dass die unterschiedlichen Softwarepakete trotz ihres Umfanges, sehr unterschiedliche Funktionen beinhalten, so dass es kein Softwarepaket gibt, dass alle Funktionen bietet. Es k&#246;nnen vielmehr f&#252;r die unterschiedlichen Funktionen und Operationen unterschiedliche Softwarepakete als Favoriten benannt werden, da jedes Softwarepaket St&#228;rken und Schw&#228;chen aufzeigt. Dies zeigt sich bei den allgemeinen Funktionen, wie z.B. bei der Dokumentation, so ist f&#252;r ORFEO keine Dokumentation der Benutzeroberfl&#228;che vorhanden und bei OSSIM steht ein 107 seitiges Handbuch zur Verf&#252;gung. Aber auch bei den Funktionen zur Fernerkundung haben die Produkte unterschiedliche St&#228;rken und Schw&#228;chen: So enth&#228;lt z.B. die Software Opticks keine Segmentierung w&#228;hrend in ORFEO mehrere Segmentierungsverfahren umgesetzt wurden.</abstract>
        <description></description>
        <persons>
          <person id="104">Sascha Klonus</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="98">
        <start>09:30</start>
        <duration>00:30</duration>
        <room>Kleiner H&#246;rsaal (Geb. 35, E01)</room>
        <slug></slug>
        <title>Abh&#228;ngigkeitsbetrachtung von Hydranten mit Hilfe r&#228;umlicher Daten</title>
        <subtitle></subtitle>
        <track>Vortr&#228;ge</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Dieser Vortrag befasst sich mit der qualitativen Absch&#228;tzung der Auslastung in einem Wasserleitungsnetzwerk und liefert Aussagen &#252;ber Entnahmekapazit&#228;ten an ausgew&#228;hlten Hydranten. Unter Verwendung der GIS-Software OpenJump werden die analysierten Anforderungen realisiert. Ziel ist es, eine Aussage &#252;ber die zu erwartende Entnahmekapazit&#228;t gew&#228;hlter Hydranten zu treffen, sowie &#252;ber deren gegenseitige Beeintr&#228;chtigung. Es sollen verschiedene Szenarien der L&#246;schwasserentnahme simuliert und abgebildet werden. Das Ergebnis dieser Arbeit soll im Krisenfall den Einsatzkr&#228;ften und dem Krisenstab eine Orientierungshilfe bei der Auswahl der L&#246;schwasserentnahmestellen geben. 

Die Entnahme gro&#223;er L&#246;schwassermengen erfolgt in der Praxis nicht an einzelnen, sondern an mehreren benachbarten Hydranten. Dies kann, je nach Topologie und Kapazit&#228;t des Versorgungsnetzes, zu einer Beeintr&#228;chtigung der zu erwartenden Gesamtmenge f&#252;hren. Zu dieser Problematik ist ein Flussmaximierungsalgorithmus, auf der Basis von Edmonds-Karp, entwickelt worden. Dieser ist in der Lage, in einem Wasserleitungsnetz f&#252;r eine vorher getroffene Auswahl von Hydranten die maximale Flusskapazit&#228;t zu finden. Basierend auf dieser Berechnung werden Wechselwirkungen zwischen den Hydranten bei der Wasserentnahme erkannt.
Die Auswahl von Wasserentnahmestellen nach bestimmten Kriterien z.B. nach der geographisch k&#252;rzesten Entfernung zur Brandstelle, f&#252;hrt nicht immer zu einer optimalen Wasserversorgung. Die Entnahmestellen k&#246;nnen sich gegenseitig Wasser entziehen und somit das gesamte Wasserentnahmepotential negativ beeinflussen. Bei bestimmten topologischen Gegebenheiten kann eine Hinzunahme von weiter entfernten Hydranten zu einem h&#246;heren Entnahmepotential f&#252;hren. 

Die vorliegende Entwicklung stellt eine Erg&#228;nzung eines Stabsklienten dar, der der Entscheidungsfindung bei der Koordination von Einsatzkr&#228;ften dient. Der Stabsklient ist im Rahmen des Projektes &#8222;Offenes Katastrophenmanagement mit freiem GIS&#8220; (OK-GIS1) entwickelt worden und dient der Visualisierung und Bearbeitung von Daten, die bei der Einsatzplanung wichtig sind, wie u. a. Lagekarten, Geb&#228;udepl&#228;ne, Einsatzdaten und Simulationsergebnisse. Bei diesen Arbeiten kooperiert die Fachhochschule Osnabr&#252;ck mit der Berufsfeuerwehr Osnabr&#252;ck und der Stadtwerke Osnabr&#252;ck AG.</abstract>
        <description></description>
        <persons>
          <person id="126">J&#252;rgen Biermann</person>
          <person id="125">Rafael Beermann</person>
          <person id="127">Roland K&#246;nig</person>
          <person id="73">Theodor Gervens</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="10">
        <start>10:00</start>
        <duration>00:30</duration>
        <room>Kleiner H&#246;rsaal (Geb. 35, E01)</room>
        <slug></slug>
        <title>GIS-Lehre mit Quantum-GIS im Studiengang Stadt- und Landschaftsplanung</title>
        <subtitle>GIS als allt&#228;gliches Werkzeug im Studium der Stadt- und Landschaftsplanung an der Uni Kassel</subtitle>
        <track>Vortr&#228;ge</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Im Wintersemester 2009/10 begannen &#252;ber 300 Studierende an der Uni Kassel mit dem Studium der Stadt- und Landschaftsplanung. Gleichzeitig war ein Beschluss des Fachbereichs umzusetzen, dass jeder Studierende im ersten Semester eine Grundausbildung im Bereich Geographischer Informationssysteme erh&#228;lt.
Da es im Computer-Labor des Fachbereichs weniger als 30 Arbeitspl&#228;tze mit einer ArcGIS-Installation gibt, musste ein Konzept entwickelt werden, welches den Studierenden nicht nur eine Vorlesung zu GIS, sondern vor allem Arbeits- und &#220;bungsm&#246;glichkeiten bietet!
Die neue eingestellte Lehrkraft f&#252;r GIS entwickelte ein Konzept, bei dem die Software QGIS eine zentrale Rolle spielt. Die Studierenden installieren sich QGIS auf ihre privaten Computer und bekommen &#252;ber das E-Learning-Portal Moodle &#220;bungsaufgaben, Screenshotdokumentationen und Geodaten zur Verf&#252;gung gestellt. Die Betreuung erfolgt online &#252;ber ein Frage- und Antwortforum sowie &#252;ber die zweiw&#246;chentlich stattfindenden Vorlesungstermine.
Die "Lehrkraft f&#252;r GIS" musste vorher einige Widerst&#228;nde &#252;berwinden, um die Professorenschaft davon zu &#252;berzeugen, dass praxisrelevate GIS-Kenntnisse auch mit anderer Software als mit ArcGis zu erlernen sind. Die &#220;bungsergebnisse der Studierenden belegen, dass Sie sich mit Hilfe des Einf&#252;hrungskurses unter Verwendung von QGIS GIS-Grundkenntnisse angeignet haben, die bei den vorherigen Stundierendengenerationen am Fachbereich nicht vorhanden waren.</abstract>
        <description></description>
        <persons>
          <person id="12">Claas Leiner</person>
        </persons>
        <links>
          <link href="https://moodle.uni-kassel.de/moodle/course/view.php?id=3428">https://moodle.uni-kassel.de/moodle/course/view.php?id=3428</link>
        </links>
      </event>
      <event id="128">
        <start>11:00</start>
        <duration>00:30</duration>
        <room>Kleiner H&#246;rsaal (Geb. 35, E01)</room>
        <slug></slug>
        <title>Performance und Verf&#252;gbarkeit von WMS-Servern</title>
        <subtitle></subtitle>
        <track>Vortr&#228;ge</track>
        <type>lecture</type>
        <language></language>
        <abstract>Seit dem &#8222;WMS Performance Shootout&#8220; anl&#228;sslich der FOSS4G-Konferenz im Jahr 2009 steht ein Testdatensatz zur freien Verf&#252;gung, mit welchem die Performance von WMS-Servern gemessen und verglichen werden kann.
Neben den Erkenntnissen des Shootouts von Sidney werden die Testdaten und -prozeduren vorgestellt, um sie f&#252;r eigene Messungen und Performanceoptimierungen einsetzen zu k&#246;nnen.

Weiter wird eine Auswertung der Zugriffszeiten und der Verf&#252;gbarkeit der &#252;ber 2200 auf geopole.org aufgelisteten WMS-Servern vorgestellt. Als Nebenprodukt der verteilten Server&#252;berwachung von geopole.org k&#246;nnen auch weitere statistische Aussagen zum Beispiel &#252;ber die eingesetzten Produkte, die WMS Standard-Versionen und Konformit&#228;t gemacht werden.

Basierend auf diesen Informationen werden Hinweise zur Optimierung von Performance und Verf&#252;gbarkeit von WMS-Servern mit Fokus auf den UMN-Mapserver gegeben.</abstract>
        <description></description>
        <persons>
          <person id="99">Pirmin Kalberer</person>
        </persons>
        <links>
          <link href="http://wiki.osgeo.org/wiki/FOSS4G_Benchmark">OSGeo WMS Benchmark Page</link>
          <link href="http://geopole.org/checks">Geopole WMS Checks</link>
          <link href="http://geopole.org/statistics">Geopole WMS Statistik</link>
          <link href="http://www.slideshare.net/gatewaygeomatics.com/wms-performance-shootout">FOSS4G Shot-Out Pr&#228;sentation 2009</link>
        </links>
      </event>
      <event id="48">
        <start>11:30</start>
        <duration>00:30</duration>
        <room>Kleiner H&#246;rsaal (Geb. 35, E01)</room>
        <slug></slug>
        <title>Cloud Computing f&#252;r FOSSGIS Web Services</title>
        <subtitle></subtitle>
        <track>Vortr&#228;ge</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Die gro&#223;en Unternehmen der IT-Branche, wie Google, IBM, Amazon und Microsoft haben das Thema Cloud Computing gro&#223; auf ihre Fahnen geschrieben. Der GIS-Bereich und erst recht der FOSSGIS-Bereich hinken mal wieder hinterher.
Die Pr&#228;sentation wird erkl&#228;ren, was hinter dem Hype steht und eine Einf&#252;hrung in das Thema Cloud Computing geben. Insbesondere werden unterschiedliche Potentiale und Anwendungsm&#246;glichkeiten aus dem GDI und GIS Umfeld analysiert die u.a. auch aus INSPIRE Performance Anforderungen abgeleitet werden.
Abschlie&#223;end werden die gro&#223;en Cloud Anbieter Amazon und Google verglichen und ein Web-based Geoprocessing Anwendungsfall vorgestellt, der mit beiden Anbietern realisiert wurde. Performance, Lessons-learned und Usability werden verglichen.
</abstract>
        <description>Die gro&#223;en Unternehmen der IT-Branche, wie Google, IBM, Amazon und Microsoft haben das Thema Cloud Computing gro&#223; auf ihre Fahnen geschrieben. Der GIS-Bereich und erst recht der FOSSGIS-Bereich hinken mal wieder hinterher.
Die Pr&#228;sentation wird erkl&#228;ren, was hinter dem Hype steht und eine Einf&#252;hrung in das Thema Cloud Computing geben. Insbesondere werden unterschiedliche Potentiale und Anwendungsm&#246;glichkeiten aus dem GDI und GIS Umfeld analysiert die u.a. auch aus INSPIRE Performance Anforderungen abgeleitet werden.
Abschlie&#223;end werden die gro&#223;en Cloud Anbieter Amazon und Google verglichen und ein Web-based Geoprocessing Anwendungsfall vorgestellt, der mit beiden Anbietern realisiert wurde. Performance, Lessons-learned und Usability werden verglichen.
</description>
        <persons>
          <person id="52">Bastian Sch&#228;ffer</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="70">
        <start>13:30</start>
        <duration>01:30</duration>
        <room>Kleiner H&#246;rsaal (Geb. 35, E01)</room>
        <slug></slug>
        <title>Mapbender Anwendertreffen</title>
        <subtitle></subtitle>
        <track>Anwendertreffen</track>
        <type>user_meeting</type>
        <language>de</language>
        <abstract>Das Anwendertreffen dient dem Kennenlernen und dem Austausch von Mapbender-Anwendern und Entwicklern. Auf dem Treffen k&#246;nnen Ideen eingebracht werden sowie Tipps und Tricks ausgetauscht werden.

Im Vordergrund steht die Diskussion &#252;ber die weitere Entwicklung und die Erfahrungen mit Mapbender.

Zu Beginn des Treffens werden die Neuerungen der Mapbender Version 2.7 vorgestellt. Es erfolgt ein &#220;berblick &#252;ber die Roadmap durch die Entwickler. Es wird ein Fragebogen verteilt, &#252;ber den die Anwender Feedback geben k&#246;nnen.
Dieses Treffen ist Teil der Vorbereitung des Development Sprints am Freitag direkt nach der FOSSGIS. Auch hier sind alle Entwickler und Anwender eingeladen, die sich aktiv im Projekt Mapbender einbringen wollen.

Im Anschluss an die Veranstaltung kann die Diskussion in einer Osnabr&#252;cker Kneipe fortgef&#252;hrt werden.

Weitere Informationen finden Sie unter: http://www.mapbender.org/FOSSGIS_2010 </abstract>
        <description></description>
        <persons>
          <person id="65">Astrid Emde</person>
          <person id="115">Christoph Baudson</person>
        </persons>
        <links>
          <link href="http://www.mapbender.org/Mapbender_Anwendertreffen_FOSSGIS_2010">http://www.mapbender.org/Mapbender_Anwendertreffen_FOSSGIS_2010</link>
        </links>
      </event>
      <event id="8">
        <start>15:30</start>
        <duration>00:30</duration>
        <room>Kleiner H&#246;rsaal (Geb. 35, E01)</room>
        <slug></slug>
        <title>Kartenmaterial f&#252;r Sehbehinderte und Blinde</title>
        <subtitle>Ein Alleinstellungsmerkmal von OpenStreetMap</subtitle>
        <track>OSM-Vortr&#228;ge</track>
        <type>lecture</type>
        <language></language>
        <abstract>Crowdsourcing erm&#246;glicht ein Micro-Mapping, das von kommerziellen Kartenanbietern nicht fl&#228;chendeckend oder rentabel zu leisten ist.
Mit den Projekten zur Barrierefreiheit von OpenStreetMap Kartenmaterial ist ein Schritt in diese Richtung getan, der den Schw&#228;cheren in unserer Gesellschaft und weltweit zu wertvollen Informationen verhilft. 
</abstract>
        <description>Am Beispiel von "OSM f&#252;r Blinde" wird erl&#228;utert, welche Informationen f&#252;r barrierefreies Kartenmaterial von Wert sind, und in welchen ungew&#246;hnlichen Formen das Kartenmaterial angeboten und genutzt werden kann.
Ist Kartenmaterial f&#252;r Behinderte genauso von Interesse wie f&#252;r Nichtbehinderte? Warum mehr? Warum anders?
Die visuelle Karte f&#252;r Blinde: Welche Objekte sind von Interesse und k&#246;nnen nun in OSM erg&#228;nzt werden?
Welche M&#246;glichkeiten sind denkbar, um tastbare Karten aus OpenStreetMap-Daten zu erstellen und welche Anforderungen gibt es an solche Karten?
Wie kann man eine (bestehende, herk&#246;mmliche) Routing-Applikation anpassen, damit sie blinden-barrierefrei wird?
Wie k&#246;nnen Blinde Menschen beim Croudsourcing f&#252;r OSM mitwirken?
Der Projektstand einer Handy-Navigationsl&#246;sung f&#252;r Blinde auf JavaME-Basis wird vorgestellt, die im Rahmen einer Bachelorarbeit an der Fachhochschule Hannover in Kooperation mit Firma H&#246;nigsberg &amp; D&#252;vel programmiert wird.
Die ersten taktilen Karten auf Basis von OpenStreetMap-Daten stehen zum Anfassen bereit.

</description>
        <persons>
          <person id="10">Annette Thurow</person>
        </persons>
        <links>
          <link href="http://wiki.openstreetmap.org/wiki/DE:OSM_for_the_Blind">http://wiki.openstreetmap.org/wiki/DE:OSM_for_the_Blind</link>
          <link href="http://www.barrierefreie-karten.de">http://www.barrierefreie-karten.de</link>
          <link href="https://lists.openstreetmap.de/mailman/listinfo/blindennavigation">https://lists.openstreetmap.de/mailman/listinfo/blindennavigation</link>
          <link href="https://lists.openstreetmap.de/mailman/listinfo/haptischekarten">https://lists.openstreetmap.de/mailman/listinfo/haptischekarten</link>
        </links>
      </event>
      <event id="90">
        <start>16:00</start>
        <duration>00:30</duration>
        <room>Kleiner H&#246;rsaal (Geb. 35, E01)</room>
        <slug></slug>
        <title>OpenStreetMap und die GIS-Ausbildung</title>
        <subtitle></subtitle>
        <track>OSM-Vortr&#228;ge</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Ausgangspunkt
Der in den meisten Bundesl&#228;ndern Deutschlands freie und kostenlose Zugang zu amtlichen Geodaten auf Basis der WMS-Technologie stellt heute kein Hindernis wie noch vor ein paar Jahren dar (vgl. DE LANGE 2006). Mit der Initiierung des OpenStreetMap-Projektes stehen heute f&#252;r jeden Anwender Geodaten im Vektorformat und GI-Software kostenlos und somit auch f&#252;r Schulen und Universit&#228;ten zur Verf&#252;gung. Der Beitrag privater Personen, die in ihrer Freizeit unentgeltlich vektorbasierte Geodaten meist mit GPS-Handempf&#228;ngern erfassen, ist beeindruckend; die Anzahl der registrierten User hat sich von 2008 auf 2009 vervierfacht (HEISE.DE 2009). Allerdings ist hier die Frage der Genauigkeit, Qualit&#228;t und Validit&#228;t der Daten zu pr&#252;fen (GOODCHILD 2007). Es besteht potentiell die Gefahr, da&#223; die Aktualisierung dieser auf dem Prinzip des Crowdsourcings (HOWE 2006, 2008) bzw. Volunteered Geographic Informations erhobenen Geodaten vernachl&#228;ssigt wird (GOODCHILD 2008). 
Der folgende Beitrag soll aufzeigen, wie Sch&#252;lerinnen/Sch&#252;ler/Studierende f&#252;r das Projekt OpenStreetMap diese Aufgabe mit &#252;bernehmen k&#246;nnen und welche Vor- und ggf. Nachteile mit dem Prinzip des Crowdsourcings einhergehen k&#246;nnen.

Geodatenerfassung und -pflege im Schulunterricht
Das selbst&#228;ndige Arbeiten an realit&#228;tsnahen Beispielen sowie der unmittelbare Bezug zur eigenen Region sind verschiedener Studien und Untersuchungen zufolge die Voraussetzungen f&#252;r einen interessanten Unterricht von heute (vgl. bspw. HEMMER &amp; HEMMER 2002, REINFRIED 2006). Entsprechende didaktische Konzepte haben in der Praxis auch Eingang gefunden (vgl. JEKEL ET AL. 2006-2008, FALK &amp; SCHLEICHER 2005, SCHLEICHER 2006, SCH&#196;FER 2006 u.v.m.). Mit kostenfrei zur Verf&#252;gung stehenden GI-Softwareprodukten k&#246;nnen den Lernenden entsprechende    Techniken   und    Funktionalit&#228;ten,   wie  z.B.  Digitalisieren,   GPS-Datenerfassung, Datenkonvertierungen, aber auch Analysefunktionen anhand der OpenStreetMap-Daten vorgestellt und erkl&#228;rt werden.

Die Aktualisierung und Fortschreibung von Geodaten wird im Vergleich zur erstmaligen Erhebung in der allt&#228;glichen Anwendung als eine &#8222;weniger motivierende Handlung&#8220; empfunden (GOODCHILD 2008). Entsprechend wird die Aktualisierung oft vernachl&#228;ssigt, obwohl sie wie die Datenerhebung eine zentrale Rolle f&#252;r die Aktualit&#228;t und Qualit&#228;t der Geodaten spielt. Der periodisch wiederkehrende Unterrichtsinhalt ist ein geeigneter L&#246;sungsansatz,   um   die   Aktualisierung  und   Fortschreibung    von Geodaten zu gew&#228;hrleisten.

Die Anforderungen an die GI-Softwareprodukte und der implementierten Funktionalit&#228;ten, wie auch die Benutzerfreundlichkeit und die      Anwendungsm&#246;glichkeiten im Projekt OpenStreetMap sind hierf&#252;r von gro&#223;er Bedeutung.</abstract>
        <description></description>
        <persons>
          <person id="58">Gerd Peyke</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="77">
        <start>16:30</start>
        <duration>00:30</duration>
        <room>Kleiner H&#246;rsaal (Geb. 35, E01)</room>
        <slug></slug>
        <title>Touristische St&#228;dte-Touren in OSM</title>
        <subtitle>Hochschulprojekte erweitern OSM-Karten</subtitle>
        <track>OSM-Vortr&#228;ge</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Gemeinsam einzelne OpenStreetMap-Projekte in vorgegebenen Zeitr&#228;umen zu realisieren ist die Aufgabenstellung von so genannten Erstsemesterprojekten des Fachbereichs Elektrotechnik an der Hochschule Fulda. Neben dem eigentlichen Anspruch, sich selbst in Projektmanagement zu &#252;ben, kommt es dem Fachbereich auch darauf an, dass sich Studenten mit der Region und deren Kulturg&#252;tern auseinandersetzen - und nebenher etwas &#252;ber Geodaten lernen und mit ihren Projekten die Karten der OSM-Communitys erweitern.</abstract>
        <description>Nachdem im Wintersemester 2008/09 ein erstes Projekt den Kontakt zwischen E-Technik-Studenten zu OpenStreetMap herstellte, in dem sie den kompletten Campus der Hochschule Fulda erfassen mussten, wurde im Folgejahr der Kontakt zur Stadt Fulda gesucht und gemeinsam entwickelte man einen "OSM-Fahrplan", in dem die ohnhehin von der Tourist-Information f&#252;r Kinder angefertigte "Stadt-Ralley" in ihrem Routenverlauf mit ihren Geodaten erfasst wurden und eine OSM-Karte angefertigt wird. Dasselbe Vorgehen wurde auch auf den 1. Gartenkulturpfad Deutschlands angewendet. Die zahlreichen (halb-) &#246;ffentlichen G&#228;rten und Freizeitanlagen im Stadtzentrum von Fulda (teilweise auch vor den Stadttoren) wurden von den Studenten mit GPS-Trackern erfasst und ebenfalls auf den OSM-Server aufgespielt und eine Karte generiert. Dieses Projekt war nicht nur besonders Zeitintensiv, sondern erfasste auch Wege in Parkanlagen etc. die sonst nicht im ersten Fokus der Datenerfassung von OSM-Trackern stehen. F&#252;r ein Kinderbuchprojekt wurden alle "tierischen Motive" im Stadtbild erfasst und als OSM-Karte generiert. Diese studentischen Projekte haben neben ihrer technischen Seiten, ihren Bezug zur Geoinformation, dem Heranf&#252;hren an die Funktionsweise von GPS-Trackern auch die Seite der Hinwendung zur Kultur, zur Geschichte und zur Architekt einer Region. Dieser Anspruch wird durch Nachahmeffekte noch vergr&#246;&#223;ert. Andere Studenten der Hochschule, die diese GPS-Datenerfassenden Studenten sahen, kamen nun auf die Idee, selbst&#228;ndig eigene Gebiete zu erfassen. So steht als n&#228;chstes die Gemeinde Rasdorf und der ehemalige (DDR-) Grenz&#252;bergang "Point Alpha" auf dessen Gemarkungsgrenze im Fokus dieser "freiwilligen Studenten".</description>
        <persons>
          <person id="132">Peter Wolff</person>
        </persons>
        <links>
        </links>
      </event>
    </room>
    <room name="Workshop 1 (Geb. SI, SI0201)">
      <event id="6">
        <start>09:00</start>
        <duration>01:30</duration>
        <room>Workshop 1 (Geb. SI, SI0201)</room>
        <slug></slug>
        <title>GRASS GIS Workshop</title>
        <subtitle>Praktische Einf&#252;hrung in die aktuelle Version der Software</subtitle>
        <track>Workshops</track>
        <type>workshop</type>
        <language>de</language>
        <abstract>Der Workshop richtet sich an alle GRASS GIS-Interessierten, die einen &#220;berblick &#252;ber die Software GRASS GIS und die neue Standard Python GUI der wahrscheinlich bald ver&#246;ffentlichten Version 6.4 bekommen m&#246;chten, die nicht nur eine Portierung der tcltk Variante darstellt, sondern zahlreiche, benutzerfreundliche Neuerungen in der Handhabung mitbringt. Anhand eines praktischen Workflows sollen Standardanwendugen und Neuerungen vorgestellt werden, um zu demonstrieren, dass ein einfacher Einstieg in das Arbeiten mit GRASS GIS auch ohne QGIS m&#246;glich ist. </abstract>
        <description></description>
        <persons>
          <person id="9">Otto Dassau</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="7">
        <start>13:30</start>
        <duration>01:30</duration>
        <room>Workshop 1 (Geb. SI, SI0201)</room>
        <slug></slug>
        <title>Fortgeschrittene Anwendungen mit Quantum GIS</title>
        <subtitle>Arbeiten mit den Erweiterungen (GRASS GIS, PostGIS, etc.)</subtitle>
        <track>Workshops</track>
        <type>workshop</type>
        <language>de</language>
        <abstract>Der Kurs soll einen Einstieg in das praktische Arbeiten mit den QGIS Erweiterungen geben. Dabei konzentrieren sich die Inhalte auf Plugins wie GRASS GIS, PostGIS oder OpenStreetMap. Inhaltlich geht es also nicht um eine QGIS Einf&#252;hrung, sondern eher darum, wie man QGIS verwenden kann, um auf anderen Applikationen zuzugreifen und deren Funktionalit&#228;ten zu nutzen. </abstract>
        <description></description>
        <persons>
          <person id="9">Otto Dassau</person>
        </persons>
        <links>
        </links>
      </event>
    </room>
    <room name="Workshop 2 (Geb. SI, SI0202)">
      <event id="71">
        <start>09:00</start>
        <duration>01:30</duration>
        <room>Workshop 2 (Geb. SI, SI0202)</room>
        <slug></slug>
        <title>GeoServer Workshop mit Schwerpunkt OGC WFS</title>
        <subtitle></subtitle>
        <track>Workshops</track>
        <type>workshop</type>
        <language>de</language>
        <abstract>Dieser Workshop soll die M&#246;glichkeit geben, einen Einblick in die WFS-Technologie zu erhalten. Am Beispiel des GeoServers, der als WFS-T eingesetzt werden kann, sollen die Grundlagen und M&#246;glichkeiten, die WFS bietet, aufgezeigt werden.</abstract>
        <description>Dieser Workshop soll die M&#246;glichkeit geben, einen Einblick in die WFS-Technologie zu erhalten. Am Beispiel des GeoServers, der als WFS-T eingesetzt werden kann, sollen die Grundlagen und M&#246;glichkeiten, die WFS bietet, aufgezeigt werden.

Hier eine &#220;bersicht &#252;ber die Themen des Workshops:

* Einf&#252;hrung in die OGC-Spezifikation
** WFS Grundlagen
** WFS Requests, Transaction
** Filter Encoding, GML

* Software&#252;bersicht der WFS Server 
** UMN MapServer (Basic WFS), GeoServer (WFS-T)

* Vorstellung einiger WFS Clients
** udig, gvSig, Quantum GIS
** Mapbender

* Anwendungsm&#246;glichkeiten und Anwendungsbeispiele
** Suche &#252;ber r&#228;umliche Attribute
** Suche &#252;ber alphanumerische Attribute
** Anzeige und Navigation
** Karten-Tooltips mit Hotlink
** Digitalisierung (WFS-Transactional)
</description>
        <persons>
          <person id="65">Astrid Emde</person>
        </persons>
        <links>
          <link href="http://geoserver.org">http://geoserver.org</link>
          <link href="http://www.fossgis.de/konferenz/wiki/GeoServer_Workshop_mit_Schwerpunkt_OGC_WFS">LInks zum GeoServer Workshop</link>
          <link href="http://www.fossgis.de/konferenz/wiki/Image:Workshop_GeoServer_WFS_FOSSGIS2010.pdf">GeoServer Workshop Pr&#228;sentation (pdf)</link>
          <link href="http://www.fossgis.de/konferenz/wiki/Image:Workshop_GeoServer_WFS_FOSSGIS2010.pdf">GeoServer Workshop Pr&#228;sentation (pdf)</link>
        </links>
      </event>
      <event id="65">
        <start>13:30</start>
        <duration>01:30</duration>
        <room>Workshop 2 (Geb. SI, SI0202)</room>
        <slug></slug>
        <title>PostgreSQL/PostGIS-Workshop f&#252;r Fortgeschrittene</title>
        <subtitle></subtitle>
        <track>Workshops</track>
        <type>workshop</type>
        <language></language>
        <abstract>Geplantes Programm:
- kurze Einf&#252;hrung &#252;ber den Funktionsumfang von PostGIS
- Analyse von Geometrien 
- Plausibilit&#228;tspr&#252;fungen, Bedingungen, Validit&#228;t
- Beispiel: Kleinstfl&#228;chen aus Datens&#228;tzen finden und eliminieren
- Neue Geometrien erzeugen
- R&#228;umliche Joins

Ziegruppe/Vorbedingungen: Technisch Interessierte, die den Umgang mit PostGIS bei allt&#228;glichen GIS-Fragestellungen erlernen wollen. Grundlagen in SQL sind n&#246;tig.
</abstract>
        <description></description>
        <persons>
          <person id="31">Harald Schwenk</person>
          <person id="46">Stephan Holl</person>
        </persons>
        <links>
        </links>
      </event>
    </room>
    <room name="Seminarraum 1 (Geb. 66/E01)">
      <event id="74">
        <start>15:30</start>
        <duration>03:30</duration>
        <room>Seminarraum 1 (Geb. 66/E01)</room>
        <slug></slug>
        <title>Mapbender Modulentwicklung</title>
        <subtitle></subtitle>
        <track>Developer-Treffen</track>
        <type>developer_meeting</type>
        <language>de</language>
        <abstract>Die konsequente Nutzung der popul&#228;ren JavaScript-Bibliothek jQuery in Mapbender er&#246;ffnet Entwicklern einige interessante neue M&#246;glichkeiten. Zum einen ist es deutlich einfacher geworden, eigene Module zu entwickeln, selbst Programmiereinsteiger werden mit wenigen Zeilen Code schnell Erfolgserlebnisse erzielen k&#246;nnen. Zum anderen stehen einige m&#228;chtige Werkzeuge wie jQuery UI oder Datatables bereit, mit denen sich auch sehr komplexe Module einfach entwicklen lassen. Das alles ist eingebettet in das bekannte Mapbender-Konzept, Applikationen &#252;ber Administrationsoberfl&#228;chen komfortabel verwalten zu k&#246;nnen, um sowohl maximale Flexibilit&#228;t zu gew&#228;hrleisten, als auch die gesamte Tiefe an GIS-Funktionalit&#228;t auszusch&#246;pfen.

    * Programmierleitfaden f&#252;r Mapbender
    * Mapbender API
    * JavaScript und PHP
    * jQuery und Plugins
    * jQuery UI und dessen CSS Framework
    * Leitfaden zur nachhaltigen Erstellung von WebGIS-Applikationen 
</abstract>
        <description>Die konsequente Nutzung der popul&#228;ren JavaScript-Bibliothek jQuery in Mapbender er&#246;ffnet Entwicklern einige interessante neue M&#246;glichkeiten. Zum einen ist es deutlich einfacher geworden, eigene Module zu entwickeln, selbst Programmiereinsteiger werden mit wenigen Zeilen Code schnell Erfolgserlebnisse erzielen k&#246;nnen. Zum anderen stehen einige m&#228;chtige Werkzeuge wie jQuery UI oder Datatables bereit, mit denen sich auch sehr komplexe Module einfach entwicklen lassen. Das alles ist eingebettet in das bekannte Mapbender-Konzept, Applikationen &#252;ber Administrationsoberfl&#228;chen komfortabel verwalten zu k&#246;nnen, um sowohl maximale Flexibilit&#228;t zu gew&#228;hrleisten, als auch die gesamte Tiefe an GIS-Funktionalit&#228;t auszusch&#246;pfen.

    * Programmierleitfaden f&#252;r Mapbender
    * Mapbender API
    * JavaScript und PHP
    * jQuery und Plugins
    * jQuery UI und dessen CSS Framework
    * Leitfaden zur nachhaltigen Erstellung von WebGIS-Applikationen 
</description>
        <persons>
          <person id="65">Astrid Emde</person>
          <person id="115">Christoph Baudson</person>
        </persons>
        <links>
          <link href="http://www.mapbender.org/FOSSGIS_2010_Mapbender_Community_Session">http://www.mapbender.org/FOSSGIS_2010_Mapbender_Community_Session</link>
        </links>
      </event>
    </room>
  </day>
  <day date="2010-03-05" index="4">
    <room name="Gro&#223;er H&#246;rsaal (Geb. 66, E33/34)">
      <event id="111">
        <start>09:00</start>
        <duration>00:30</duration>
        <room>Gro&#223;er H&#246;rsaal (Geb. 66, E33/34)</room>
        <slug></slug>
        <title>Die OpenStreetMap Foundation</title>
        <subtitle></subtitle>
        <track>OSM-Vortr&#228;ge</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Die OpenStreetMap Foundation ist die Organisation hinter OpenStreetMap. Ihr Ziel ist, die Erstellung und Verbreitung freier Geodaten zu f&#246;rdern und freie Geodaten zur Verf&#252;gung zu stellen. Sie will das Projekt OpenStreetMap unterst&#252;tzen, aber nicht kontrollieren. Die OSMF ist mitgliederbasiert und nicht gewinnorientiert.

Sie betreibt die zentralen Server f&#252;r OpenStreetMap und besitzt die Domains openstreetmap.org und osm.org.

Die OSMF hat einen Plan zur Umstellung von OpenStreetMap auf eine neue Lizenz, die Open Database License (ODbL), erarbeitet. Die ODbL ist wie die bisher genutzte Lizenz CC-BY-SA eine Share-Alike-Lizenz mit Namensnennung. Sie soll Probleme beheben, die bei der bisher genutzten Lizenz in Bezug auf Geodaten auftreten.

Die Arbeit der Foundation findet prim&#228;r in Arbeitsgruppen statt. Die derzeitigen Schwerpunkte sind:
* Administration der OSM-Server
* Lizenz
* Daten (Verhinderung von Urheberrechtsverst&#246;&#223;en, Vandalismus und &#228;hnlichen Problemen)
* Konferenz State of the Map
* Lokale Sektionen
* Fundraising
* Kommunikation</abstract>
        <description></description>
        <persons>
          <person id="82">Ulf M&#246;ller</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="26">
        <start>09:30</start>
        <duration>00:30</duration>
        <room>Gro&#223;er H&#246;rsaal (Geb. 66, E33/34)</room>
        <slug></slug>
        <title>Umfrage zur Motivation von Teilnehmern OpenGeodata Projekten</title>
        <subtitle>Namentlich zu den Projekten OpenStreetMap und OpenAddresses im deutschsprachigen Raum</subtitle>
        <track>OSM-Vortr&#228;ge</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Im Rahmen einer Projektarbeit an der Fachhochschule Nordwestschweiz erarbeitete eine Studierendengruppe der Hochschule f&#252;r Angewandte Psychologie im Auftrag des Instituts Vermessung und Geoinformation der Hochschule f&#252;r Architektur, Bau und Geomatik eine Studie rund um die Frage, was Menschen motiviert, sich in OpenGeodata Projekten zu engagieren. Diese Erhebung wurde mittels einer quantitativ-qualitativen Anwenderbefragung elektronisch und unter Wahrung der Anonymit&#228;t der einzelnen Teilnehmenden umgesetzt. Der Fragebogen wurden &#252;ber die beiden Projekte OpenStreetMap und OpenAddresses im deutschsprachigen Raum publiziert. 

Auf Basis der theoretischen Grundlagen und dem derzeitigen Stand der Erkenntnisse &#252;ber &#8218;Volunteered Geographic Information' wurde ein Fragebogen konzipiert, welcher eine empirische Analyse der obigen Fragestellung(en) erm&#246;glichte.  Motivationspsychologische Leithypothese war dabei, dass die T&#228;tigkeiten in den erw&#228;hnten Crowdsourcing Projekten eine hohe intrinsische Motivation zur aktiven, selbstbestimmten Teilnahme voraussetzen.  Eine weitere Hypothese, welche untersucht wurde, war die Teilnahme- bzw. Arbeitsform der &#8218;crowdsourcing&#8217; Projektaktivit&#228;ten, welche aufgrund arbeitspsychologischer Hypothese eine f&#246;rderliche &#8218;Aufgabenvollst&#228;ndigkeit&#8217;  aufweisen m&#252;ssten. 

Die Umfrage f&#252;hrte zu &#252;ber 400 vollst&#228;ndigen Interviews. Zur Zeit der Einreichung dieses Abstracts ist die Auswertung noch in vollem Gang. Bisherige Auswertungen lassen darauf schliessen, dass die Ausgangsfragen klar formuliert werden k&#246;nnen.
</abstract>
        <description></description>
        <persons>
          <person id="30">Hans-J&#246;rg Stark</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="140">
        <start>10:00</start>
        <duration>00:30</duration>
        <room>Gro&#223;er H&#246;rsaal (Geb. 66, E33/34)</room>
        <slug></slug>
        <title>OpenStreetMap und die Wikipedia</title>
        <subtitle></subtitle>
        <track>OSM-Vortr&#228;ge</track>
        <type>lecture</type>
        <language></language>
        <abstract></abstract>
        <description>1.Hauptvortrag (18 Minuten)
1.1.OSM &amp; Wikipedia &#8211; Vorteile f&#252;r vier Seiten (1 Minute)
 a)Aufmerksamkeit f&#252;r OSM
Karten unter offenen Lizenzen f&#252;r alle Artikel der Wikipedia
besser Karten und bessere Artikel f&#252;r Nutzer
einfacherer Zugang zu Infrastruktur und Daten f&#252;r Programmierer
1.2.Planung und Status (3 Minuten)
 a)Wikimedia Deutschland eV sponsort 3 Server
Eigener Render-Stack (entlasten der OSM-Server und anpassen der Karten)
Lokalisierte Karten
statische Karten
Toolserver bereits in Betrieb, Datenbank vorhanden
Produktion im Aufbau, Umbr&#252;che im Gange
1.3.Probleme und L&#246;sungen (2 Minuten)
 a)wir sind keine OSM Server Admins
Lokalisierung gering ausgepr&#228;gt
Import in OSM Datenbank-Format
1.4.Projekte und Projektideen (10 Minuten)
 a)Wenige Projekte, viel Raum f&#252;r neues
SlippyMap f&#252;r Wikipedia
Streetlist / POI-List
L&#228;nder &#220;bersetzen (&#228;lter)
Alpha-Hillshading Overlay (in Arbeit)
Wetterkarte
&#220;berwachen von Objekten und Gebieten -- Twitter / Mail push
Neue Karten-Stile
 i S/W f&#252;r den Laserdrucker u&#228;.
POI Karten mit h&#246;heren Zoomleveln
Autobahnkarte
 b)Statistiken
 i Edits je Einwohner
Edits je Einkommen
Art der ge&#228;nderten Objekte (Stra&#223;en, POIs)
Durchnittsalter verschiedener Objekte
Edits im Ausland (= nicht Heimatland des Mappers)
1.5.Mitmachen (2 Minuten)
 a)Viele Systeme und Sprachen m&#246;glich: PHP, Python, Perl, Java, .Net
Wikimedia Toolserver Account n&#246;tig
Idee f&#252;r ein Projekt &#8594; Toolserver Account wird in wenigen Tagen eingerichtet
Web-Anwendungen oder Kommandozeile

2.Diskussion (7 Minuten)
2.1.Was Fehlt &#8211; auf beiden Seiten
Bin ich die Zielgruppe?
	
3.Reserve Themen (7 Minuten)
3.1.N&#228;chste Schritte
</description>
        <persons>
          <person id="109">MaZderMind</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="105">
        <start>11:00</start>
        <duration>00:30</duration>
        <room>Gro&#223;er H&#246;rsaal (Geb. 66, E33/34)</room>
        <slug></slug>
        <title>Statistische Analysen der Tags in Open Street Map</title>
        <subtitle></subtitle>
        <track>OSM-Vortr&#228;ge</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>In diesem Vortrag wird eine statistische Auswertung des Tagwatch von Open Street Map mit der Software R vorgestellt.</abstract>
        <description>Das Open Street Map (OSM) Projekt erfreut sich eines rasanten Wachstums. Seine Datenbasis bietet der Statistik sehr interessante M&#246;glichkeiten zu Analysen, f&#252;r die die freie Statistik &#8211; Software R aus drei Gr&#252;nden ein geeignetes Tool ist : 
1.R bietet eine Reihe von Methoden zur Analyse von raumbezogenen Daten organsiert in &#8220;Packages&#8221;
2.R ist eine Umgebung zur Implementierung neuer statistischer Methoden.
3.R bietet hervorragende M&#246;glichkeiten, Ergebnisse zu visualisieren.

In diesem Vortrag werden erste Schritte zur Nutzung der Daten in Open Street Map durch R vorgestellt. Der Fokus des Vortrages liegt auf Qualit&#228;tssicherung und Attraktivit&#228;t von OSM aus der Sicht der Nutzer. Die &#8220;technische&#8221; Seite der Qualit&#228;t wird sichergestellt durch eine Reihe von Ma&#223;nahmen und Tools (siehe z.B. TOPF [2009] Creating Quality the OSM Way). Ziel dieses Beitrages ist eine Entscheidungsgrundlage f&#252;r Verbesserungen bzw. Vereinheitlichungen von Tags. 
Es soll dazu eine alternative Auswertung, &#228;hnlich der bestehenden Tagwatch-Auswertung geben, bei der folgende Aspekte ber&#252;cksichtigt werden:
- Popularit&#228;t von Tags (&#8220;Index&#8221;)
- Welche Tags an welchen Datentypen (Node, Way, Relation) vorkommen
- H&#228;ufigkeit von gemeinsam genutzten Tags
- Un&#252;bliche Tag Kombinationen
- Nutzungsverteilung
- Nutzerverhalten
- Unterschiede in der Nutzung von Tags (regional &#8211; zeitlich)
- Trends
...
Weiterhin wird die Performance bei den Auswertungen verglichen.
Die Ergebnisse werden mit geeigneten Grafiken visualisiert. Ziel ist es, die Grafiken &#252;ber eine Homepage der OSM Community zur Verf&#252;gung zu stellen.
</description>
        <persons>
          <person id="53">Rainer Feldmann</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="109">
        <start>11:30</start>
        <duration>00:30</duration>
        <room>Gro&#223;er H&#246;rsaal (Geb. 66, E33/34)</room>
        <slug></slug>
        <title>&#214;PNV-Karte</title>
        <subtitle>&#214;ffentliche Verkehrsmittel in OpenStreetMap</subtitle>
        <track>OSM-Vortr&#228;ge</track>
        <type>lecture</type>
        <language></language>
        <abstract>Der Vortrag beleuchtet die &#214;PNV-Karte. Dabei handelt es sich um eine aus OpenStreetMap-Daten generierte Karte mit dem Schwerpunkt auf &#246;ffentlichen Verkehrsmitteln. Insbesondere Verkehrsrouten und Haltestellen von Bahnen, Bussen und F&#228;hren in ganz Europa werden dargestellt. Anhaltspunkte des Vortrags werden Entstehung, Datenschema in der Openstreetmap Datenbank, Technik auf dem Kartenserver, sowie geplante Entwicklungen und Ideen f&#252;r die Zukunft sein.</abstract>
        <description>Wer kennt das nicht, man reist per Bahn in eine fremde Stadt und braucht dort eine Verbindung vom Hauptbahnhof zum eigentlichen Ziel. H&#228;ufig ist es schwierig vor Reiseantritt diese Strecke zu planen, da jede Stadt ihr eigenes Verkehrssystem und seine eigene Webseite (sofern &#252;berhaupt vorhanden) mit Verkehrsnetzpl&#228;nen hat. Grenz&#252;berschreitende Katen gibt es h&#228;ufig nicht, unter anderem da die gro&#223;en Kartendatenanbieter Navteq und Teleatlas solche Daten nicht im Repertoire haben. 
Die aus OpenStreetMap Daten generierte &#214;PNVKarte betritt dort Neuland und stellt auf einer Karte &#246;ffentliche Verkehrsmittel aus ganz Europa dar. Auch wenn die Webseite momentan noch recht einfach gehalten ist, dient sie der Community als Kontrollwerkzeug und Ansporn, so dass mittlerweile schon eine beachtliche Anzahl von Verkehrsrouten in OpenStreetMap eingetragen sind. 
Der Vortrag stellt die Karte mit Ihrer Darstellung von Haltestellen, Z&#252;gen, Stra&#223;enbahnen, Bussen, F&#228;hren usw. vor. Anhaltspunkte werden die Entstehung der Karte, das Datenschema in der OpenStreetMap Datenbank, die Technik auf dem Kartenserver, sowie geplante Entwicklungen und Ideen f&#252;r die Zukunft sein.</description>
        <persons>
          <person id="77">Melchior Moos</person>
        </persons>
        <links>
          <link href="http://&#246;pnvkarte.de/">&#214;PNV-Karte</link>
        </links>
      </event>
      <event id="143">
        <start>12:00</start>
        <duration>00:30</duration>
        <room>Gro&#223;er H&#246;rsaal (Geb. 66, E33/34)</room>
        <slug></slug>
        <title>Fast Route Planning</title>
        <subtitle>Schnelle Routing-Algorithmen und OpenStreetMap</subtitle>
        <track>OSM-Vortr&#228;ge</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Dieser Vortrag stellt den schnellen Routingalgorithmus Contraction Hierarchies [1] und eine spezielle Implementierung f&#252;r Mobilger&#228;te vor.
Contraction Hierarchies sind die derzeitige Grundlage unserer t&#228;glichen Forschungsarbeit. Das Verfahren ist auf einem Westeurop&#228;ischen Stra&#223;ennetz etwa 20.000 mal schneller als Dikstras klassischer Algorithmus, was bedeutet, dass eine Suchanfrage deutlich schneller als in einer Millisekunde beantwortet werden kann. Wird nur die Distanz und nicht eine Route abgefragt, dann verbrauchen Contraction Hierarchies sogar weniger Speicher f&#252;r die Datenstrukturen als Dijkstras klassischer Algorithmus.
Das Problem der Suche nach k&#252;rzesten Wegen zwischen zwei Punkten wird klassischer Weise mit Dijkstras Algorithmus gel&#246;st. Dieses Verfahren ist seit Jahrzehnten bekannt, funktioniert aber zu langsam f&#252;r gro&#223;e Stra&#223;ennetzwerke, die gro&#223;e L&#228;nder oder ganze Kontinent abdecken. Teilweise wird deshalt sogar darauf verzichten wirklich eine k&#252;rzeste oder schnellste Route zu finden. Die heutige algorithmische Forschung untersucht exakte Algorithmen, die immer optimale Routen berechnen. Diese Verfahren sind nicht nur exakt, sondern auch deutlich schneller als die meisten in der Industrie eingesetzten Verfahren. In unserer Forschung untersuchen wir hierarchische Algorithmen, die eine intensive Vorberechnungsphase verwenden. 

[1] Geisberger et al: Contraction Hierarchies: Faster and Simpler Hierarchical Routing in Road 	Networks, WEA 2008.</abstract>
        <description></description>
        <persons>
          <person id="129">Dennis Luxen</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="153">
        <start>13:30</start>
        <duration>00:30</duration>
        <room>Gro&#223;er H&#246;rsaal (Geb. 66, E33/34)</room>
        <slug></slug>
        <title>OSM-Lightning-Talks</title>
        <subtitle></subtitle>
        <track>OSM-Vortr&#228;ge</track>
        <type>lightning</type>
        <language>de</language>
        <abstract>Lightning-Talks sind Kurzvortr&#228;ge (max. 5 Minuten), in denen ein Thema nur kurz angerissen wird. Wenn Du gerne einen Lightning-Talk &#252;ber Dein Lieblings-Projekt oder sonst irgendwas Nettes im OSM-Umfeld halten willst, dann melde Dich beim Moderator Frederik Ramm (fred@remote.org). Noch sind Slots frei... </abstract>
        <description></description>
        <persons>
          <person id="95">Frederik Ramm</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="22">
        <start>14:00</start>
        <duration>00:30</duration>
        <room>Gro&#223;er H&#246;rsaal (Geb. 66, E33/34)</room>
        <slug></slug>
        <title>Geodatenaufbereitung f&#252;r die Nutzung in Openstreetmap</title>
        <subtitle>Was tun mit Datenspenden</subtitle>
        <track>OSM-Vortr&#228;ge</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Seit einiger Zeit stellt sich im Rahmen des Openstreetmap Projektes des &#246;fteren die Aufgabe Datenspenden zu importieren oder diese (z.B. im Fall von Luftbildern) f&#252;r die Community nutzbar zu machen. Mein Vortrag befasst sich anhand von Beispielen mit der Konvertierung von GIS-&#252;blichen Formaten sowie der Nutzbarmachung von Rasterdaten in den verbreiteten Editoren. Ich m&#246;chte sowohl die verwendeten freien Softwaretools vorstellen als auch Probleme beleuchten, die immer wieder auftreten.</abstract>
        <description></description>
        <persons>
          <person id="26">Sven Geggus</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="139">
        <start>14:30</start>
        <duration>00:30</duration>
        <room>Gro&#223;er H&#246;rsaal (Geb. 66, E33/34)</room>
        <slug></slug>
        <title>Mapnik - mehr als nur 'tiles'</title>
        <subtitle></subtitle>
        <track>OSM-Vortr&#228;ge</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Die Open-Source-Rendering-Software "Mapnik" ist haupts&#228;chlich im OpenStreetMap-Umfeld verbreitet, dar&#252;berhinaus ist sie kaum bekannt. Mapnik ist jedoch durchaus eine allgemeine Rendering-Engine, die unter Zuhilfenahme von Style-Dateien optisch sehr ansprechende Raster- oder sogar Vektorkarten aus verschiedenen Quellen (Raster-, PostGIS-, Shape-Input) erstellen kann. Mapnik ist nicht so m&#228;chtig und flexibel wie der UMN Mapserver oder der Geoserver, aber in dem kleinen Bereich, auf den Mapnik sich spezialisiert hat, braucht es in Puncto Performance und Qualit&#228;t der Ergebnisse den Vergleich nicht zu scheuen.

Dieser Vortrag f&#252;hrt anhand einiger Beispiele in die Nutzung von Mapnik ein. </abstract>
        <description></description>
        <persons>
          <person id="101">Florian Lohoff</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="130">
        <start>15:30</start>
        <duration>00:30</duration>
        <room>Gro&#223;er H&#246;rsaal (Geb. 66, E33/34)</room>
        <slug></slug>
        <title>Aktuelle OSM-Karten im Web</title>
        <subtitle>Aufbau und Betrieb eines kontinuierlich aktualisierten OSM-Tileservers</subtitle>
        <track>OSM-Vortr&#228;ge</track>
        <type>lecture</type>
        <language></language>
        <abstract>OpenStreetMap-Daten werden oft, &#228;hnlich wie Google Maps und andere, in Form vorberechneter Kacheln ("Tiles") f&#252;r die schnelle Anzeige im Web aufbereitet. Der zentrale OpenStreetMap-Tileserver liefert 500 solcher Tiles pro Sekunde aus und bedient damit mehrere hundert simultan aktive Nutzer. Doch "nichts ist &#228;lter als die Geodaten von gestern", sagen OpenStreetMapper gern - diese Tiles m&#252;ssen auch noch im Minutentakt aktualisiert werden...

Dieser Vortrag beschreibt den grunds&#228;tzlichen Aufbau eines OSM-Tileservers und die darin enthaltenen Open Source-Komponenten, vorallem die Programme osm2pgsql zum Bef&#252;llen und Aktualisieren der PostGIS-Datenbank, das Apache-Modul mod_tile zum Ausliefern der Tiles, sowie das Gespann renderd/Mapnik zur Herstellung der Tiles. Verschiedene Strategien zum Daten-Update (inkl. min&#252;tlicher "replication diff"-Updates mit Hilfe von Osmosis) und zum Tile Expiry werden verglichen. 

Der Vortrag nimmt auch eine Abgrenzug zum WMS-Service vor und erl&#228;utert, bei welchen Aufgabenstellungen man eher zu einem WMS-basierten Ansatz greift und bei welchen eher zu einem Tile-Server.
</abstract>
        <description></description>
        <persons>
          <person id="95">Frederik Ramm</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="110">
        <start>16:00</start>
        <duration>00:30</duration>
        <room>Gro&#223;er H&#246;rsaal (Geb. 66, E33/34)</room>
        <slug></slug>
        <title>Karten im Druck</title>
        <subtitle>Das Gestalten und Drucken eigener Karten mit OpenStreetMap Daten</subtitle>
        <track>OSM-Vortr&#228;ge</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Das Rendern eigener Karten mit Standard- oder selbstgestalteten Kartenstilen aus OpenStreetMap-Daten wird immer popul&#228;rer. Neben einer kurzen &#220;bersicht daf&#252;r verwendeter Techniken geht dieser Vortrag auf zwei Schwerpunkte ein. Zum einen soll anhand der vom Vortragenden erstellten Wanderkarte der Gemeinde Gutau in &#214;sterreich ein Beispiel f&#252;r das Vorgehen beim Design und Rendern einer Karte pr&#228;sentiert werden. Zum anderen werden die Besonderheiten und Probleml&#246;sungen speziell f&#252;r den Druck gedachter Karten besprochen.</abstract>
        <description>Um der wachsende Bedeutung von OpenStreetMap-Karten nicht nur durch interaktive Karten im Web gerecht werden zu k&#246;nnen, werden in diesem Vortrag Techniken zum Rendern von Karten und der Aufarbeitung f&#252;r den Druck vorgestellt. Eine kurze &#220;bersicht soll aktuelle M&#246;glichkeiten und deren Grenzen pr&#228;sentieren, um damit Appetit auf die Gestaltung eigener Karten zu machen. Anhand von Erfahrungen bei der Gestaltung einer Wanderkarte mit Hilfe von OpenStreetMap-Daten, Mapnik und dem DTP-Programm Scribus werden Anforderungen an eine gedruckte Karte und Quellen f&#252;r Daten und Designelemente wie Icons und Legende angesprochen. Wesentliche Anforderungen an einen Rendering-Stil, der nicht nur zur Web-Pr&#228;sentation gedacht ist, werden ebenso behandelt, wie die Elemente um die eigene Karte herum: Titel, Meta-Informationen, Ma&#223;stab, Text, usw. Speziell die Aufbereitung f&#252;r eine Druckerei ist das Ziel der Besprechung von Proofs, Farbmanagement, Bleed und Marks.</description>
        <persons>
          <person id="80">Holger Sch&#246;ner</person>
        </persons>
        <links>
          <link href="http://www.ancalime.de/gutau.html">Informationen zur Wanderkarte Gutau</link>
          <link href="http://www.ancalime.de/demo.html">OSM-Karten von Holger Sch&#246;ner</link>
        </links>
      </event>
      <event id="112">
        <start>16:30</start>
        <duration>00:30</duration>
        <room>Gro&#223;er H&#246;rsaal (Geb. 66, E33/34)</room>
        <slug></slug>
        <title>OSM f&#252;r Garmin Ger&#228;te</title>
        <subtitle>Garmin All in One Map</subtitle>
        <track>OSM-Vortr&#228;ge</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Wie kommen die OSM-Daten auf das Garmin Ger&#228;t? Von den OSM-XML Daten zur fertigen Garminkarte.</abstract>
        <description>Durch die Garmin All in One Karte k&#246;nnen viele OSM-Nutzer die fertige Garminkarte t&#228;glich aktuell direkt auf ihr Ger&#228;t laden.
Mehrere Schritte sind zum erzeugen der Karte notwendig. In dem Vortrag sollen in 30min die wesentlichen Vorg&#228;nge angesprochen werden und welche Probleme es dabei gab und noch gibt.
Es wird auf die Verwendung von Typ-files, sowie auf den OSM-zu-Garmin-Konverter mkgmap eingegangen.</description>
        <persons>
          <person id="84">Christoph Wagner</person>
        </persons>
        <links>
          <link href="http://wiki.openstreetmap.org/wiki/DE:All_in_one_Garmin_Map">http://wiki.openstreetmap.org/wiki/DE:All_in_one_Garmin_Map</link>
        </links>
      </event>
      <event id="154">
        <start>17:00</start>
        <duration>00:15</duration>
        <room>Gro&#223;er H&#246;rsaal (Geb. 66, E33/34)</room>
        <slug></slug>
        <title>Abschlu&#223;veranstaltung</title>
        <subtitle></subtitle>
        <track>OSM-Vortr&#228;ge</track>
        <type></type>
        <language>de</language>
        <abstract></abstract>
        <description></description>
        <persons>
          <person id="95">Frederik Ramm</person>
        </persons>
        <links>
        </links>
      </event>
    </room>
    <room name="Kleiner H&#246;rsaal (Geb. 35, E01)">
      <event id="20">
        <start>09:30</start>
        <duration>01:00</duration>
        <room>Kleiner H&#246;rsaal (Geb. 35, E01)</room>
        <slug>openstreetmap_vor_ort</slug>
        <title>OpenStreetMap vor Ort</title>
        <subtitle>Die lokale OSM-Community organisieren</subtitle>
        <track>OSM Community Sessions</track>
        <type>community_session</type>
        <language>de</language>
        <abstract>Die meisten OSM-Treffen und Mappingparties werden vor Ort von einem oder wenigen Mappern organisiert. Ziel dieser Session soll sein, Erfahrungen bei der Organisation auszutauschen und so bestehende Treffs und zuk&#252;nftige Mappingparties zu verbessern. Auch sollen interessierten Mappern von gemachten Erfahrungen profitieren und so erfolgreicher neue Treffs gr&#252;nden und Mappingparties durchf&#252;hren.

Die Session richtet sich an Organisatoren von OSM-Treffen und Mappingparties, die ein Treffen gr&#252;nden und Mappingparties veranstalten wollen.</abstract>
        <description></description>
        <persons>
          <person id="25">Marc Gehling</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="113">
        <start>11:00</start>
        <duration>01:30</duration>
        <room>Kleiner H&#246;rsaal (Geb. 35, E01)</room>
        <slug></slug>
        <title>Projekte auf den Entwickler-Servern</title>
        <subtitle>Info und Koordination der Entwickler-Server von FOSSGIS und Wikipedia</subtitle>
        <track>OSM Community Sessions</track>
        <type>community_session</type>
        <language>de</language>
        <abstract>FOSSGISS/STRATO-Server-Betrieb und Weiterentwicklung: Koordination und Diskussion</abstract>
        <description>Die Firma STRATO stellt dem FOSSGIS e.V. 3 Server f&#252;r das OpenStreetMap-Projekt zur Verf&#252;gung. Im Rahmen dieses Workshops soll diskutiert werden welche Projekte dort in Zukunft laufen sollen und wie bestehende Projekte weiterentwickelt werden sollen. Wichtig ist insbesondere der Versuch, Synergien zwischen den einzelnen Projekten zu finden, um in Zukunft zu vermeiden, dass gleiche Daten in den verschiedensten Formaten vorgehalten werden m&#252;ssen.

Die Session soll die Tools und Anwendungen kurz vorstellen, die auf dem vom Wikimedia-Verein bereitgestellten OSM-Toolserver entstanden sind. Es sollen die Vorraussetzungen und Vorgehensweise beschrieben werden, mit dem Entwickler Zugang zu diesem Server bekommen k&#246;nnen. 

Darauf aufbauend sollen weitere Entwicklungsm&#246;glichkeiten und die M&#246;glichkeiten der Zusammenarbeit zwischen den Projekten OSM und Wikipedia gemeinsam diskutiert werden.
</description>
        <persons>
          <person id="96">Kolossos</person>
          <person id="109">MaZderMind</person>
          <person id="26">Sven Geggus</person>
        </persons>
        <links>
          <link href="http://www.toolserver.org/">Wikimedia Toolserver</link>
          <link href="http://meta.wikimedia.org/wiki/OpenStreetMap/de">OSM und Wikipedia</link>
        </links>
      </event>
      <event id="115">
        <start>13:30</start>
        <duration>01:30</duration>
        <room>Kleiner H&#246;rsaal (Geb. 35, E01)</room>
        <slug></slug>
        <title>Routing und Navigation mit OpenStreetMap</title>
        <subtitle></subtitle>
        <track>OSM Community Sessions</track>
        <type>community_session</type>
        <language>de</language>
        <abstract>Dieser Workshop richtet sich an Interessierte, welche Routing und Navigation auf Basis der OpenStreetMap durchf&#252;hren wollen als auch an Personen welche die Datenqualit&#228;t der OpenStreetMap speziell in Hinblick auf solche Awendungen verstehen oder verbessern wollen. Zun&#228;chst wird eine allgemeine Einf&#252;hrung  in die Datenqualit&#228;t in OSM und damit in wichtige Aspekte in der Auswertung dieser Karte gegeben. Es geht um das Abl&#246;sen alter durch neuere Schemeta, h&#246;chst menschliche Eigenheiten und Fehler als auch um die Qualit&#228;ts-Unterschiede zwischen Regionen. Anschliessend werden bestehende und m&#246;gliche Datenstruktiven auf denen Routing m&#246;glich ist an realen Beispielen besprochen. Ihre Vor- und Nachteile f&#252;r die bei einer konkreten Anwendung abzuw&#228;genden Anforderungen erleutert und nach Kompromissen gesucht. Je nach verf&#252;gbarer Zeit gehen wir anschliessend auf die interessanten Aspekte ein, welche aus einer reinen Routen-Berechnung eine Navigation machen. Auf das rechtzeitige Geben von einfachen Fahranweisungen, Sonderf&#228;lle wie Kreisverkehre und Autobahnkreuze, das Wiedergeben von Beschilderungen, benahmte Ausweichrouten, Umleitungen, Staus und den Umgang mit den allt&#228;glichen Differenzen zum Verhalten des unterst&#252;tzten Fahrers.</abstract>
        <description>* "Allgemeines": Auswertung chaotischer Schemata
** &#252;berholte Tags, unerwartete Werte, menschliche Fehler
** Qualit&#228;tsunterschiede zwischen Regionen
** Verst&#228;ndniss-Differenzen zwischen Mapper-Gruppen

* "Routing wohin?": Strategien zur Adress-Suche in OSM
** "name"-Tag, der Begin jeder Suche
** Strassen und ihre Orte
** Hausnummern und ihre Strassen
** Postleitzahlen

* "Routing womit?": Datenformate f&#252;r routing-f&#228;hige Karten
** grosse GIS-Datenbanken - ihre Vor- und Nachteile
** embedded Datenbanken
** bin&#228;re Dateiformate

je nach verf&#252;gbarer Zeit:
* "On the road again": Navigation und Fahranweisungen
** Was ist "rechts abbiegen"
** Kreisverkehre und Kleebl&#228;tter
** Signposting und Ausweichrouten
** Umleitungen, Staus und verpasste Ausfahren

Ich denke mit der Aufteilung kriegt man genug Gespr&#228;chsans&#228;tze hin. Ich kann &#220;bersichten zum aktuellen Stand in OSM zu jedem der Punkte, ein paar S&#228;tze zu den Problemstellungen sowohl f&#252;r die Community in ihrem Tagging als auch f&#252;r einzelnen Entwickler der Navigieren m&#246;chte und jede Menge Beispielen zusammentragen.</description>
        <persons>
          <person id="95">Frederik Ramm</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="102">
        <start>15:30</start>
        <duration>00:30</duration>
        <room>Kleiner H&#246;rsaal (Geb. 35, E01)</room>
        <slug></slug>
        <title>Der OSM Inspector</title>
        <subtitle></subtitle>
        <track>OSM-Vortr&#228;ge</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Menschen machen Fehler. Das ist &#252;berall so, auch bei OpenStreetMap. Und bei der Unmenge an Daten, die f&#252;r OpenStreetMap erfa&#223;t werden, werden auch viele Fehler gemacht. Ein Vertipper im Stra&#223;ennamen, ein Restaurant an der falschen Stelle eingetragen, eine Buslinie der falschen Stra&#223;e zugeordnet. Und es wird dadurch nicht einfacher, dass OSM nur wenige Regeln vorgibt, welche Daten wie zu erfassen sind. Verschiedene Mapper tragen die gleichen Sachen auf verschiedene Weise ein oder verschiedene Sachen auf die gleiche Art. Und als Kontrolle gibt es haupts&#228;chlich die Karten selbst, die aus OSM-Daten erzeugt werden. Wird dort etwas wie gew&#252;nscht angezeigt, so wird es wohl richtig eingetragen sein.

Der OpenStreetMap Inspector ist ein m&#228;chtiges Tool, das hier helfen soll. Er filtert aus der Menge der OSM-Daten Daten zu verschiedenen Themen heraus und zeigt sie (mehr oder weniger) &#252;bersichtlich an. Dadurch wird es f&#252;r den Mapper ein
facher zu sehen, wie die Daten zu einem bestimmten Thema erfa&#223;t wurden und ob vielleicht Fehler vorliegen. Der OSM Inspector zeichnet quasi Spezialkarten zu einem Thema, deren Ziel ist es nicht h&#252;bsch auszusehen oder einem Nutzer der Da
ten zu helfen, sonderen deren Ziel ist es dem Mapper zu helfen, zu erkennen, welche Daten vorhanden sind und wie sie mit anderen Daten zusammenh&#228;ngen. Viele der Daten, die der OSM Inspector anzeigt, zeigen (potentielle) Probleme, aber e
r liefert auch den Kontext, um die Fehler erkennen, zuordnen und l&#246;sen zu helfen.

Die Geometry-Ansicht (View) zeigt zum Beispiel Ways an, die sich selbst schneiden, das ist fast immer ein Fehler und auf jeden Fall eine Pr&#252;fung wert. In der Tagging-Ansicht finden sich unter Anderem Nodes und Ways mit m&#246;glicherweise falsch geschriebenen Tag-Keys. Aber es gibt auch deutlich komplexere Views, wie die verschiedenen Ansichten zum Thema &#214;PNV (Public Transport), die Schienenwege, Haltestellen, Bus- und U-Bahn-Linien und einiges mehr zeigen. 

In diesem Vortrag wird der OSM Inspector mit allen seinen Features vorgestellt. Wir wagen auch einen Blick hinter die Kulissen und schauen uns an, wie die Daten f&#252;r den Inspector verarbeitet und angezeigt werden. Der Vortrag richtet sich an alle in der OSM Community, die noch weiter zu Verbesserung der Daten beitragen wollen.
</abstract>
        <description></description>
        <persons>
          <person id="2">Jochen Topf</person>
        </persons>
        <links>
          <link href="http://tools.geofabrik.de/osmi/">OSM Inspector</link>
          <link href="http://wiki.openstreetmap.org/wiki/OSM_Inspector">Beschreibung zum OSM Inspector im OSM-Wiki</link>
        </links>
      </event>
      <event id="104">
        <start>16:00</start>
        <duration>01:00</duration>
        <room>Kleiner H&#246;rsaal (Geb. 35, E01)</room>
        <slug></slug>
        <title>Tools zur Qualit&#228;tssicherung</title>
        <subtitle></subtitle>
        <track>OSM Community Sessions</track>
        <type></type>
        <language></language>
        <abstract>Die OSM-Datenbank enth&#228;lt eine Unmenge n&#252;tzlicher Daten, aber auch viele Fehler. In der OSM-Community sind viele Tools entstanden, die helfen, solche Fehler zu finden, darzustellen und ggf. zu beseitigen. Tools wie das JOSM Validator Plugin, OpenStreetBugs, OSM Inspector oder die Arbeiten von Keepright und Gary68 helfen, die Datenqualit&#228;t in OSM zu sichern. Die Tools sind zum gro&#223;en Teil unabh&#228;ngig voneinander entstanden und viel Arbeit wurde doppelt gemacht. In dieser Community Session treffen sich die Entwickler dieser Tools und andere, die an der Weiterentwicklung Interesse haben, wir wollen sehen, wo wir voneinander lernen und wie wir besser zusammenarbeiten k&#246;nnen. Die Entwickler stellen ihre Tools kurz vor, dann wollen wir &#252;ber die verschiedenen Probleme reden, z.B. dem Umgang mit den gro&#223;en Datenmengen, Probleme mit false positives, gegenseitige Nutzung der Tool-Ergebnisse oder vorverarbeiteter Daten usw.

Alle sind aufgefordert mitzumachen. Wenn jemand ein Tool oder ein Thema auf die "Tagesordnung" setzen will, kann er sich im Vorfeld bei Jochen Topf (jochen@remote.org) melden. Aber nat&#252;rlich gibts auch vor Ort noch die M&#246;glichkeit sich spontan einzubringen.</abstract>
        <description></description>
        <persons>
          <person id="2">Jochen Topf</person>
        </persons>
        <links>
          <link href="http://tools.geofabrik.de/osmi/">OSM Inspector</link>
          <link href="http://www.openstreetbugs.org/">OpenStreetBugs</link>
          <link href="http://wiki.openstreetmap.org/wiki/Category:Quality_Assurance">OSM Wiki: Kategorie Quality Assurance</link>
          <link href="http://wiki.openstreetmap.org/wiki/DE:Keep_Right">Keep Right</link>
        </links>
      </event>
    </room>
    <room name="Workshop 1 (Geb. SI, SI0201)">
    </room>
    <room name="Workshop 2 (Geb. SI, SI0202)">
      <event id="156">
        <start>09:00</start>
        <duration>08:00</duration>
        <room>Workshop 2 (Geb. SI, SI0202)</room>
        <slug></slug>
        <title>Mapbender Developer-Sprint</title>
        <subtitle></subtitle>
        <track>Developer-Treffen</track>
        <type></type>
        <language></language>
        <abstract>The fourth day of the FOSSGIS 2010 conference in Osnabr&#252;ck, Germany
(Friday 5th of March) saw a day of Mapbender hacking. A dozen developers
and power users flocked around Mapbender to discuss general issues and
hack a bit. The agenda (link) listed several points we wanted to address
explicitly.</abstract>
        <description>One important question was the next release. The last year has seen
massive refactoring and a lot of new functionality and finally Mapbender
ships with an install script. But a lot of old modules, especially quick &amp;
dirty hacks broke during the refactoring. The more generically focused
developers favor a clear cut and to remove old stuff. The more
user-implementation focused developers favor a slower approach and keeping
the broad set of functionality, even if it means to carry along old stuff.
Many Mapbender installations are long lived and typically host metadata
for hundreds and thousands of services and users who need the web mapping
platform in every day work. This puts a lot of responsibility on the
development group to create stable software and smooth upgrade paths.
Therefore it was decided to release a bug fixed version 2.6.1 next week.

One important goal of latest development has been the leverage of jQuery
and jQuery UI to pimp the Mapbender front end. Adopting jQuery and being
able to include tons of PlugIns make Mapbender look and feel a lot more
up-to-date and addresses the user's desire for sleeker user interfaces.
Another very important improvement that came out of the refactoring
efforts is much cleaner code which will make it a lot easier for new
developers to get into Mapbender.

Therfore it was decided to step up a full version number in summer with
new features and most importantly a clean and well documented API. A full
version step also justifies that some older installations will brake at
some points. This is an invigorating decision as it will allow us to be
cleaner and meaner with old stuff. The new Mapbender API will make
developing much easier and more fun in.

The first release candidate 3.0 will come out after the Bolsena hack
sprint. It will include a thorough integration of OpenLayers, a completely
refactored user interface and potentially even a connection to a metadata
bucket with thousands of OGC services to choose from. But that is another
story.

Have fun.

Read more about the Sprint at:
* http://www.mapbender.org/2010-03-05_Mapbender_Development_Sprint
* Blog: http://www.osgeo.org/node/1009</description>
        <persons>
          <person id="65">Astrid Emde</person>
        </persons>
        <links>
          <link href="http://www.mapbender.org/2010-03-05_Mapbender_Development_Sprint">http://www.mapbender.org/2010-03-05_Mapbender_Development_Sprint</link>
          <link href="http://www.mapbender.org/2010-03-05_Mapbender_Development_Sprint">http://www.mapbender.org/2010-03-05_Mapbender_Development_Sprint</link>
          <link href="http://www.osgeo.org/node/1009">http://www.osgeo.org/node/1009</link>
        </links>
      </event>
    </room>
    <room name="Seminarraum 1 (Geb. 66/E01)">
    </room>
  </day>
</schedule>
