<?xml version="1.0" encoding="UTF-8"?>
<schedule>
  <conference>
    <title>FOSSGIS 2014</title>
    <subtitle>Konferenz f&#252;r freie und Open Source-Software im GIS-Bereich und f&#252;r freie Geodaten</subtitle>
    <venue>Beuth Hochschule f&#252;r Technik</venue>
    <city>Berlin</city>
    <start>2014-03-19</start>
    <end>2014-03-21</end>
    <days>3</days>
    <release>23554006826620</release>
    <day_change>07:00</day_change>
    <timeslot_duration>00:15</timeslot_duration>
  </conference>
  <day date="2014-03-19" end="1" start="1" index="1">
    <room name="Meising-Saal">
      <event guid="none" id="754">
        <date>2014-03-19T13:00:00+01:00</date>
        <start>13:00</start>
        <duration>00:30</duration>
        <room>Meising-Saal</room>
        <slug></slug>
        <title>Er&#246;ffnung</title>
        <subtitle></subtitle>
        <track></track>
        <type></type>
        <language></language>
        <abstract>* Gru&#223;worte Herr Prof. M&#246;ller (Beuth Hochschule)</abstract>
        <description></description>
        <persons>
          <person id="135">Marco Lechner</person>
          <person id="404">Matthias M&#246;ller</person>
        </persons>
        <links>
        </links>
      </event>
      <event guid="none" id="715">
        <date>2014-03-19T13:30:00+01:00</date>
        <start>13:30</start>
        <duration>00:30</duration>
        <room>Meising-Saal</room>
        <slug></slug>
        <title>Quo vadis Open Source?</title>
        <subtitle>Problematische Entwicklungen bei FOSSGIS-Projekten</subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract>Die FOSSGIS-Szene befindet sich heute im Spannungsfeld zwischen traditionellen Leitmotiven und manchmal schwer erf&#252;llbarem kommerziellem Erfolgsanspruch. Dieser Vortrag macht es sich zum Anliegen, einige bedenkliche Entwicklungen in dieser Situation zu thematisieren.</abstract>
        <description>Open-Source-GIS existieren seit rund drei Jahrzehnten und bereichern mit ihren frei verf&#252;gbaren Innovationen unsere Gesellschaft in demselben Ma&#223;e, wie sie es privaten, akademischen und kommerziellen Nutzern erlauben, sich im Umgang mit r&#228;umlicher Information zu emanzipieren.

Allerdings scheint dabei mitunter in Vergessenheit zu geraten, dass "Open Source" mehr als ein Mittel zum Zweck ist. Wenngleich weniger vordergr&#252;ndig als bei der "Freien Software", vertritt auch der Begriff "Open Source" eine gesellschaftliche Idee, die mit den Kommunikationsm&#246;glichkeiten des Internets perfekt harmoniert und dadurch zu einer technologisch-sozialen Erfolgsgschichte geworden ist. Die moderne FOSSGIS-Welt wirkt jedoch zunehmend professionalisiert und gleichzeitig kommerzialisiert, mit allen bekannten, positiven wie negativen Effekten. Nicht immer ist hierbei erkennbar, dass die &#252;bergeordneten Interessen der "Community" ausreichend vertreten werden.

So scheinen die Suche nach langfristig funktionierenden Gesch&#228;ftsmodellen und der Ausbau von "Public Relations" manchmal eine ebenso hohe Priorit&#228;t zu besitzen, wie die Produktion funktionierender Software. Selbst Ausw&#252;chse moderner Wirtschaftsformen, wie die Schaffung von Monopolen auf Kosten von Diversit&#228;t, lassen sich in Ans&#228;tzen erkennen. Dass dies jedoch nicht unbedingt mit tats&#228;chlichem kommerziellem Erfolg einhergeht, zeigt die nach wie vor &#252;berschaubare Zahl langfristig aktiver Desktop-GIS-Projekte und in diesem Bereich t&#228;tiger Programmierer. Die steigenden technologischen Einstiegsh&#252;rden, in Form immer "modernerer", d.h. komplexerer und kurzlebigerer, APIs und Werkzeuge zur Online-Kollaboration, versch&#228;rfen dieses Problem nur noch weiter.

So findet sich die FOSSGIS-Szene heute im Spannungsfeld zwischen traditionellen Leitmotiven und manchmal schwer erf&#252;llbarem kommerziellem Erfolgsanspruch. Dieser Vortrag macht es sich zum Anliegen, einige bedenkliche Entwicklungen in dieser Situation zu thematisieren.</description>
        <persons>
          <person id="418">Benjamin Ducke</person>
        </persons>
        <links>
        </links>
      </event>
      <event guid="none" id="723">
        <date>2014-03-19T14:00:00+01:00</date>
        <start>14:00</start>
        <duration>00:30</duration>
        <room>Meising-Saal</room>
        <slug></slug>
        <title>OSM in Jerusalem</title>
        <subtitle>Geodaten und sozialr&#228;umliche Strukturen</subtitle>
        <track>Vorträge (OSM)</track>
        <type>lecture</type>
        <language></language>
        <abstract></abstract>
        <description>Im laufenden Forschungsprojekt zu &#8222;OpenStreetMap in Israel/Pal&#228;stina&#8220; am Institut f&#252;r Geographie der Universit&#228;t Erlangen-N&#252;rnberg werden politische Dimensionen von Web 2.0-Kartographie in einem spannungsgeladenen sozialen Umfeld untersucht. Die offen zug&#228;ngliche OSM-Datenbank bietet eine neuartige Gelegenheit, Forschungsfragen zur Entstehung und sozialer Pr&#228;gung von Geodaten empirisch zu bearbeiten. Der Vortrag wird einen &#220;berblick zum Projekt geben und erste Ergebnisse pr&#228;sentieren. Am Fallbeispiel von Jerusalem, als extrem fragmentierten und segregierten Sozialraum, sollen gesellschaftliche Strukturierungen der OSM-Datenbank veranschaulicht werden. Anhand geo-statistischer Auswertungen der Daten und Metadaten zu Jerusalem, sowie deren Triangulierung mit statistischen Bev&#246;lkerungsdaten auf Wohnbezirksebene kann gezeigt werden, dass generell s&#228;kular-j&#252;disch bewohnte Gebiete in weitaus h&#246;herem Detailgrad kartiert wurden als ultraorthodox-j&#252;dische und pal&#228;stinensische. Im Anschluss an andere Arbeiten lassen sich die Ergebnisse zur&#252;ckf&#252;hren auf Tendenzen, nach denen sich die Beitragenden bei OSM &#8211; &#228;hnlich wie bei anderen Crowdsourcing-Projekten &#8211; aus einer bestimmten soziodemographischen Gruppe rekrutierten. Hieraus wiederum ergeben sich Fragen nach gesellschaftlicher Repr&#228;sentativit&#228;t, bzw. Marginalisierung, die die scheinbar neutralen und unpolitischen Geodaten &#252;berpr&#228;gen.</description>
        <persons>
          <person id="424">Christian Bittner</person>
        </persons>
        <links>
        </links>
      </event>
      <event guid="none" id="753">
        <date>2014-03-19T14:30:00+01:00</date>
        <start>14:30</start>
        <duration>00:30</duration>
        <room>Meising-Saal</room>
        <slug></slug>
        <title>Lightning Talks</title>
        <subtitle></subtitle>
        <track>Lightning Talks (GIS)</track>
        <type>lightning</type>
        <language>de</language>
        <abstract></abstract>
        <description></description>
        <persons>
          <person id="163">Christian Mayer</person>
          <person id="312">Jan Marsch</person>
          <person id="436">Jon Richter</person>
          <person id="34">Marc Jansen</person>
          <person id="135">Marco Lechner</person>
        </persons>
        <links>
          <link href="https://www.youtube.com/watch?v=zbE0LYOSTHw&amp;list=UUujhdu-f-arhIZNh-2Qgh7Q">Videomitschnitt</link>
          <link href="http://">http://</link>
        </links>
      </event>
    </room>
    <room name="H1">
      <event guid="none" id="760">
        <date>2014-03-19T10:00:00+01:00</date>
        <start>10:00</start>
        <duration>00:45</duration>
        <room>H1</room>
        <slug></slug>
        <title>Was ist Open Source, wie funktioniert das und worauf muss man achten</title>
        <subtitle>Die Organisationen der Open Geo- und GIS-Welt</subtitle>
        <track>Allgemeines</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Open Source hat viele Facetten - und es ranken sich inzwischen ebenso viele Mythen darum. Was davon richtig ist und was nicht stellen wir in einer kurzen Einf&#252;hrung zusammen. Der Vortrag richtet sich an alle, die mit Open Source bisher noch wenig Kontakt hatten und die Grundlagen verstehen m&#246;chten.</abstract>
        <description>Open Source ist auf der einen Seite ein Entwicklungsmodell und auf der anderen ein Lizenzmodell. Zusammen bilden sie eine Kultur offener Entwicklungsgmemeinschaften, die h&#246;chst effektiv arbeiten. Diese Kultur ist um ein Vielfaches effektiver, als propriet&#228;re Modelle es je sein k&#246;nnen. Unter anderem sieht man das an einfachen Beispielen: Das Betriebssystem des Herstellers Apple basiert vollst&#228;ndig auf dem Open Source Unix FreeBSD. Es gibt halt einfach nichts besseres, und es selbst herzustellen w&#228;re unendlich teuer. Sogar der hyper-propriet&#228;re Hersteller Apple hat das eingesehen. 

Der Vortrag stellt die Geschichte der Entwicklung von Open Source vor und geht auf wichtige Grundlagen ein. 

Ziel des FOSSGIS e.V. und der OSGeo ist die F&#246;rderung und Verbreitung freier Geographischer Informationssysteme (GIS) im Sinne Freier Software und Freier Geodaten. Dazu z&#228;hlen auch Erstinformation und Klarstellung von typischen Fehlinformationen &#252;ber Open Source und Freie Software, die sich &#252;ber die Jahre festgesetzt haben. </description>
        <persons>
          <person id="51">Arnulf Christl</person>
          <person id="208">Athina Trakas</person>
        </persons>
        <links>
          <link href="http://www.fossgis.de/wiki/Konferenz_2014/FLOSS_Einf&#252;hrung">Inhalte der Einf&#252;hrung in Open Source</link>
        </links>
      </event>
      <event guid="none" id="761">
        <date>2014-03-19T11:00:00+01:00</date>
        <start>11:00</start>
        <duration>00:45</duration>
        <room>H1</room>
        <slug></slug>
        <title>Bekannte Anwendungen, Bibliotheken und Tools f&#252;r Geo und GIS und Open Street Map</title>
        <subtitle></subtitle>
        <track>Allgemeines</track>
        <type>lecture</type>
        <language>de</language>
        <abstract></abstract>
        <description>In dem Vortrag wird ein kurzer &#220;berblick &#252;ber vorhandene Open Source Bibliotheken und Werkzeuge geliefert. So wird hier der Weg von den Daten bis hin zur Anwendung - im Web - oder als Desktopanwendung aufgezeigt.</description>
        <persons>
          <person id="142">Dominik Helle</person>
          <person id="23">Till Adams</person>
        </persons>
        <links>
        </links>
      </event>
      <event guid="none" id="762">
        <date>2014-03-19T11:45:00+01:00</date>
        <start>11:45</start>
        <duration>00:30</duration>
        <room>H1</room>
        <slug></slug>
        <title>Offene Fragerunde</title>
        <subtitle></subtitle>
        <track>Allgemeines</track>
        <type>lecture</type>
        <language>de</language>
        <abstract></abstract>
        <description>In der offenen Fragerunde gibt es die M&#246;glichkeit alle Fragen zum Thema Open Source und Open Source Software loszuwerden. Zum Beispiel auch wie man mit Open Source Software Geld verdienen kann und wieso Open Source Software eine Alternative zu propriet&#228;rer Software darstellt.</description>
        <persons>
          <person id="51">Arnulf Christl</person>
          <person id="142">Dominik Helle</person>
          <person id="23">Till Adams</person>
        </persons>
        <links>
        </links>
      </event>
      <event guid="none" id="735">
        <date>2014-03-19T15:30:00+01:00</date>
        <start>15:30</start>
        <duration>00:30</duration>
        <room>H1</room>
        <slug></slug>
        <title>Vom Laptop zum Grossrechner: Neues in GRASS GIS 7</title>
        <subtitle></subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract>GRASS GIS 7 bietet neue Module zur Vektornetzwerk-, Voxelanalyse, Zeitreihenspeicherung und -management, dazu ein Animationstool f&#252;r Raster-und Vektorkartenzeitreihen, ein graphisches Bildklassifikationtool, "Map Swiper" zum interaktiven Kartenvergleich nebst verbesserter massiver Datenanalyse.</abstract>
        <description>GRASS GIS (Geographic Ressourcen Analysis Support System) blickt mit nun 30 Jahren auf die l&#228;ngste Entwicklungsgeschichte in der FOSSGIS Community zur&#252;ck. Die stark ansteigende Nachfrage nach robusten und modernen freien Analysewerkzeugen, v.a. im Hinblick auf die heutzutage enormen r&#228;umlichen Datenmengen f&#252;hrte 2008 zum Beginn der GRASS GIS 7 Entwicklung. In Bezug auf GRASS GIS 6.4 wurden inzwischen mehr als 10.000 Verbesserungen vorgenommen.

Die Entwicklercommunity hat eine Reihe von neuen Modulen f&#252;r Vektornetzwerkanalyse, Bildverarbeitung, Voxelanalyse, Zeitreihenspeicherung (Raster, Vektor, Voxel) und eine verbesserte grafische Benutzeroberfl&#228;che integriert (http://trac.osgeo.org/grass/wiki/Grass7/NewFeatures). GRASS GIS 7 bietet eine neue Python Schnittstelle, die auf einfache Weise erm&#246;glicht, neue Anwendungen zu erstellen, die leistungsf&#228;hig und effizient sind. In der Benutzeroberfl&#228;che gibt es nun ein neues Werkzeug f&#252;r die Animation von Raster-und Vektorkartenzeitreihen, einen verbesserten Georektifier, ein neues Werkzeug zur &#252;berwachten Bildklassifikation, einen "map swiper" zum interaktiven Vergleich zweier Karten (z.B. f&#252;r Katastrophen) und ein visuelles Zeitreihenmanagement.

Dar&#252;ber hinaus wurde insbesondere die topologische Vektorbibliothek in Bezug auf die Unterst&#252;tzung von gro&#223;en Dateien verbessert. Des weiteren gibt es eine Reihe von neuen Analysefunktionen und auch im Raster-/Bildbereich die Unterst&#252;tzung f&#252;r massive Datenanalyse. Auch werden nun Projektionen andere Planeten unterst&#252;tzt. Viele Module wurden in Bezug auf Geschwindigkeit signifikant optimiert. Der Vortrag illustriert die interessantesten Neuerungen und zeigt, wie Benutzer auf einfache Weise auf die kommende GRASS GIS 7 Version migrieren k&#246;nnen. Testversionen stehen f&#252;r alle &#252;blichen Betriebssysteme zur Verf&#252;gung (http://grass.osgeo.org/download/software/).</description>
        <persons>
          <person id="262">Markus Neteler</person>
        </persons>
        <links>
          <link href="http://trac.osgeo.org/grass/wiki/Grass7/NewFeatures">List of new features in GRASS GIS 7</link>
        </links>
      </event>
      <event guid="none" id="741">
        <date>2014-03-19T16:00:00+01:00</date>
        <start>16:00</start>
        <duration>00:30</duration>
        <room>H1</room>
        <slug></slug>
        <title>Was gibt es Neues bei gvSIG CE?</title>
        <subtitle></subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract></abstract>
        <description>Nach dem letzten Code Sprint (22.-25.11.2013 in Berlin) hat das Core Developer Team von gvSIG CE ein roadmap bearbeitet f&#252;r die n&#228;chsten Versionen dieses Open Source Desktop GIS Projektes.

In diesem Vortrag werden die neuen Funktionalit&#228;ten der Version 1.0 vorgestellt sowie der aktuelle Stand des Projektes. 
Bei der Entwicklung von gvSIG CE wird darauf Wert gelegt, die bestm&#246;gliche Integration anderer Open Source Software zu gew&#228;hrleisten. GDAL, proj4, SEXTANTE, GRASS GIS, OpenCADTools und NavTable sind einige Beispiele. Ab dem Code Sprint von 2012 in M&#252;nchen wurde das gvtool Projekt gestartet, mit dem man die Integration von geotools weiter entwickeln wird.

gvSIG CE 1.0 wird GDAL 1.10 benutzen, um Raster Daten lesen zu k&#246;nnen u.a. auch  die Formate ECW, JP2 y MrSID. Bei dieser Entwicklung wurden die offiziellen bindings von gvSIG ersetzt durch die von GDAL.
Die java Version von SEXTANTE wird haupts&#228;chlich vom gvSIG CE Team weiter entwickelt. Im M&#228;rz 2013 hat unser Team eine neue Version von SEXTANTE ins Leben gerufen mit einer effizienteren Anbindung an GRASS GIS.

Die  Erweiterung ExtCad, die in der offiziellen Version von gvSIG benutzt wird, wurde durch eine aktuelle und verbesserte Version des Open Source Projektes OpenCadTools ersetzt. Zusammen mit den Entwicklern von OpenCadTools wurde eine bessere Version ins Leben gerufen, mit der sich die Editierm&#246;glichkeiten von gvSIG CE deutlich verbessern.

Das gvSIG CE Team hat verschiedene Ma&#223;nahmen durchgef&#252;hrt mit dem Ziel, die Pflege und den weiteren Aufbau der Software einfacher zu machen. Diese &#196;nderungen sowie die neuen Funktionen, die entwickelt worden sind, w&#252;rden wir gerne bei der kommenden FOSSGIS Konferenz vorstellen.</description>
        <persons>
          <person id="68">Ruth Sch&#246;nbuchner</person>
        </persons>
        <links>
        </links>
      </event>
      <event guid="none" id="667">
        <date>2014-03-19T16:30:00+01:00</date>
        <start>16:30</start>
        <duration>00:30</duration>
        <room>H1</room>
        <slug></slug>
        <title>OpenJUMP - &#220;berblick, Neuigkeiten, Zusammenarbeit/Schnittstellen mit propriet&#228;rer Software</title>
        <subtitle></subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract>OpenJUMP, ein &#220;berblick der Funktionsbereiche, Demos auf unterschiedlicher Hardware und Aktuelles aus der Entwicklung. Wie kann man als Open Source Projekt Schnittstellen zu propriet&#228;rer Software implementieren? L&#246;sung anspruchsvoller Praxisprobleme mit OpenJUMP und weiteren Open Source Werkzeugen.</abstract>
        <description>OpenJUMP ist ein leichtgewichtiges und leicht zu erlernendes Open Source Desktop GIS. Durch seine Plattformunabh&#228;ngkeit l&#228;uft es auf recht unterschiedlich ausgestatteter Hardware.  Der Vortrag wird einen kurzen &#220;berblick &#252;ber die Funktionsbereiche (Erfassung/Bearbeitung, Analyse/Auswertung, Qualit&#228;tskontrolle) geben. &#220;ber Neuigkeiten und Aktuelles aus der Entwicklung wird ebenfalls berichtet.

Der zweite Teil berichtet vom Einsatz im &#246;ffentlichen Sektor. Speziell geht es darum, wie es m&#246;glich ist Open Source Software an propriet&#228;re Systeme anzukoppeln. In der Praxis n&#252;tzt das sch&#246;nste GI System nichts, wenn es nicht mit der Sachdatenanwendung interagieren kann. Leider kann man als Open Source Entwickler kein NDA (Non Disclosure Agreement) unterschreiben, um an die Schnittstellenbeschreibungen zu kommen. Das es dennoch m&#246;glich ist, zeigt ein OpenJUMP Plugin. Es dient zum bidirektionalen Datenaustausch bzw. der Kopplung mit einer, im kommunalen Bereich, weit verbreiteten Software.

Die L&#246;sung komplexer Aufgabenstellungen gelingt mit der geschickten Kombination aus mehreren Open Source GIS Tools. Die Berechnung der Einsatzreichweiten der freiwilligen Feuerwehren im Rahmen der Risiko- und Gef&#228;hrdungsanalyse einer Kommune ist so ein Beispiel. F&#252;r die Erfassung und Bearbeitung diente OpenJUMP. Luftbilder, topographische Karten wurden durch den "GeoServer" als WMS bereit gestellt. Die Datenaufbereitung und das Routing erledigte dann die "PostGIS" Datenbank. Gegen&#252;ber einer einfachen statischen Bufferbildung f&#246;rderte das erstaunliche Ergebnisse zu Tage.</description>
        <persons>
          <person id="389">Matthias Scholz</person>
        </persons>
        <links>
          <link href="http://www.openjump.de/testimonials/index.html">OpenJUMP in der Praxis</link>
          <link href="http://www.openjump.de/plugins/archikart/index.html">Archikart&#174; Kommunikationsplugin</link>
        </links>
      </event>
      <event guid="none" id="742">
        <date>2014-03-19T17:00:00+01:00</date>
        <start>17:00</start>
        <duration>00:30</duration>
        <room>H1</room>
        <slug></slug>
        <title>Neues in QGIS 2.2</title>
        <subtitle></subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract></abstract>
        <description>Nach dem lange erwarteten Release von QGIS 2.0 im September 2013, sind ab diesem Jahr neue Versionen im Viermonatszyklus geplant. Es werden die neuen Funktionen in QGIS 2.2, wie z.B. DB-Relationen mit verschachtelten Formularen, die erweiterten Methoden zur Transformierung geographischer Koordinatensysteme, zahlreiche Verbesserungen im Print Composer und ein komplett &#252;berarbeiteter DXF Export vorgestellt. Zus&#228;tzlich wird eine Vorschau auf das multithreaded Rendering gegeben und die neuen Mitglieder im Project Steering Committee vorgestellt.
Kopr&#228;sentator: Marco Hugentobler, Technischer Leiter QGIS PSC.</description>
        <persons>
          <person id="99">Pirmin Kalberer</person>
        </persons>
        <links>
          <link href="http://qgis.org/">http://qgis.org/</link>
          <link href="http://changelog.linfiniti.com/qgis/version/21/">http://changelog.linfiniti.com/qgis/version/21/</link>
        </links>
      </event>
    </room>
    <room name="H2">
      <event guid="none" id="720">
        <date>2014-03-19T15:30:00+01:00</date>
        <start>15:30</start>
        <duration>00:30</duration>
        <room>H2</room>
        <slug></slug>
        <title>Virtuelle Integration von Datenquellen mit einer Graph-Datenbank</title>
        <subtitle>Prof. Dr. Petra Sauer, Dipl. Inf. Frank Herrmann, B.Sc. Jan Matusewicz</subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract></abstract>
        <description>Virtuelle Integration von Datenquellen mit einer Graph-Datenbank
Prof. Dr. Petra Sauer, Dipl. Inf. Frank Herrmann, B.Sc. Jan Matusewicz

Das gemeinsame Forschungsprojekt ArcoFaMa der Beuth Hochschule f&#252;r Technik Berlin und der Hochschule f&#252;r Technik und Wirtschaft Berlin schl&#228;gt einen Bogen &#252;ber die Fachgebiete Datenbanksysteme, Geoinformation und Facility Management (FM). Zielstellung ist die Entwicklung einer Integrationsplattform f&#252;r heterogene Datenquellen und -formate und deren Nutzung zur Integration von Datenbest&#228;nden des Projektpartners Botanischer Garten Berlin-Dahlem. Insbesondere Geodaten und FM-Fachdaten, die im operativen Einsatz &#252;blicherweise in propriet&#228;ren Datenhaltungssystemen getrennt behandelt werden, sollen integriert werden. Die Geodaten werden aus Vermessungsdaten des Au&#223;engel&#228;ndes des Botanischen Gartens Berlin-Dahlem abgeleitet. Dazu werden die Vermessungsdaten in verschiedenen Arbeitsschritten extrahiert und semantisch angereichert, georeferenziert und in das CityGML-Format transformiert. &#220;ber die Integrationsplattform werden diese Daten u.a. mit Daten aus dem Facility Management verkn&#252;pft, die im IFC-Standard vorliegen. Die Integrationsplattform benutzt eine Graph-Datenbank als Metadatenspeicher. Durch das Knoten-Kanten-Datenmodell der Graph-Datenbank k&#246;nnen sehr effizient vernetzte Strukturen abgebildet werden. Dies wird im Projekt f&#252;r die virtuelle Integration der autonomen Datenquellen eingesetzt. 
Der Beitrag wird &#252;ber den gew&#228;hlten Ansatz zur Entwicklung der Integrationsplattform sowie die Besonderheiten des Datenmodells und die Transformationsschritte berichten sowie einen Einblick in das interdisziplin&#228;re Forschungsprojekt geben.
</description>
        <persons>
          <person id="421">Petra Sauer</person>
        </persons>
        <links>
        </links>
      </event>
      <event guid="none" id="642">
        <date>2014-03-19T16:00:00+01:00</date>
        <start>16:00</start>
        <duration>00:30</duration>
        <room>H2</room>
        <slug></slug>
        <title>GeoCouch</title>
        <subtitle>: Eine Erweiterung f&#252;r Apache CouchDB und Couchbase auch f&#252;r mobile Ger&#228;te</subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract></abstract>
        <description>Bei Apache CouchDB und Couchbase handelt es sich um sogenannte dokumentbasierte Datenbanken. Sie geh&#246;rten somit in die Kategorie der nicht-relationale Datenbanksysteme f&#252;r die sich der Sammelbegriff &#8222;NoSQL&#8220; eingeb&#252;rgert hat.

Eine St&#228;rke von Apache CouchDB ist die (Multi-Master) Datenreplikation. Das bedeutet dass der Datenbestand verschiedener Datenbankinstanzen synchron gehalten werden kann, und dennoch &#196;nderungen an beliebiger Stelle vorgenommen werden k&#246;nnen.

Die Replikation beschr&#228;nkt sich nicht nur auf Apache CouchDB, sondern mittlerweile auf ein gesamtes &#214;kosystem. So ist es m&#246;glich Daten mittels HTML5-Technologie mit einem Browser zu synchronisieren. Diese stehen dem Anwender somit auch offline zur Verf&#252;gung, ohne dass eine Verbindung zu einem Server bestehen muss.

Couchbase hingegen hat seine St&#228;rke bei der Skalierung des Systems. So werden die Daten automatisch auf mehrere Rechner verteilt. Das nachtr&#228;gliche Hinzuf&#252;gen oder Entfernen von Rechnern ist &#252;ber eine Web-Oberfl&#228;che sehr leicht m&#246;glich. Im Falle des Ausfalls eines Rechners l&#228;uft das System ohne Unterbrechung weiter.

Couchbase bietet zudem Couchbase Lite an, dass eine Datenbank f&#252;r Mobile Ger&#228;te darstellt. Dabei wird das Replikationsprotokoll von Apache CouchDB sowohl f&#252;r Android als auch iOS implementiert. Somit ist es m&#246;glich Applikationen zu schreiben, die auch ohne st&#228;ndige Internetverbindung funktionieren.

GeoCouch bietet sowohl f&#252;r Apache CouchDB als auch Couchbase eine L&#246;sung um n-dimensionale Anfragen machen zu k&#246;nnen. Es ist also nicht nur m&#246;glich r&#228;umlich Anfragen zu stellen, sondern weitere Eigenschaften wie z.B. Zeit, Gr&#246;&#223;en oder beliebige andere numerische Werte mit einzubeziehen.

In diesem Vortrag wird per Live-Coding gezeigt, wie leicht es ist eine Mobile Applikation zu Entwickeln, die die oben beschriebenen Technologien verwendet.

Apache CouchDB, Couchbase, Couchbase Lite und GeoCouch sind Open-Source und stehen unter der Apache License Version 2.0.
</description>
        <persons>
          <person id="33">Volker Mische</person>
        </persons>
        <links>
        </links>
      </event>
      <event guid="none" id="745">
        <date>2014-03-19T16:30:00+01:00</date>
        <start>16:30</start>
        <duration>00:30</duration>
        <room>H2</room>
        <slug></slug>
        <title>Deegree: AIXM WFS und WPS Services - GML Anwendungen im Aviation Bereich</title>
        <subtitle></subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract></abstract>
        <description>Markus Schneider (schneider@m-click.aero)

Deegree: AIXM WFS und WPS Services - GML Anwendungen im Aviation Bereich

Um einen sicheren und geordneten Ablauf des Flugverkehrs zu gew&#228;hrleisten, 
sind verl&#228;ssliche Informationen zu den aktuellen Verkehrsbedingungen f&#252;r 
alle Beteiligten, wie z.B. Piloten und Fluglotsen, von entscheidener Bedeutung. 
F&#252;r die Bereitstellung der aktuellen Informationen bez&#252;glich Luftraumstruktur, 
Flugpl&#228;tzen, Flugrouten und Flugsicherungsverfahren wird AIXM 5.1, der Standard 
f&#252;r den weltweiten Austausch von aeronautischen Informationen, eingesetzt. 
Dieser Standard wurde gemeinsam von der FAA und EUROCONTROL in Form eines 
Applikation Schemas auf Basis von GML entwickelt (www.aixm.aero).

Die &#220;bertragung der AIXM Messages kann &#228;hnlich wie bei den INSPIRE
Download Services &#252;ber das OGC WFS 2.0 Protokoll abgewickelt werden. Die
Anforderungen an das GML Framework sind jedoch ungleich h&#246;her. Neben den
komplexen Geometrie Objekten stellt insbesondere das AIXM Temporality
Model, in dem die zeitliche Komponente der aeronautischen Information
beschrieben wird, eine Herausforderung dar.

In dem Vortrag wird gezeigt, wie eine erfolgreiche Umsetzung von AIXM
WFS Services mit dem deegree Framework gelungen ist und wie sich mit
der leistungsf&#228;higen GML API die Verarbeitung von AIXM Daten problemlos
gestaltet. Am Beispiel eines Spatial Processing Services und eines AIXM
Business Rules Validators werden die professionellen Einsatzm&#246;glichkeiten 
von AIXM Web Processing Services (WPS) mit dem deegree Framework demonstriert.</description>
        <persons>
          <person id="439">Markus Schneider</person>
        </persons>
        <links>
        </links>
      </event>
      <event guid="none" id="712">
        <date>2014-03-19T17:00:00+01:00</date>
        <start>17:00</start>
        <duration>00:30</duration>
        <room>H2</room>
        <slug></slug>
        <title>Geo mit Python</title>
        <subtitle>Wenn die Schlange die Welt prozessiert</subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract></abstract>
        <description>In vielen Bereichen hat sich Python als Allzweck-Programmiersprache etabliert &#8211; dies gilt auch f&#252;r den Geo-Bereich.
Von der Plugin Entwicklung, &#252;ber automatisiertes Geoprocessing bis zu eigenst&#228;ndigen GIS Anwendungen ist f&#252;r viele Entwickler Python das Tool der Wahl.

Hierf&#252;r ist neben der Effizienz der Sprache sicherlich auch die gro&#223;e Auswahl an bestehenden Geo-Komponenten verantwortlich. Durch die einfache Integrierbarkeit von C und C++ Bibliotheken hat der Entwickler zudem Zugriff auf bew&#228;hrte Komponenten wie GEOS, GDAL/OGR und Proj4.

Der Vortrag zeigt auf, was Python als Programmiersprache attraktiv macht und wie es einem im Arbeitsalltag mit Geodaten das Leben einfacher machen kann.
Es werden eine Vielzahl an Tools und Bibliotheken vorgestellt die mit Python verwendet, oder durch Python erweitert werden k&#246;nnen.
An kurzen Beispielen wird aufgezeigt, wie mit Python z.B. Geodaten aus einem Shapefile geladen, in Python verarbeitet und anschlie&#223;end in eine PostGIS Datenbank importiert werden k&#246;nnen.

</description>
        <persons>
          <person id="153">Oliver Tonnhofer</person>
        </persons>
        <links>
        </links>
      </event>
    </room>
    <room name="H3">
      <event guid="none" id="748">
        <date>2014-03-19T15:30:00+01:00</date>
        <start>15:30</start>
        <duration>00:30</duration>
        <room>H3</room>
        <slug></slug>
        <title>3D Visualisierung von OpenStreetMap Daten mit OpenWebGlobe</title>
        <subtitle></subtitle>
        <track>Vorträge (OSM)</track>
        <type>lecture</type>
        <language></language>
        <abstract></abstract>
        <description>Existierende Virtuelle Globen basieren auf gigantischen Geodatenmengen und erlauben die Integration eigener Inhalte, wie beispielsweise von 3D-Geb&#228;udemodellen. Die Erweiterbarkeit dieser propriet&#228;ren Software um eigene Geobasisdaten (z.B. verbesserte, hoch detaillierte H&#246;henmodelle) oder um eigene Funktionalit&#228;t ist jedoch sehr eingeschr&#228;nkt. Der quelloffene OpenWebGlobe (www.openwebglobe.org) erm&#246;glicht die Realisierung massgeschneiderter, leistungsf&#228;higer Virtueller Globen mit lokalen bis globalen Geodatens&#228;tzen und eigener Funktionalit&#228;t. Der OpenWebGlobe Viewer basiert auf den neuen Web-Technologien HTML5 und WebGL ist daher in den meisten modernen Web-Browsern ohne vorg&#228;ngige Installation eines Plugins lauff&#228;hig.
Mithilfe von OpenWebGlobe wird eine Echtzeit 3D-Repr&#228;sentation von OpenStreetMap Daten auf einem Virtuellen Globus realisiert. Dabei wird direkt mit OSM Daten in der Postgres Datenbank gearbeitet. Die Resultate werden &#252;ber 3D-Geometrie Tiles in einem JSON Format zur&#252;ckgegeben. Dabei werden level of detail und caching-Strategien eingesetzt. </description>
        <persons>
          <person id="434">Martin Christen</person>
        </persons>
        <links>
          <link href="http://www.openwebglobe.org">http://www.openwebglobe.org</link>
        </links>
      </event>
      <event guid="none" id="659">
        <date>2014-03-19T16:00:00+01:00</date>
        <start>16:00</start>
        <duration>00:30</duration>
        <room>H3</room>
        <slug></slug>
        <title>Neues von OSM2World</title>
        <subtitle></subtitle>
        <track>Vorträge (OSM)</track>
        <type>lecture</type>
        <language></language>
        <abstract>Der Gr&#252;nder des Open-Source-Projekts OSM2World erz&#228;hlt, was sich bei der freien 3D-Renderingsoftware f&#252;r OpenStreetMap-Daten in letzter Zeit getan hat und wo die Reise hingeht.</abstract>
        <description>Die freie 3D-Renderingsoftware OSM2World bietet ihren Anwendern nun schon seit &#252;ber 3 Jahren die M&#246;glichkeit, die OpenStreetMap-Daten in einer ansprechenden dreidimensionalen Darstellung aufzubereiten. Allerdings haben sich sowohl das Projekt OpenStreetMap als auch die verf&#252;gbaren Technologien inzwischen weiterentwickelt. Immer detailreichere Daten wollen visualisiert werden, und neue Trends wie WebGL &#8211; eine M&#246;glichkeit zur Hardwarebeschleunigten Darstellung dreidimensionaler Inhalte im Webbrowser &#8211; bieten neue Chancen, aber auch Herausforderungen. Gleichzeitig l&#228;sst das Thema 3D in OpenStreetMap allm&#228;hlich seinen Nischendasein hinter sich und neue Anwendungsfelder entstehen. Wegen des steigenden Interesses steigen mittlerweile auch kommerzielle Anbieter mit propriet&#228;rer Software in das Themenfeld ein.

Dieser Vortrag erz&#228;hlt, wie OSM2World auf diese Entwicklungen reagiert. Der Besucher erf&#228;hrt, was sich bei OSM2World im letzten Jahr getan hat, aber auch was die Zukunft bringen wird.</description>
        <persons>
          <person id="144">Tobias Knerr</person>
        </persons>
        <links>
          <link href="http://osm2world.org/">http://osm2world.org/</link>
          <link href="http://wiki.openstreetmap.org/wiki/OSM2World">http://wiki.openstreetmap.org/wiki/OSM2World</link>
        </links>
      </event>
      <event guid="none" id="686">
        <date>2014-03-19T16:30:00+01:00</date>
        <start>16:30</start>
        <duration>00:30</duration>
        <room>H3</room>
        <slug></slug>
        <title>OSM Buildings</title>
        <subtitle>OpenStreetMaps Geb&#228;udevisualisierung mit JavaScript</subtitle>
        <track>Vorträge (OSM)</track>
        <type>lecture</type>
        <language></language>
        <abstract></abstract>
        <description>OpenStreetMaps Geb&#228;udevisualisierung mit JavaScript

Siehe angeh&#228;ngtes Dokument.</description>
        <persons>
          <person id="312">Jan Marsch</person>
        </persons>
        <links>
          <link href="http://osmbuildings.org">Project Website</link>
          <link href="https://www.xing.com/profiles/Jan_Marsch">Author's Profile</link>
        </links>
      </event>
      <event guid="none" id="641">
        <date>2014-03-19T17:00:00+01:00</date>
        <start>17:00</start>
        <duration>00:30</duration>
        <room>H3</room>
        <slug></slug>
        <title>Blender-basierte Erstellung von 3D-Modellen von Orten mit Hilfe von OSM-Daten</title>
        <subtitle></subtitle>
        <track>Vorträge (OSM)</track>
        <type>lecture</type>
        <language></language>
        <abstract>Im Vortrag wird diskutiert, wie man 3D-Modelle von Orten mit Hilfe von OpenStreetMap-Daten und Blender Open Source Software erstellen kann. Als Beispiel wird die Erstellung von 2.5D Karten betrachtet.</abstract>
        <description>Es gibt einige Projekte mit dem Ziel Geb&#228;ude, Wege und andere Objekte aus dem OpenStreetMap-Datenbank parametrisch in 3D darzustellen. Selbstverst&#228;ndlich solchem Vorgehen fehlt realistisches Aussehen. Ziel dieses Projekts ist nach realistischem Aussehen von Orten zu streben. Daf&#252;r werden manuell erstellte 3D-Modelle von Geb&#228;uden und anderen Objekten verwendet. Sowohl f&#252;r 3D-Modellierung als auch f&#252;r Rendering wird ein Open Source Programm Blender verwendet. Komplexe Berechnungen in 3D werden auch mit Hilfe von Blender durchgef&#252;hrt.

OpenStreetMap Daten werden ins Blender importiert um Georeferenzierung von jedem manuell erstellten 3D Geb&#228;ude durchzuf&#252;hren. Ein 3D Modell wird durch Ziehen und Drehen &#252;ber der importierten OSM-Karte an der richtigen Stelle platziert. Die entsprechenden geographischen Koordinaten und das Drehwinkel werden in einer Datenbank gespeichert. Somit entsteht das 3D-Modell des ganzen Ortes, das man in verschiedener Art und Weise anwenden kann. 

Als Beispiel dieses Ansatzes werden 2.5D Karten betrachtet. Unter der 2.5D Karte versteht man eine ganz herk&#246;mmliche Karte in Web Mercator-Projektion mit einer Oberfl&#228;che aus einzelnen 3D Geb&#228;uden, die in Schr&#228;gprojektion vertikal nach unten dargestellt sind.

Eine Diskussionsfrage ist, ob man eine Datenbank von 3D-Geb&#228;udemodellen mit einer offenen Lizenz braucht.</description>
        <persons>
          <person id="249">Vladimir Elistratov</person>
        </persons>
        <links>
        </links>
      </event>
    </room>
    <room name="H4">
      <event guid="none" id="757">
        <date>2014-03-19T17:30:00+01:00</date>
        <start>17:30</start>
        <duration>02:00</duration>
        <room>H4</room>
        <slug></slug>
        <title>Mapbender Anwendertreffen</title>
        <subtitle></subtitle>
        <track>Anwendertreffen</track>
        <type>user_meeting</type>
        <language></language>
        <abstract>Zu diesem Treffen sind Anwender und Entwickler von Mapbender eingeladen. 

Auf dem Treffen kann der aktuelle Stand von Mapbender3 vorgestellt werden. Au&#223;erdem k&#246;nnen zuk&#252;nftige Entwicklungen diskutiert werden.

Alle Interessierten sind herzlich eingeladen.</abstract>
        <description></description>
        <persons>
          <person id="65">Astrid Emde</person>
          <person id="70">Olaf Knopp</person>
        </persons>
        <links>
          <link href="http://mapbender3.org">http://mapbender3.org</link>
        </links>
      </event>
    </room>
    <room name="WS 429">
      <event guid="none" id="645">
        <date>2014-03-19T15:30:00+01:00</date>
        <start>15:30</start>
        <duration>01:30</duration>
        <room>WS 429</room>
        <slug></slug>
        <title>Entwicklung von Quantum GIS Plugins auf der Basis von PyQT und PyQGIS</title>
        <subtitle></subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language></language>
        <abstract></abstract>
        <description>Mit dem Schreiben von Python-Plugins oder Python-Applikationen er&#246;ffnen sich m&#228;chtige M&#246;glichkeiten, um QGIS zur L&#246;sung eigener Fragestellungen zu erweitern oder Komponenten von QGIS in eigenen Applikationen zu verwenden. Die Teilnehmer kennen nach dem Workshop den Einstieg in die QGIS Plugin-Entwicklung mit Python und PyQGIS</description>
        <persons>
          <person id="13">Horst D&#252;ster</person>
        </persons>
        <links>
        </links>
      </event>
      <event guid="none" id="765">
        <date>2014-03-19T17:00:00+01:00</date>
        <start>17:00</start>
        <duration>00:45</duration>
        <room>WS 429</room>
        <slug></slug>
        <title>OpenStreetMap Freelancer </title>
        <subtitle></subtitle>
        <track>Allgemeines</track>
        <type></type>
        <language></language>
        <abstract>Im Umfeld von OpenStreetMap gibt es immer wieder interessante und herausfordernde Aufgaben. Egal ob man selbst etwas mit oder f&#252;r OpenStreetMap machen m&#246;chte oder ob man einen zuverl&#228;ssigen Auftragnehmer sucht. Dieses Treffen steht jedem offen und dient dem Kennenlernen. </abstract>
        <description>Die Idee ist es eine Vorstellungsrunde zu machen, bei der Kontaktdaten ausgetauscht werden. Zeit um konkrete Projekte zu besprechen steht im Rahmen dieses Treffens nicht zur Verf&#252;gung. </description>
        <persons>
          <person id="2">Jochen Topf</person>
          <person id="8">Lars Lingner</person>
        </persons>
        <links>
        </links>
      </event>
    </room>
    <room name="WS 438">
      <event guid="none" id="633">
        <date>2014-03-19T15:30:00+01:00</date>
        <start>15:30</start>
        <duration>01:30</duration>
        <room>WS 438</room>
        <slug></slug>
        <title>GRASS Workshop</title>
        <subtitle>Ein praktischer Einstieg.</subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language></language>
        <abstract></abstract>
        <description>Der Workshop gibt einen &#220;berblick &#252;ber die umfangreichen Funktionalit&#228;ten von GRASS GIS und vermittelt anhand eines praktischen Workflows, wie man auf einfache Art und Weise eine Arbeitsumgebung erstellt, Analysen durchf&#252;hrt und eine ansprechende Karte erzeugt.

Das Programm:

* &#220;berblick zu den GRASS Funktionalit&#228;ten
* Wie arbeitet man am effektivsten mit der Software
* Wie erstellt man eine Arbeitsumgebung
* Einfache Analysebeispiele f&#252;r Raster- und Vektordaten
* Erstellen einer druckfertigen Karte

</description>
        <persons>
          <person id="9">Otto Dassau</person>
        </persons>
        <links>
        </links>
      </event>
    </room>
    <room name="WS 439">
      <event guid="none" id="699">
        <date>2014-03-19T15:30:00+01:00</date>
        <start>15:30</start>
        <duration>01:30</duration>
        <room>WS 439</room>
        <slug></slug>
        <title>Einf&#252;hrungsworkshop OpenLayers 3</title>
        <subtitle>Erste Schritte mit OpenLayers 3</subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language></language>
        <abstract></abstract>
        <description>Workshopleitung: Marc Jansen, Daniel Koch (beide terrestris) &amp; Andreas Hocevar (Boundless)

Bereits seit einiger Zeit wird von der OpenLayers-Entwicklergemeinde an OpenLayers 3 (dem Nachfolger zum weitverbreiteten OpenLayers 2) gearbeitet. Zum Zeitpunkt der Einreichung des Abstracts ist die aktuellste Version 3.0.0.beta.1. Umsteiger der Version 2 m&#252;ssen sich in OpenLayers 3 an eine im Grunde vollkommen andere API (Programmierschittstelle) gew&#246;hnen. Der Workshop wird hierbei helfen, zentrale Konzepte zu verstehen und ein Gef&#252;hl f&#252;r die Bibliothek zu bekommen. Nat&#252;rlich sind auch Teilnehmer ohne Vorenntnisse in OpenLayers herzlich willkommen.

Im Workshop, der von zwei Kernentwicklern des Projektes gehalten wird (unterst&#252;tzt vom langj&#228;hrigen WebGIS-Veteran D. Koch), werden die Teilnehmer selbst mit OpenLayers 3 (auch genannt ol3) entwickeln. Im Einzelnen werden wir uns folgende Aspekte erarbeiten:

* Download der Bibliothek
* Meine erste ol3-Karte
* Map, View, Source und Layer
* Layer aus unterschiedlichen Datenquellen
* Controls und Interaktionen
* Integration mit JavaScript UI Libraries

Zielgruppe sind alle an Webkartographie interessierten, die OpenLayers 3 kennen lernen wollen. Auch Teilnehmer, die OpenLayers bereits einsetzen, k&#246;nnen von einem Besuch profitieren. Wenn Sie absch&#228;tzen m&#246;chten, ob OpenLayers Ihnen bei Ihrer Fragestellung helfen kann, kann der Workshop sicherlich erste Antworten liefern.

Vorwissen: Grunds&#228;tzliche Kenntnisse von JavaScript sind n&#252;tzlich, werden aber nicht zwingend vorausgesetzt.</description>
        <persons>
          <person id="173">Andreas Hocevar</person>
          <person id="34">Marc Jansen</person>
        </persons>
        <links>
          <link href="http://ol3js.org">Webseite OpenLayers 3</link>
        </links>
      </event>
    </room>
    <room name="Beuthhalle">
      <event guid="none" id="763">
        <date>2014-03-19T18:00:00+01:00</date>
        <start>18:00</start>
        <duration>05:00</duration>
        <room>Beuthhalle</room>
        <slug></slug>
        <title>Abendveranstaltung</title>
        <subtitle></subtitle>
        <track>Allgemeines</track>
        <type>other</type>
        <language>de</language>
        <abstract>Abendveranstaltung in der Beuthhalle auf dem Hochschulgel&#228;nde</abstract>
        <description>Offizieller Social Event - geselliges Beisammensein in der Beuthhalle auf dem Hochschulgel&#228;nde.

Das Catering wird von der Stullenwerkstatt Berlin bereit gestellt. Der Abend wird von Christian Friedl mit Piano und Saxofon musikalisch untermalt.</description>
        <persons>
          <person id="135">Marco Lechner</person>
        </persons>
        <links>
          <link href="http://www.fossgis.de/konferenz/2014/socialevents/">Information zu den Social Events</link>
        </links>
      </event>
    </room>
  </day>
  <day date="2014-03-20" end="2" start="2" index="2">
    <room name="Meising-Saal">
    </room>
    <room name="H1">
      <event guid="none" id="650">
        <date>2014-03-20T09:00:00+01:00</date>
        <start>09:00</start>
        <duration>00:30</duration>
        <room>H1</room>
        <slug></slug>
        <title>Neues aus dem 52&#176;North WPS Projekt</title>
        <subtitle></subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract>Ein &#220;berblick &#252;ber die vergangenen und aktuellen Entwicklungen im 52&#176;North WPS Projekt.
Inklusive Ausblick auf die Compliance Tests f&#252;r WPS 1.0.0 und die Version 2.0 des WPS Standards.</abstract>
        <description>In diesem Vortrag werden wir die vergangenen und aktuellen Entwicklungen im WPS Projekt zu beleuchten. 
Diese umfassen unter anderem:

* Neue Clients,
* Den Umzug auf Github,
* Die neue Administrations-Anwendung f&#252;r den WPS,
* Java Annotations zur einfachen Erstellung von neuen Prozessen,
* Verbesserungen im Bereich WPS4R,
* Ergebnisse aus (Forschungs-)Projekten.

Auch werden wir auf das Thema Testing im WPS eingehen, insbesondere auf die OGC Compliance Tests f&#252;r WPS 1.0.0, deren Fertigstellung f&#252;r Anfang 2014 geplant ist.
Wir werden einen Ausblick auf die Roadmap 2014 des WPS Projekts geben, die neue Funktionen und Verbesserungen am vorhandenen WPS vorsieht. 
Dar&#252;ber hinaus ist 2014 eine neue Entwicklungslinie geplant, die auf der WPS 2.0 Spezifikation aufbauen soll. Diese wird voraussichtlich mitte des Jahres 2014 fertiggestellt.
Einige neue Funktionen und Konzepte der neuen Entwicklungslinie werden wir pr&#228;sentieren.
Schlie&#223;lich werden wir die Gelegenheit nutzen und das aktuelle Entwicklungsteam des 52&#176;North WPS vorstellen.</description>
        <persons>
          <person id="391">Benjamin Pross</person>
        </persons>
        <links>
        </links>
      </event>
      <event guid="none" id="716">
        <date>2014-03-20T09:30:00+01:00</date>
        <start>09:30</start>
        <duration>00:30</duration>
        <room>H1</room>
        <slug></slug>
        <title>GeoKettle &#8211; FME f&#252;r Geizige?</title>
        <subtitle>Geodatenmanagement und -harmonisierung mit GeoKettle bei der Werraenergie</subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract></abstract>
        <description>GeoKettle
GeoKettle ist ein ETL-Programm f&#252;r r&#228;umliche Daten. ETL steht f&#252;r Extract, Load und Transform. GeoKettle basiert auf der OpenSource Software Pentaho Data Integration (Kettle) und ist mit der LPGL lizensiert. GeoKettle unterst&#252;tzt dabei u.a. die OpenSource Bibliotheken GeoTools, Degree und gdal/oge und sextante. 
Ausgangslage
Bei der Werraenergie, einem Energiedienstleister in Th&#252;ringen, stand aufgrund eines Systemwechsels im Bereich des CAD auch ein Umzug der Geodaten von einer Oracle-Datenbank in eine PostgreSQL Datenbank mit PostGIS an. Die Daten der Werraenergie lagen in einem nicht dokumentierten Datenmodell vor und konnten nur mit einem CAD als Shapedateien exportiert werden. Nach dem Export lagen 247 verschiedene Shapefiles vor. Das Versorgungsgebiet der Werraenergie ist allerdings so gro&#223;, dass der Export nur in 40 sich zum Teil &#252;berlagernden r&#228;umlichen Einheiten durchgef&#252;hrt werden konnte, was in insgesamt 11.000 Shapefiles resultierte. Die Inhalte der Shapedateien ware zudem nicht eindeutig,  sodass in einem Shapefile f&#252;r Leitungen, sowohl die Leitungen mit Ihren Attributen als auch Hilfslinien f&#252;r die Beschriftungen mit den gleichen Attributen beinhalten konnten.

GeoKettle in action
Beim Import der Daten in die PostgreSQL-Datenbank mussten folgende  Arbeiten vorgenommen werden:
Import der 11.000 Shapefile mussten in zwei verschiedene Datenbanken (Gas und Grundkarte)
Verteilen von Objekten in einem Shapefile auf mehrere Tabellen
Zusammenfassen von Objekte aus mehreren Shapefiles mit unterschiedlichen Attributfeldern in einer Tabelle
Ver&#228;nderung von Attributen
Entfernen von redundanten Daten
&#8230;
Fazit
Ohne den Einsatz von GeoKettle w&#228;re die Datenmigration bei der Werraenergie kaum zu stemmen gewesen. Dabei hat sich GeoKettle als gut dokumentierte und leicht zu erlernende Software heraus gestellt, die eine echte Alternative zur FME darstellt.</description>
        <persons>
          <person id="347">Jens Schaefermeyer</person>
        </persons>
        <links>
        </links>
      </event>
      <event guid="none" id="717">
        <date>2014-03-20T10:00:00+01:00</date>
        <start>10:00</start>
        <duration>00:30</duration>
        <room>H1</room>
        <slug></slug>
        <title>MapProxy</title>
        <subtitle>Was war? Was wird?</subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract></abstract>
        <description>Ende 2008 wurde der Grundstein f&#252;r die Software MapProxy gelegt. Im M&#228;rz 2010 wurde MapProxy dann von den Entwicklern im Rahmen der FOSSGIS-Konferenz in Osnabr&#252;ck als Open-Source-Software ver&#246;ffentlicht. 

Der Vortrag beleuchtet die kleine Erfolgsgeschichte der Open-Source-Geo-Komponente MapProxy: Was war Ausgangspunkt und Grundidee hinter dem MapProxy und welchen Funktionsumfang hat MapProxy mittlerweile erreicht?

In kleinen Beispielen wird auf wiederkehrende Probleme eingegangen die mit MapProxy gel&#246;st werden k&#246;nnen. Dabei wird auch auf die neuen und erweiterteren MapProxy Hilfswerkzeuge eingegangen. Diese bieten dem Benutzer die M&#246;glichkeit MapProxy noch schneller und einfacher zu konfigurieren.

Zus&#228;tzlich zum Funktionsumfang zeigt der Vortrag auch einen kleinen Blick hinter die Kulissen vom MapProxy Projekt. Neben dem eigentlichen Quellcode der Software geh&#246;rt noch mehr zu einer Infrastruktur (z.B. Travis-CI) um eine Software erfolgreich ausliefern zu k&#246;nnen. 

Abschlie&#223;end wirft der Vortragende noch einen Blick auf die nahe und ferne Zukunft des MapProxy Projektes. Ein Highlight ist hierbei der neue Hintergrunddienst der f&#252;r MapProxy entwickelt und auch als Open-Source-Software ver&#246;ffentlicht wurde.</description>
        <persons>
          <person id="142">Dominik Helle</person>
        </persons>
        <links>
          <link href="http://mapproxy.org">MapProxy</link>
          <link href="https://github.com/mapproxy/mapproxy-renderd">MapProxy Renderd</link>
        </links>
      </event>
      <event guid="none" id="672">
        <date>2014-03-20T11:00:00+01:00</date>
        <start>11:00</start>
        <duration>00:30</duration>
        <room>H1</room>
        <slug></slug>
        <title>die Zukunft von WebGIS</title>
        <subtitle>2D, 3D, mobil, Anmimation oder Rendern im Client</subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract></abstract>
        <description>Zu Beginn des neuen Jahrtausends war WebGIS der Versuch, ein abgespecktes GIS im Browser anzuzeigen. Oft wurden Karten noch &#252;ber ein ferngesteuertes Desktop-GIS gerendert, Standards steckten in den Kinderschuhen und Geodaten f&#252;r die Pr&#228;sentation im Internet zu finden kam der vielzitierten Suche nach der Stecknadel im Heuhaufen gleich. Seitdem hat sich viel ver&#228;ndert, Karten im Netz und damit auch r&#228;umliche Anwendungen sind mittlerweile omnipr&#228;sent, Technologien sind komplexer geworden, das Internet und auch die Browser bieten viel mehr M&#246;glichkeiten. Aktuell k&#252;ndigen &#8222;Buzzwords&#8220; wie 3D, client-side-rendering, mobile, HTML5, WebGL und viele, viele mehr davon, das sich WebGIS in Zukunft wiederum neu erfinden wird. Doch wie k&#246;nnte diese Zukunft aussehen? Lassen sich &#8222;Web&#8220;, &#8222;GIS&#8220; und &#8222;WebGIS&#8220; eigentlich noch so einfach in diese Schubladen aufteilen? Und wie k&#246;nnte das k&#252;nftig aussehen? Welche Trends lohnt es sich zu beobachten?

Der Vortrag besch&#228;ftigt sich mit diesen aktuellen Trends, stellt aktuelle L&#246;sungen vor und blickt in die Glaskugel um k&#252;nftige Trends mit Open Source Software ohne den Anspruch der Vollst&#228;ndigkeit und Richtigkeit vorzudenken. Der Autor selber hatte seinen ersten Kontakt mit WebGIS zu Zeiten, als WebGIS selber noch in der Vorschule war. </description>
        <persons>
          <person id="23">Till Adams</person>
        </persons>
        <links>
        </links>
      </event>
      <event guid="none" id="662">
        <date>2014-03-20T11:30:00+01:00</date>
        <start>11:30</start>
        <duration>00:30</duration>
        <room>H1</room>
        <slug></slug>
        <title>Warum soll ich f&#252;r Open Source GIS bezahlen?</title>
        <subtitle></subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract></abstract>
        <description>FOSSGIS kann man frei und kostenlos herunterladen. Man kann sie modifizieren und beliebig nutzen. Aber bedeutet das auch, dass es sich nicht lohnt Geld f&#252;r den Einsatz der Software auszugeben? Wenn FOSSGIS in gesch&#228;ftskritischen Unternehmensbereichen einsetzt wird, dann lohnt es sich immer dar&#252;ber nachzudenken professionellen Support f&#252;r den Betrieb der Software einzukaufen. Langfristige Verf&#252;gbarkeit und langfristige Planbarkeit - Long Term Support - ist dabei eines der Schl&#252;sselkriterien. Dieses und weitere Argumente werden im Rahmen der Vortrages diskutiert.</description>
        <persons>
          <person id="13">Horst D&#252;ster</person>
        </persons>
        <links>
        </links>
      </event>
      <event guid="none" id="713">
        <date>2014-03-20T12:00:00+01:00</date>
        <start>12:00</start>
        <duration>00:30</duration>
        <room>H1</room>
        <slug></slug>
        <title>Neues vom Open Geospatial Consortium</title>
        <subtitle>Das OGC Compliance Programm und Freie Software, was verbirgt sich hinter den Ideas4OGC und ein Ausblick auf das OGC Technical Committee Meeting im M&#228;rz 2014</subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract></abstract>
        <description>Die Standards des OGC sind aus den meisten Geodateninfrastrukturen, Geoportalen und WebGIS-L&#246;sungen nicht wegzudenken. Viele Ausschreibungen setzen den Einsatz von OGC Standards voraus und Richtlinien wie die INSPIRE Direktive basieren auf ISO und OGC Standards.
Wie in den Jahren davor, werden in diesem Vortrag Neuigkeiten aus dem OGC vorgestellt und Fragen aus dem Publikum beantwortet.
Nach einer kurzen Einf&#252;hrung, in der unter anderem das Memorandum of Understanding zwischen der OSGeo und dem OGC dargestellt wird, wird das OGC Compliance Programm (Software Zertifizierung) n&#228;her erl&#228;utert und die Rolle von Open Source Software und der OSGeo Community. Abschlie&#223;end wird erkl&#228;rt, was sich hinter dem Ideas4OGC Prozess verbirgt und ein Ausblick auf das OGC Technical Committee Meeting im M&#228;rz 2014 gegeben.</description>
        <persons>
          <person id="208">Athina Trakas</person>
        </persons>
        <links>
          <link href="http://">http://</link>
        </links>
      </event>
      <event guid="none" id="698">
        <date>2014-03-20T13:30:00+01:00</date>
        <start>13:30</start>
        <duration>00:30</duration>
        <room>H1</room>
        <slug></slug>
        <title>OpenLayers 3</title>
        <subtitle>Einf&#252;hrung, Verwendungsbeispiele und technische Highlights</subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract></abstract>
        <description>Referenten: Marc Jansen, terrestris &amp; Andreas Hocevar, Boundless

OpenLayers ist eine OpenSource JavaScript Kartenbibliothek mit sehr gro&#223;er Verbreitung, sowohl innnerhalb von OSGeo-Projekten als auch in privaten wie &#246;ffentlichen Webseiten und Internet-/Intranet-Applikationen. Die 2.x-er Versionen der Software werden bis zum heutigen Tage weiterentwickelt und gepflegt. Doch nat&#252;rlich nagt der Zahn der Zeit auch an OpenLayers: Entwickler und Anwender haben 2014 verst&#228;ndlicherweise andere Anspr&#252;che an digitale Kartenbibliotheken, als dies vor 8 Jahren der Fall war.

Bereits seit einiger Zeit wird daher von der Entwicklergemeinde an OpenLayers 3 gearbeitet, zum Zeitpunkt der Einreichung des Abstracts ist die aktuellste Version 3.0.0.beta.1.

Der Vortrag zweier OpenLayers Kernentwickler wird in die Verwendung der neuen Version einf&#252;hren. Die Zuh&#246;rer werden erfahren, was sich ge&#228;ndert hat (kurz: fast alles) und was gleich bleibt (kurz: die zahllosen Anwendungsm&#246;glichkeiten). Hierbei werden wir viele Verwendungsbeispiele (Quellcode und Ergebnis) aufzeigen. Auch die Erl&#228;uterung der Architektur hinter OpenLayers 3 wird beleuchtet werden. Besonders werden hierbei einige technische Highlights (wie die Verwendung von WebGL, Vektor-API, kleine Dateigr&#246;&#223;e, Build-Prozess) vorgestellt.

Auch die Roadmap der weiteren Entwicklung des Projektes wird angesprochen werden.</description>
        <persons>
          <person id="34">Marc Jansen</person>
        </persons>
        <links>
          <link href="http://ol3js.org">Webseite OpenLayers 3</link>
          <link href="https://www.youtube.com/watch?v=JEFcO6NZeZU">Videomitschnitt</link>
        </links>
      </event>
      <event guid="none" id="697">
        <date>2014-03-20T14:00:00+01:00</date>
        <start>14:00</start>
        <duration>00:30</duration>
        <room>H1</room>
        <slug></slug>
        <title>GeoExt2</title>
        <subtitle>Was ist neu und was bringt die Zukunft</subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract></abstract>
        <description>Referenten: Marc Jansen, terrestris &amp; Christian Mayer, ISB AG

GeoExt [1] ist eine auf den JavaScript-Bibliotheken OpenLayers (f&#252;r interaktive Karten im Web und Verarbeitung einer F&#252;lle von OGC-konformen Formaten, [2]) 
und ExtJS (Framework zur Erstellung von Desktop-&#228;hnlichen Webanwendungen mit nativem Look and Feel, [3]) aufbauende OpenSource JavaScript-Bibliothek, die es vereinfacht, Kartenmaterial in ansprechenden und komplexen Oberfl&#228;chen zu pr&#228;sentieren, so genannte "Rich Webmapping Applications".

Seit Oktober 2013 liegt GeoExt in der Version 2.0.0 vor, welche auf den neuesten stabilen Version der Basisbibliotheken aufbaut: OpenLayers 2.13.1 und ExtJS 4.2.1.

Der Vortrag wird die aktuelle Version pr&#228;sentieren, und anhand von beeindruckenden Beispielen die M&#246;glichkeiten von GeoExt darstellen. Hierbei werden insbesondere folgende Aspekte beleuchtet werden:

* &#196;nderungen f&#252;r Anwender im Vergleich zur Vorg&#228;ngerversion
* Kompatibilit&#228;t mit dem Single-File Build-Tool von Sencha (Automatisierte Erzeugung einer komprimierten JS-Datei f&#252;r den Produktivbetrieb)
* Integration in den ExtJS MVC (Model-View-Controller) Architekturansatz
* Verbesserte API-Dokumentation und Pr&#228;sentation
* Vereinfachte "themeability" (Einfachere grafische Ausgestaltung der resultierenden Anwendung)

Au&#223;erdem wird ein kurzer Blick auf die Entwicklungsgeschichte und die Hintergr&#252;nde von GeoExt 2 geworfen werden: Weite Teile der Codebasis wurden bei einem gesponserten internationalen Codesprint gelegt, warum dauerte es bis zur finalen Version 2.0 anschlie&#223;end vergleichbar lange?

Weiterer Fokus wird auf der Darstellung der zuk&#252;nftig geplanten Entwicklung des Projektes liegen. Insbesondere wird der Vortrag aktuelle &#220;berlegungen zur Unterst&#252;tzung verschiedener Kartenbibliotheken wie OpenLayers 3 [4] oder Leaflet [5] behandeln.

[1] http://geoext.github.io/geoext2/
[2] http://openlayers.org
[3] http://www.sencha.com/products/js/
[4] http://ol3js.org/
[5] http://leafletjs.com/</description>
        <persons>
          <person id="163">Christian Mayer</person>
        </persons>
        <links>
          <link href="http://geoext.github.io/geoext2/">Webseite GeoExt2</link>
          <link href="https://www.youtube.com/watch?v=HjVGQlYgaOY">Videomitschnitt</link>
          <link href="http://chrismayer.github.io/fossgis2014-geoext2/">Folien als Online-Slideshow</link>
        </links>
      </event>
      <event guid="none" id="744">
        <date>2014-03-20T14:30:00+01:00</date>
        <start>14:30</start>
        <duration>00:30</duration>
        <room>H1</room>
        <slug></slug>
        <title>Mobile Kartenviewer mit Openlayers 3</title>
        <subtitle></subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract></abstract>
        <description>Mit OpenLayers 3 steht eine komplette Neuentwicklung der funktionsreichen OpenLayers-Bibliothek zur Verf&#252;gung. Die verbesserte Unterst&#252;tzung mobiler Ger&#228;te war ein prim&#228;res Ziel der neuen Version. Dieser Vortrag stellt den JQuery Mobile basierten OL3 Mobile Viewer vor, der erweiterte Funktionen wie automatische Kartenausrichtung oder Positionsnachf&#252;hrung bietet. Es wird auch ein Vergleich mit anderen Viewern, wie der auf Bootstrap und AngularJS aufbauenden Neuentwicklung von Swisstopo angestellt.</description>
        <persons>
          <person id="99">Pirmin Kalberer</person>
        </persons>
        <links>
          <link href="https://github.com/sourcepole/ol3-mobile-viewer">https://github.com/sourcepole/ol3-mobile-viewer</link>
          <link href="http://stadtplan.winterthur.ch/mobile?mobile=true">http://stadtplan.winterthur.ch/mobile?mobile=true</link>
        </links>
      </event>
      <event guid="none" id="684">
        <date>2014-03-20T15:30:00+01:00</date>
        <start>15:30</start>
        <duration>00:30</duration>
        <room>H1</room>
        <slug></slug>
        <title>Mapbender3 - was gibt's Neues im Projekt?</title>
        <subtitle>Neues zum Aufbau von WebGIS Anwendungen mit Mapbender3</subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract></abstract>
        <description>Mapbender3 ist eine Software zur einfachen Erstellung von WebGIS Anwendungen. Basierend auf dem aktuellen Symfony2 Framework wurde eine moderne Webanwendung geschaffen, die durch das Baukastensystem der Bundles von Symfony2 einzeln als auch in andere Anwendungen integriert Verwendung finden kann. OpenLayer dient als Kartenanwendung und wird &#252;ber MapQuery angesprochen. 

Zusammen mit einem modernen Verwaltungsbackend f&#252;r die Kartenanwendungen ist Mapbender3 ein komfortables Werkzeug f&#252;r die Erstellung und Pflege von Kartenanwendungen.

Der Vortrag geht vor allem auf die neuen Komponenten in Mapbender3 ein und stellt diese vor. 

Einsteigern wird ebenfalls ein &#220;berblick &#252;ber die Software gegeben. Mit Mapbender3 k&#246;nnen einfach WebAnwendungen &#252;ber ein paar Klicks im  Administrations-Backend erstellt werden. Das Administrations-Backend beinhaltet au&#223;erdem die M&#246;glichkeit, ein Dienste-Repository aufzubauen. Dienste k&#246;nnen hierbei verschiedene von OpenLayers unterst&#252;tzte Quellen sein.

Mapbender3 bietet eine Benutzer- und Gruppenverwaltung mit der M&#246;glichkeit Rechte zuzuweisen. Rechteverwaltung. Benutzer k&#246;nnen auch &#252;ber LDAP in Mapbender &#252;bernommen werden. Eine Sicherung von Diensten &#252;ber OWSPROXY ist ebenfalls vorhanden.</description>
        <persons>
          <person id="65">Astrid Emde</person>
        </persons>
        <links>
          <link href="http://svn.osgeo.org/mapbender/trunk/documents/presentations/FOSSGIS2014/FOSSGIS2014_Mapbender3_2014_AEmde.pdf">Folien Mapbender3</link>
          <link href="http://upload.wikimedia.org/wikipedia/commons/thumb/6/6e/18x14_Video_Clic_Player.svg/24px-18x14_Video_Clic_Player.svg.png">Video Mapbender3 YouTube</link>
          <link href="http://www.fossgis.de/wiki/Konferenz_2014/Videoaufzeichnung">Video - weitere Formate</link>
        </links>
      </event>
      <event guid="none" id="751">
        <date>2014-03-20T16:00:00+01:00</date>
        <start>16:00</start>
        <duration>00:30</duration>
        <room>H1</room>
        <slug></slug>
        <title>Vaadin - ein WebMapping Framework</title>
        <subtitle></subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract></abstract>
        <description>Vaadin ist als Framework in der WebMapping Szene noch sehr unverbreitet. Trotzdem bietet Vaadin einige Konzepte und Technologien, welche es besonders attraktiv f&#252;r einen produktiven Einsatz macht.

Vaadin als Framework erm&#246;glicht es w&#228;hrend der Entwicklung sich auf eine Technologie zu konzentrieren. Die gesamte Programmierung geschieht in Java und ist wesentlich n&#228;her an der einer Desktopanwendung. Dieses Konzept merkt man auch durch den Komfort und die ansprechende visuelle Darstellung der mit Vaadin entwickelten Oberfl&#228;chen. Im Gegensatz zu anderen Webframeworks setzt Vaadin auf nur eine Technologie und die Umsetzung der Server und Clientseite geschieht &#8218;automatisch&#8216;. Der Entwickler muss sich somit weder um die Kommunikation von Browser und Server, noch um verschiedene Teill&#246;sungen k&#252;mmern. Die Ausf&#252;hrung erfolgt auf einem Apache Tomcat Server und im Frontend wird das bereits bekannte Google Web Toolkit (GWT) verwendet. Da s&#228;mtliche Aktionen eine serverseitige Datenvalidierung ben&#246;tigen, ist die Sicherheit stets gew&#228;hrleistet und b&#246;swillig manipulierte Client-Daten werden von Anfang an abgefangen.

Das Widget vOpenLayers ist eine Wrapperklasse von OpenLayers f&#252;r Vaadin, welche es grunds&#228;tzlich erm&#246;glicht OpenLayers Funktionen zu nutzten. OpenLayers das weit bekannte und stets gepflegte Projekt, ist das ideale Framework f&#252;r eine browserbasierte GIS L&#246;sung. Mit vOpenLayers ist somit die ideale Schnittstelle zwischen Vaadin und der GIS Welt geschaffen worden.

Dank Java als Programmiersprache ist die Entwicklung einer Webanwendung sehr einfach und unkompliziert. Durch die starke Verbindung zwischen den zwei Frameworks Vaadin und OpenLayers ist nun auch eine Bindung entstanden die M&#246;glichkeiten im GIS Bereich &#246;ffnet.

</description>
        <persons>
          <person id="320">Martin</person>
        </persons>
        <links>
        </links>
      </event>
      <event guid="none" id="653">
        <date>2014-03-20T16:30:00+01:00</date>
        <start>16:30</start>
        <duration>00:30</duration>
        <room>H1</room>
        <slug></slug>
        <title>MapFish WebGIS - Projektstand</title>
        <subtitle>Die Pr&#228;sentation gibt eine &#220;bersicht des MapFish WebGIS Frameworks und zeigt dessen M&#246;glichkeiten mit der GeoMapFish Implementierung: ein sehr performantes WebGIS mit zahlreichen Tools und Konfigurationsm&#246;glichkeiten.</subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract></abstract>
        <description>Das MapFish Framework erlaubt es, funktional reiche WebGIS Applikationen einfach und auf flexible Art und Weise zu erstellen.
Es kombiniert einige der besten Open Source Tools in einem Framework: OpenLayers 2, ExtJS3 und GeoExt4 auf der Client-Seite, und MapFish Print sowie Ruby oder Phython Module (insbesondere auf Pyramid basierend) auf der Server-Seite. Neben den auf OGC-Standards basierenden Webservices stellt das MapFish Protokoll den effizienten Austausch zwischen Client und Server sicher. Auf dieser Basis wurden komplexe und sehr performante Webmapping Anwendungen entwickelt.
Eines der MapFish-Anwendungen wird in der Pr&#228;sentation genauer vorgestellt, um die M&#246;glichkeiten des MapFish Frameworks zu zeigen: GeoMapFish ist ein komplettes WebGIS mit einer breiten Palette an Tools und Konfigurationsoptionen. Seit seiner Entstehung erlaubt die Plugin-basierte Architektur eine individuelle Anpassung der Applikationen auf die spezifischen Anwendungsf&#228;lle. Die Pr&#228;sentation gibt eine &#220;bersicht des MapFish WebGIS Frameworks und zeigt dessen M&#246;glichkeiten mit der GeoMapFish Implementierung.</description>
        <persons>
          <person id="336">Elisabeth Leu</person>
        </persons>
        <links>
          <link href="http://mapfish.org">http://mapfish.org</link>
        </links>
      </event>
      <event guid="none" id="739">
        <date>2014-03-20T17:00:00+01:00</date>
        <start>17:00</start>
        <duration>00:30</duration>
        <room>H1</room>
        <slug></slug>
        <title>GIS as a Service</title>
        <subtitle></subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract>Bei organisations&#252;bergreifenden Arbeitsgruppen wird die Zusammenarbeit durch den Einsatz von propriet&#228;rer Software oft gehemmt. Eine zentrale GIS-Installation, die vollst&#228;ndig auf Open Source Komponenten aufbaut, kann mit x2go als Terminalserver-L&#246;sung in beliebigen Systemumgebungen zur Verf&#252;gung gestellt werden.</abstract>
        <description>GIS as a Service

In immer mehr Bereichen entwickeln sich Geografische Informationssysteme (GIS) zu wichtigen Analysewerkzeugen. Bei interdisziplin&#228;ren Arbeitsgruppen, die h&#228;ufig organisations&#252;bergreifend arbeiten, wird die Zusammenarbeit durch den Einsatz von propriet&#228;rer Software gehemmt. F&#252;r solche Kollaborationen sind zentrale GIS-Installationen, die vollst&#228;ndig auf Open Source Komponenten aufbauen, eine wichtige Voraussetzung um optimale Wirkungen zu erreichen.

Am Beispiel von VeriSO, einem Softwarepaket zur Pr&#252;fung von amtlichen Vermessungsdaten, wird beispielhaft die Vorteile eines solchen Systems aufgezeigt. Im Kanton Bern arbeiten 20 private B&#252;ros, die die Daten der amtlichen Vermessung f&#252;hren und manipulieren. Das kantonale Vermessungsamt ist f&#252;r die Kontrolle und Freigabe dieser Daten verantwortlich. Insgesamt kommen 4 propriet&#228;re GIS zum Einsatz. Eine echte Zusammenarbeit auf einem gemeinsamen GIS ist nicht m&#246;glich.

Auf zwei Terminalservern wird nun 25 Benutzern der Zugriff auf die Pr&#252;fsoftware gew&#228;hrt. Die eigentliche Anwendung besteht aus einer QGIS-PostGIS-Installation mit einem zus&#228;tzlichen Plugin zur Datenpr&#252;fung. Auf dem Ubuntu-Betriebsystem ist ein X2GO-Terminalserver installiert. Dieses Paket ist mittels KVM auf den Terminalservern virtualisiert. Die Klientensoftware ist portabel, so dass keine Installation auf den Klientsystemen notwendig ist.

Stefan Ziegler
Nikolaus Gr&#228;ssle</description>
        <persons>
          <person id="183">Stefan Ziegler</person>
        </persons>
        <links>
        </links>
      </event>
      <event guid="none" id="764">
        <date>2014-03-20T18:00:00+01:00</date>
        <start>18:00</start>
        <duration>02:00</duration>
        <room>H1</room>
        <slug></slug>
        <title>Vollversammlung FOSSGIS e.V.</title>
        <subtitle></subtitle>
        <track>Allgemeines</track>
        <type>other</type>
        <language>de</language>
        <abstract>Die ordentlichen Mitgliederversammlung 2014 des FOSSGIS e.V. findet am Mittwoch, den 20. M&#228;rz 2014, um 19:00 Uhr
am Rande der FOSSGIS Konferenz an der Beuth Hochschule Berlin statt.

</abstract>
        <description></description>
        <persons>
          <person id="135">Marco Lechner</person>
        </persons>
        <links>
        </links>
      </event>
    </room>
    <room name="H2">
      <event guid="none" id="625">
        <date>2014-03-20T09:00:00+01:00</date>
        <start>09:00</start>
        <duration>00:30</duration>
        <room>H2</room>
        <slug></slug>
        <title>Ern&#228;hrungsfl&#228;che einer Agglomeration</title>
        <subtitle>Ermittlung und Visualisierung des Fl&#228;chenbedarfs zur Ern&#228;hrung der Bev&#246;lkerung einer Agglomeration</subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract></abstract>
        <description>Wie gross ist die Fl&#228;che, die eine durchschnittliche Schweizer Person braucht, um sich zu ern&#228;hren? Wie k&#246;nnte diese optimiert werden? Wo l&#228;ge sie und wie gross w&#228;re diese Fl&#228;che f&#252;r die Bev&#246;lkerung einer bestimmten Agglomeration, wenn alle Nahrungsmittel lokal und in der Schweiz produziert w&#252;rden? Es geht also um eine Visulisierung der f&#252;r die Ern&#228;hrung einer Region ben&#246;tigten Fl&#228;che.
Um diese Fragen zu beantworten, muss zuerst der Fl&#228;chenbedarf einer Person f&#252;r deren Ern&#228;hrung ermittelt werden. Dabei sollen nur die Produkte, die in der Schweiz anbaubar sind, ber&#252;cksichtigt werden. Die Berechnungen st&#252;tzen sich auf die Ertr&#228;ge der jeweiligen landwirtschaftlichen Prim&#228;rprodukte. 
F&#252;r die Zuteilung der Fl&#228;chen auf die verf&#252;gbare landwirtschaftliche Nutzfl&#228;che wird ein auf Geodaten und Methoden der Geoinformatik beruhendes Berechnungsmodell entwickelt. Dieses basiert haupts&#228;chlich auf den Daten der Arealstatistik. Die Fl&#228;chen werden distanzabh&#228;ngig zugeteilt, um die Transportdistanzen zu minimieren. Das Modell ist so konzipiert, dass es auch &#252;bertragbar auf andere Regionen ist.
In einem weiteren Teil wird versucht die heutige Di&#228;t zu optimieren. Dabei steht der Fl&#228;chenver-brauch im Mittelpunkt, aber auch ern&#228;hrungsphysiologische Aspekte werden ber&#252;cksichtigt. Es resultieren zwei unterschiedliche Szenarien. 
Mit dem entwickelten Modell k&#246;nnen Karten generiert werden, welche darstellen, wie gross die Ern&#228;hrungsfl&#228;che einer Agglomeration w&#228;re und wie sich Ver&#228;nderungen in der Di&#228;t auf diese auswirken. Mit den Karten k&#246;nnen auch andere Aspekte aufgezeigt werden. Es wird sofort ersichtlich, warum Futtermittelimporte in der Schweiz n&#246;tig sind. 
Die gesamte Analyse einschliesslich der Visualisierung wurde mit Opensource Komponenten erstellt. Diese Arbeit zeigt anschaulich das Potenzial und die Kapazit&#228;t von Opensource Software im GIS Bereich. 
</description>
        <persons>
          <person id="30">Hans-J&#246;rg Stark</person>
        </persons>
        <links>
        </links>
      </event>
      <event guid="none" id="724">
        <date>2014-03-20T09:30:00+01:00</date>
        <start>09:30</start>
        <duration>00:30</duration>
        <room>H2</room>
        <slug></slug>
        <title>PostGIS in real :-) action</title>
        <subtitle>Bilanzierung von W&#228;ldern mit nat&#252;rlicher Entwicklung in Deutschland</subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract>In einem deutschlandweiten Projekt wurden Geodaten zu nutzungsfreien Waldfl&#228;chen in PostgreSQL/PostGIS aufbereitet. Arbeitsschritte waren die Transformation in ein einheitliches Koordinatensystem, eine &#220;berlagerungsanalyse und die Abbildung von &#252;berregionalen Daten mit Hilfe von PL/pgSQL-Funktionen.</abstract>
        <description>F&#252;r ein Forschungsvorhaben wurden von einer Vielzahl von Waldbesitzern aus ganz Deutschland Geo- und Sachinformationen zu nutzungsfreien W&#228;ldern bereitgestellt. Diese umfangreiche Datengrundlage enth&#228;lt detaillierte Informationen zu ca. 400.000 Hektar Waldfl&#228;che in etwa 90 verschiedenen Datenlieferungen. Hierbei lagen die einzelnen Lieferungen in einer z.T. sehr heterogenen Form vor.
Die Haltung, Bearbeitung und Bereitstellung aller Daten wurde in der Datenbank PostgreSQL mit der Erweiterung PostGIS durchgef&#252;hrt. Wesentliche Arbeitsschritte bez&#252;glich der Geoinformationen waren die Transformation in ein einheitliches Koordinatensystem, eine &#220;berlagerungsanalyse der einzelnen Datenlieferungen, die Abbildung von &#252;berregionalen Daten auf die Waldfl&#228;chen und die Identifizierung von zusammenh&#228;ngenden oder benachbarten Fl&#228;chenkomplexen. Hierbei wurden eine Reihe von Funktionen (PL/pgSQL) geschrieben, die die Grundfunktionalit&#228;ten von PostGIS zu spezialisierten Werkzeugen kombinieren. Beispielsweise wurde f&#252;r die Verschneidung der Waldfl&#228;chen mit deutschlandweit vorliegenden sehr gro&#223;en Daten wie dem Digitalen Landbedeckungsmodell DLM-DE Funktionen entwickelt, die quadrantenweise eine sukzessive Abarbeitung der Gesamtfl&#228;che der Bundesrepublik erm&#246;glichen. Auf diese Weise konnte eine &#252;berm&#228;&#223;ige Auslastung des Arbeitsspeichers vermieden werden.
Die Realisierung des Projektes wurde m&#246;glich durch die Nutzung von OpenSource Werkzeugen. Die verwendeten Werkzeuge stellen eine professionelle und h&#246;chst aktuelle Arbeitsumgebung dar, welche in dieser Form als kostenpflichtige Variante keines Falls h&#228;tte hergestellt werden k&#246;nnen.
Hintergrund: Die Bundesregierung hat das Ziel formuliert bis zum Stichjahr 2020 5 % der Waldfl&#228;che in Deutschland einer nat&#252;rlichen Entwicklung zu &#252;berlassen. Da bisher keine verl&#228;ssliche Bilanzierungsgrundlage existierte, wurde vom Bundesministerium f&#252;r Umwelt, Naturschutz und Reaktorsicherheit ein Vorhaben beauftragt, welches die entsprechende Grundlage erarbeitet. Das Vorhaben ist weitgehend abgeschlossen.</description>
        <persons>
          <person id="426">Falko Engel</person>
        </persons>
        <links>
        </links>
      </event>
      <event guid="none" id="736">
        <date>2014-03-20T10:00:00+01:00</date>
        <start>10:00</start>
        <duration>00:30</duration>
        <room>H2</room>
        <slug></slug>
        <title>Daten im Fluss - ein ISK-Projekt im Nationalpark Unteres Odertal</title>
        <subtitle></subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract></abstract>
        <description>Hintergrund: Seit 2011 f&#252;hrt die Hochschule f&#252;r nachhaltige Entwicklung Eberswalde (HNEE) im Auftrag der Nationalparkverwaltung ein naturschutzfachliches Monitoring im Nationalpark Unteres Odertal durch. Dabei werden in regelm&#228;&#223;igen Abst&#228;nden Untersuchungen der Vegetation, der Tierwelt, des Boden und anderer Naturraumkomponenten durchgef&#252;hrt. Alle erhobenen Daten besitzen einen r&#228;umlichen Bezug. Es besteht die Anforderung der freien Zug&#228;nglichkeit und Nutzung, Visualisierung und Auswertung der Daten durch verschiedene Nutzergruppen: Wissenschaft (HNEE), Nationalparkverwaltung, Fachb&#252;ros, interessierte &#214;ffentlichkeit und Ehrenamtliche.

Geobasis- und Geofachdaten werden in Form verschiedener INSPIRE-konformer Geodienste verf&#252;gbar gemacht.  Dies wird realisiert in Form eines Infastrukturknotens, der vollst&#228;ndig auf Opensource Software basiert und sich in die Geodateninfastruktur des Landes Brandenburg einf&#252;gt. Die Softwarearchitektur besteht aus folgenden Komponenten:
Mapserver-Software: Geoserver als OGC kompatibler Kartenserver mit hoher Performance,
Datenbank/Datenspeicher: PostgreSQL als Objektrelationales Datenbankmanagementsystem mit GIS-Erweiterung (PostGIS)
                	
Im Vortrag wird der ISK vorgestellt. Ein Erfahrungsbericht &#252;ber den Projektverlauf, Datenauswahl und -aufbereitung, Software und Anwendungsbeispiele.
</description>
        <persons>
          <person id="429">Jana Chmieleski</person>
        </persons>
        <links>
        </links>
      </event>
      <event guid="none" id="730">
        <date>2014-03-20T11:00:00+01:00</date>
        <start>11:00</start>
        <duration>00:30</duration>
        <room>H2</room>
        <slug></slug>
        <title>Kantonales Geoportal GeoView BL</title>
        <subtitle>Weiterentwicklungen</subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract></abstract>
        <description>Bereits seit &#252;ber einem Jahr ist im Kanton Basel-Landschaft das Web-GIS "GeoView
BL" erfolgreich im Einsatz. Es besteht aus Open-Source-Komponenten und bietet damit eine
unglaubliche Erweiterbarkeit. Auch dieses Jahr m&#246;chten wir einen Einblick aus
Anwendersicht in den Umgang mit einer solchen Open-Source-L&#246;sung bieten. Wir werden
dabei haupts&#228;chlich auf die Belange der Weiterentwicklung eingehen, da wir inzwischen
recht erfolgreich L&#246;sungen implementieren, die dann innerhalb des Kantons zum Einsatz
kommen.
Folgende Punkte werden behandelt:
1. Personeller Aufwand
2. Entwicklungsumgebung (welche Werkzeuge, welche Methoden, welche Philosophie)
3. Kleinl&#246;sungen oder generische L&#246;sung?
4. Was l&#228;sst sich erreichen? (konkrete Eigenentwicklungen aus dem Kanton BL)</description>
        <persons>
          <person id="313">Clemens Rudert</person>
        </persons>
        <links>
          <link href="http://www.geoview.bl.ch/">http://www.geoview.bl.ch/</link>
          <link href="http://">http://</link>
        </links>
      </event>
      <event guid="none" id="703">
        <date>2014-03-20T11:30:00+01:00</date>
        <start>11:30</start>
        <duration>00:30</duration>
        <room>H2</room>
        <slug></slug>
        <title>GDA Wasser &#8211; ein praktisches Beispiel f&#252;r das komplexe SHOGun-WebGIS Framework</title>
        <subtitle></subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract></abstract>
        <description>Das Projekt GDA Wasser wurde Ende des Jahres 2011 durch die Wasserwirtschaft Rheinland-Pfalz zur Ausschreibung gestellt. Ziel war es, eine moderne, umfassende GIS-Architektur auf OpenSource-Basis umzusetzen, um die bestehende, auf &#228;lteren Technologien beruhende GDI abzul&#246;sen.

Aufbauend auf dem Vortag der FOSSGIS 2013 &#8222;Das SHOGun-WebGIS Framework&#8220; von Till Adams wird in diesem Vortrag die praktische Anwendung der entwickelten L&#246;sung im Rahmen des Projektes GDA Wasser dargestellt.

Die im Projekt verwendete Architektur setzt sich im Wesentlichen aus einem soliden Backend, aufsetzend auf oben erw&#228;hntem SHOGun (Java EE, Kernkomponenten Hibernate, Spring3) und einem Verwaltungs- und GIS-Client unter anderem auf Basis der JavaScript Bibliotheken Ext JS, OpenLayers und GeoExt2 zusammen.

Das Backend stellt folgende Kernfunktionalit&#228;ten bereit: Erstellung, Verwaltung und Editierung von GIS-Oberfl&#228;chen inklusive Rechteverwaltung und Absicherung mittels Spring-Security sowie Anlegen und Verwalten von Kartendiensten. Dabei k&#246;nnen Layer durch Hochladen von Geodaten in GeoServer angelegt und auch mit Tabellen, Zeitreihen und Bildern verkn&#252;pft werden.

Das Frontend besteht neben dynamisch erzeugten GIS-Applikationen aus breit gef&#228;cherten Konfigurationsoberfl&#228;chen.

Ein Einsatzfeld der Architektur GDA Wasser ist die dynamische Erstellung und Konfiguration von thematischen Kartenanwendungen. Die Funktionalit&#228;ten einer solchen GIS-Applikation erstrecken sich &#252;ber ein weites Feld: Von der reinen Anzeige spezifischer Themen, deren dynamischer grafischer Ausgestaltung, Anlage neuer Layer, Digitalisierungs- und Annotierungsfunktionen, &#252;ber Druckfunktionen, individuelle Abfrage-, Such- und Selektionswerkzeuge, Exportfunktionalit&#228;ten und Speicherung von Arbeitsst&#228;nden, um nur einen kleinen Teil zu nennen. Ebenfalls stehen Schnittstellen f&#252;r externe Applikationen bzw. Fachanwendungen bereit, um eine Interaktion mit diesen zu gew&#228;hrleisten.

Der Vortrag soll einleitend einen kurzen architektonischen &#220;berblick geben und die verwendeten Komponenten beleuchten. Ein Gro&#223;teil des Vortrages soll sich auf die praktische Anwendung konzentrieren und zeigen, welche Funktionalit&#228;ten und M&#246;glichkeiten durch das Gesamtsystem gegeben werden.</description>
        <persons>
          <person id="162">Johannes Weskamm</person>
        </persons>
        <links>
          <link href="https://www.youtube.com/watch?v=5jlVHDfCCIk">Video</link>
        </links>
      </event>
      <event guid="none" id="708">
        <date>2014-03-20T12:00:00+01:00</date>
        <start>12:00</start>
        <duration>00:30</duration>
        <room>H2</room>
        <slug></slug>
        <title>Neue WEB-Anwendungen des Landesamtes f&#252;r Geologie, Rohstoffe und Bergbau (LGRB) Baden-W&#252;rttemberg im &#220;berblick</title>
        <subtitle></subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract>Aktuelle Entwicklungen zur Anpassung der WEB-Anwendungen des Landesamtes f&#252;r Geologie, Rohstoffe und Bergbau Baden W&#252;rttemberg an moderne Technologien, spezielle Nutzerw&#252;nsche und Anforderungen &#252;bergeordneter GDI werden in dem Vortrag vorgestellt.</abstract>
        <description>Das Regierungspr&#228;sidium Freiburg - Abt. 9 Landesamt f&#252;r Geologie, Rohstoffe und Bergbau (LGRB) Baden W&#252;rttemberg stellt seit 2006 geowissenschaftliche Landesdaten einem Nutzerkreis aus Wirtschaft, Verwaltung und Forschung mit Hilfe von OGC-konformen WEB-Diensten im Internet zur Verf&#252;gung.

Im Zuge des Aufbaus einer Geodateninfrastruktur f&#252;r das 2012 abgeschlossene EU-Projekt GeORG (maps.geopotenziale.eu) wurde damit begonnen, die WEB-Dienste und WEB-Anwendungen des LGRB (maps.lgrb-bw.de) an moderne Technologien, spezielle Nutzer-w&#252;nsche und Anforderungen &#252;bergeordneter Geodateninfrastrukturen (z.B. GDI-BW, GDI-DE, INSPIRE) anzupassen.

F&#252;r die Entwicklung von Kartenviewer-Clients kommen dabei OpenLayers, ExtJS und GeoExt zum Einsatz. WMS- und WFS-Dienste werden mit dem UMN Mapserver (Version 6.0.3) aufgesetzt, f&#252;r den CSW-Dienst wird GeoNetwork verwendet. Durch WPS-Dienste aus dem ZOO-Project lassen sich spezielle Sonderfunktionen, etwa zur dynamischen Generierung von prognostischen Horizontal- und Vertikalschnitten sowie Bohrprofilen aus geologischen 3D-Modellen in den Kartenviewer-Client einbinden.

In dem modular aufgebauten und individuell konfigurierbaren System k&#246;nnen Funktionen zur Sprachauswahl und Themenb&#228;ume separat und einfach &#252;ber Konfigurationsdateien an-gepasst werden. Dar&#252;ber hinaus k&#246;nnen spezielle Sichten auf einzelne Themen &#252;ber die integrierte Kartenverwaltung angelegt und an verschiedene Nutzer verteilt werden. Um z.B. den Zugriff auf vordefinierte Kartensichten oder kostenpflichtige Dienste zu regeln, wurde zudem eine Benutzerverwaltung entwickelt, die an die bestehenden Infrastrukturen ge-koppelt werden kann.

Die Kartenviewer-Anwendungen sind f&#252;r die Anzeige in den g&#228;ngigen Desktop-Browsern optimiert. F&#252;r mobile Endger&#228;te wurde eine zus&#228;tzliche Version entwickelt, in der einzelne Bausteine der Desktop-Version mithilfe einer Reiter-Struktur gegliedert und so f&#252;r die Touch-Bedienung angepasst sind.
</description>
        <persons>
          <person id="415">Heiko Zumsprekel</person>
        </persons>
        <links>
        </links>
      </event>
      <event guid="none" id="673">
        <date>2014-03-20T13:30:00+01:00</date>
        <start>13:30</start>
        <duration>00:30</duration>
        <room>H2</room>
        <slug></slug>
        <title>Social Media as Sensors</title>
        <subtitle></subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract>Der Beitrag zeigt die Konzeption und Entwicklung eines System, welches die M&#246;glichkeit bietet, Social Media (beispielhaft mit Twitter) und deren Analyse (NLP), als Beobachtungen in einem Sensornetzwerk als SOS zur Verf&#252;gung zu stellen.</abstract>
        <description>Dieser Beitrag besch&#228;ftigt sich damit, die Analyse von Social Media Daten als eine Art &#8222;Human Sensor&#8220; in einem Sensor Observation Service (SOS) bereitzustellen.

Hintergrund ist die M&#246;glichkeit,  welche die Analyse von Social Media Daten aus den unterschiedlichen Netzwerken, wie Twitter, Facebook, Flickr oder Youtube bietet. Vor allem im Bereich der Marketinganalyse und des Katastrophenmanagements wird dies ein immer h&#228;ufiger genutztes Werkzeug. Die Relevanz des Raumbezugs bei Social Media zeigt der Prototyp einer Arbeit, welcher die Ergebnisse einer gefilterten Twitter-Suche &#252;ber einfache kartographische Darstellungsformen r&#228;umlich visualisiert (http://tweetmap.fh-mainz.de).  Durch den Einsatz von von Natural Language Processing (NLP), z.B. der Sentimental Analyse,  k&#246;nnen Social Media Daten hinsichtlich des Inhaltes untersucht werden. Aus diesen Untersuchungen lassen sich detailliertere Informationen, &#228;hnlich zu physikalisch gemessenen Ph&#228;nomenen gewinnen. Dadurch lassen sich Social Media Daten zu einem Human Sensor wandeln. Unter Human Sensors versteht man ein Messmodell, in dem Menschen neben physikalischen Messungen, wie z.B durch Fitnessarmb&#228;nder, auch subjektive &#8222;Messungen&#8220; wie Sinneseindr&#252;cke, Empfindungen oder pers&#246;nliche Beobachtungen beitragen (vgl. Resch et al1).

Die Nutzung von Social Media basierten Human-Sensors gewinnt zudem an Bedeutung, wenn diese Daten in den Zusammenhang mit anderen Datenquellen, wie z.B. Umweltinformationen, gesetzt werden k&#246;nnen. Eine Herausforderung dieser Zusammenf&#252;hrung ist die Interoperabilit&#228;t zwischen den Daten. Diese kann durch den Einsatz von Standards erreicht werden.

Der hier vorgestellt Ansatz basiert auf dem Sensor Observation Service (SOS) aus dem Bereich des Sensor Web Enablements (SWE). Die Kombination der oben genannten Bereiche (Raum/Zeit, NLP, Human Sensor) ergibt hierf&#252;r eine Sensordatenquelle in einem SOS-Netzwerk. In diesem Netzwerk k&#246;nnen die so verwalteten Information mit anderen r&#228;umlichen Sensordaten kombiniert werden.
Der Beitrag fokussiert dabei die Konzeption und Entwicklung eines Systems, welches die M&#246;glichkeit bietet, Daten aus Social Media Netzwerken (zun&#228;chst beispielhaft mit Twitter) und deren Analyse (NLP), als Beobachtungen in einem Sensornetzwerk als SOS zur Verf&#252;gung zu stellen. Zudem werden Ans&#228;tze gezeigt die gesammelten Daten r&#228;umlich und zeitlich zu visualisieren. Das System basiert ausschlie&#223;lich auf FOSS Komponenten, wie die aus der 52&#176;North Sensor Web Community oder Projekten aus dem Spring Framework.

*1: http://www.berndresch.com/download/work/publications/resch_et_al_people_as_sensors_agit2011.pdf</description>
        <persons>
          <person id="330">Nikolai Bock</person>
        </persons>
        <links>
        </links>
      </event>
      <event guid="none" id="669">
        <date>2014-03-20T14:00:00+01:00</date>
        <start>14:00</start>
        <duration>00:30</duration>
        <room>H2</room>
        <slug></slug>
        <title>opencaching.de</title>
        <subtitle>Die deutsche Geocaching-Plattform </subtitle>
        <track>Vorträge (OSM)</track>
        <type>lecture</type>
        <language></language>
        <abstract>Erfahren Sie, wie Sie mit dem GPS auf Schatzsuche gehen k&#246;nnen. Das facettenreiche Hobby Geocaching spricht verschiedenste Zielgruppen an und die freie Plattform Opencaching.de erm&#246;glicht jedem Interessierten die aktive Mitgestaltung und Weiterentwicklung dieses Hobbys.</abstract>
        <description>Pra&#228;mbel: Angeregt durch den OSM-Podcast Nr. 24 wurde zwischen uns, Peter K&#246;rner und den anderen Anwesenden im Mumble-Chat ein kleines "Interview" zum Thema Opencaching abgehalten. Nach dem Interview war man sich einig, dass "wir" uns bei der FOSGISS mit einem Beitrag bewerben sollten und unser Hobby, unsere Plattform und die dabei verwendete Technik des OSM Kartenmaterials vorstellen sollten. Dar&#252;ber hinaus stellte man fest, dass die so genannten "Mapping-Partys" themenbezogen auch gut als Event auf unserer Plattform gelistet und "organisiert" werden k&#246;nnen. Ein fr&#252;herer Versuch bei der Plattform geocaching.com schlug fehl, da die Nutzungsbedingungen ein solchen Event nicht zulassen w&#252;rden. "Wir" als OpenSource-Projekt stehen daf&#252;r aber dahinter und m&#246;chten uns im Rahmen der FOSSGIS einmal vorstellen. Wir hoffen, dass unsere Einreichung, die erst kurzfristig zusammengestellt wurde, ausreicht, um das Interesse f&#252;r einen Vortrag von uns zu wecken. Daher stellen wir hier, uns und unsere Bereiche, die wir anrei&#223;en wollen schon mal vor. Die FOSSGIS als Konferenz haben wir bislang leider nicht wahrgenommen und sind daher bem&#252;ht unseren Vortrag passend und interessant vorzubereiten.

Geocaching

Geocaching ist DIE Form der modernen Schatzsuche. W&#228;hrend man fr&#252;her auf den Boden schaute um sich an Papierschnipsel o.&#228;. zu orientieren, l&#228;uft man heute auf der Suche nach dem "Schatz" mit einem GPS-Ger&#228;t durch Stadt und Land.
Um etwas weiter auszuholen: Geocaching entstand im Jahr 2000 und wurde erst dadurch m&#246;glich, dass die USA die Genauigkeit des GPS-Signals f&#252;r Jedermann deutlich verbesserte, wodurch es auch Privatpersonen m&#246;glich wurde, einen konkreten Punkt zielgenau zu finden. Am Ende der Suche steht fast immer ein verschieden gro&#223;er Beh&#228;lter, der immer ein Logbuch, in das sich der Finder eintr&#228;gt, und je nach Gr&#246;&#223;e noch weitere Gegenst&#228;nde enth&#228;lt. Die Gr&#246;&#223;en variieren von Nano, einem sehr kleinen Beh&#228;lter mit einem etwa centgro&#223;en Durchmesser, bis sehr gro&#223;, was Tonnen, F&#228;sser, oder noch gr&#246;&#223;ere Verstecke bezeichnet.

Nachdem man den ersten versteckten Cache, der sich in Oregon, USA befand, heute als Traditional Cache bezeichnen w&#252;rde, bei dem die Zielposition von vornherein angegeben ist, haben sich mit der Zeit verschiedene andere Arten von Caches entwickelt. So gibt es Mystery-Caches, bei denen meist im Vorfeld R&#228;tsel zu l&#246;sen sind, um die Position des Cachebeh&#228;lters zu ermitteln. Au&#223;erdem gibt es Multi-Caches, bei denen auf einer mehr oder weniger langen Wanderung verschiedene Stationen angelaufen werden m&#252;ssen, an denen man die Koordinaten der n&#228;chsten Station entweder erh&#228;lt oder err&#228;tseln muss. Eine Sonderform stellen virtuelle Caches dar, bei denen kein Beh&#228;lter zu suchen ist, sondern meist Informationen eingeholt werden m&#252;ssen, um ein Logpasswort zu ermitteln. 


Plattformen

Nat&#252;rlich haben sich in der Zeit auch verschiedene Plattformen entwickelt, die den Geocachern die M&#246;glichkeit geben, die zu den Cache geh&#246;renden Listings online zu erstellen. Als erstes war da die US-amerikanische Plattform Geocaching.com, auf der heute auch weltweit die meisten Caches gelistet sind. Ohne eine (kostenfreie) Anmeldung ist das Angebot nicht nutzbar. F&#252;r &#252;ber die Grundfunktionen hinausgehende Features muss jedoch eine kostenpflichtige Mitgliedschaft abgeschlossen werden.
Dem gegen&#252;ber stehen verschiedene weitere Plattformen, darunter speziell f&#252;r den deutschsprachigen Raum Opencaching.de. Im Kern unterscheidet sich Opencaching.de zun&#228;chst dadurch von geocaching.com, dass den Besuchern/Nutzern der Plattform nahezu alle Dienste auch ohne eine Registrierung angeboten werden. So ist bspw. das Einsehen der Listings und auch der Download als aufbereitete Datei f&#252;r das GPS-Ger&#228;t jedermann m&#246;glich. Lediglich f&#252;r das Loggen der Caches sowie das Einstellen eigener Listings ist eine kostenfreie Registrierung notwendig, da hier nutzerbezogene Daten hinterlegt werden.


Opencaching.de

Opencaching.de entstand im Jahr 2005, zun&#228;chst als privates Projekt. F&#252;r die verschiedenen Aufgaben wie Entwicklung, Technik und Support bildeten sich Teams aus Freiwilligen. Die Plattform wurde von den Cachern gut angenommen. Schon nach drei Jahren war eine Anzahl von etwa 10.000 Listings verf&#252;gbar. Um die Plattform rechtlich auf sichere Beine zu stellen &#252;bernahm Ende 2006 die Deutsche Wanderjugend (DWJ) die Betreiberschaft. Au&#223;erdem stellte die DWJ auch finanzielle Mittel zur Weiterentwicklung und f&#252;r den Betrieb bereit. Die Deutsche Wanderjugend betrieb zu diesem Zeitpunkt bereits die Infoplattform Geocaching.de. 

Etwa 5 Jahre sp&#228;ter, im November 2011, war es dann soweit, dass Opencaching.de wieder auf eigene Beine gestellt werden sollte, um die Entwicklung voranzutreiben und einige andere notwendige Vorhaben umzusetzen. Es begann eine Phase, in der intern ausgelotet wurde, wer aus dem alten Team auch in Zukunft dabei sein w&#252;rde. Anschlie&#223;end wurde der Community das Vorhaben vorgestellt und auch dort nach neuen Unterst&#252;tzern gesucht. Zeitgleich begann auch die Suche nach einer geeigneten Rechtsform. Nach einiger Zeit formte sich dann das neue Team und der Verein kristallisierte sich als optimale Rechtsform heraus. Im Mai 2012 gr&#252;ndeten dann 15 Cacher den Verein Opencaching Deutschland e.V., der seitdem die Website betreibt. Wieder formierten sich neue Teams aus Freiwilligen, die seitdem f&#252;r den laufenden Betrieb und die Weiterentwicklung des Webangebots sorgen.

Seitdem hatte der Verein Zulauf und z&#228;hlt derzeit 26 Mitglieder. F&#252;r die Mitarbeit an der Plattform ist die Vereinsmitgliedschaft aber keine Pflicht. Daher arbeiten an der Plattform auch zahlreiche weitere Helfer mit, die jedoch nicht Vereinsmitglieder sind. Aufgabengebiete sind unter anderem der User-Support oder die Erweiterung des Wikis. Besonders wichtig sind allerdings die Bereiche Systemadministration und Softwareentwicklung, schon allein weil sie den Kern des Plattformbetriebes darstellen. Wie bei vielen Communityprojekten bestehen hier die meisten Engp&#228;sse, weshalb Opencaching.de immer auf der Suche nach ambitionierten PHP-Entwicklern ist. Neben der Umsetzung der von der Community gew&#252;nschten Funktionen haben Entwickler bei Opencaching.de sehr viele Freiheiten um auch eigene Ideen zu verwirklichen.

Opencaching.de ist Teil des Internationalen Opencaching-Netzwerkes. So werden weltweit noch 7 weitere Opencaching-Knoten in Europa und Nordamerika betrieben. Ein japanischer Knoten stellte nach dem T&#333;hoku-Erdbeben 2011 seinen Betrieb ein. Besonders nennenswert ist der Erfolg des polnischen Knotens, der in Polen mit gro&#223;em Abstand Marktf&#252;hrer ist. Sowohl die spanische als auch die italienische Opencaching-Plattform sind in die deutsche Plattform integriert und greifen auf dieselbe Datenbank zur&#252;ck. Durch die komplette &#220;bersetzung in diese drei Sprachen sowie in die englische Sprache erreicht Opencaching.de einen erweiterten Nutzerkreis au&#223;erhalb Deutschlands. Alle diese Plattformen sind aus fr&#252;heren Versionen des Quellcodes von Opencaching.de entstanden, mittlerweile haben sich die Quelltexte aber in zwei wesentliche Zweige auseinanderentwickelt. 


OpenSource

Nach der &#220;bernahme der Betreiberschaft durch den Verein wurde das open durch verschiedene Ma&#223;nahmen noch weiter vorangetrieben. So wurde etwa beschlossen, Diskussionen im Forum, soweit m&#246;glich, komplett &#246;ffentlich zu f&#252;hren. Der wohl wichtigste Schritt war aber die komplette Offenlegung des Quellcodes auf GitHub und damit verbunden, die Neulizenzierung des Quellcodes unter GNU GPL. In diesem Rahmen erfolgte auch die schon lange geplante Lizenzierung aller Inhalte unter CC BY-NC-ND 3.0. Insgesamt war die Neulizenzierung nur der letzte logische Schritt, nachdem Opencaching.de selbst komplett frei nutzbar war und viel Opensource-Software Verwendung findet. So kommt bspw. als Templatesystem Smarty zum Einsatz, das unter LGPL lizenziert ist. Aber auch das wichtigste visuelle Werkzeug innerhalb der Listingplattform, die Geocachekarte, die Anfang 2013 eine vollst&#228;ndige &#220;berarbeitung erfahren hat, sei hier zu nennen. 

Wo bisher auf Google Maps gesetzt wurde, steht nun das Kartenmaterial von OpenStreetMap an erster Stelle (erw&#228;hnt im OSM Podcast 16 - "Flopps tolle Karte"), einerseits weil die OSM als freies Communityprojekt vom Wesen her &#228;hnlich ist, andererseits aber auch, weil viele Geocacher die Trackaufzeichnungen ihrer Cachetouren sowie ihre Ortskenntnis daf&#252;r nutzen, das Kartenmaterial von OpenStreetMap mit eigenen Beitr&#228;gen zu erg&#228;nzen oder zu vervollst&#228;ndigen. Gerade in entlegenen Gegenden, in touristisch weniger erschlossenen Bereichen stellt man als Geocacher immer wieder fest, das zumindest der "Weg zur Dose" eingezeichnet ist, ein deutliches Zeichen f&#252;r den "Datenr&#252;cklauf" zum OpenStreetMap-Projekt.

Unterst&#252;tzung der Mapping-Partys

Aus dem Podcast Team heraus wurden wir angesprochen, ob man die Mapping-Partys nicht bei Opencaching.de listen kann um hier die Kommunikation und Organisation zu vereinfachen. Gerne stehen wir mit der Plattform bereit und bieten diese M&#246;glichkeiten. Denn auch interessierte Cacher, die durch ihre Wanderschaften in entlegenden Gebieten Wege/Daten sammeln k&#246;nnten sich anschlie&#223;en um zu erfahren wie man neue Pfade in die richtigen Kan&#228;le steckt. Eine Synergie, in der zwei Plattformen interagieren und sich unterst&#252;tzen k&#246;nnen.

Wir freuen uns auf die Teilnahme und sagen wie bei uns &#252;blich "bis bald - im Wald!"...</description>
        <persons>
          <person id="399">Michael Firschke</person>
        </persons>
        <links>
          <link href="http://www.opencaching.de">Portalseite von opencaching.de</link>
          <link href="https://github.com/OpencachingDeutschland/oc-server3">Repository des opencaching.de-Codes</link>
          <link href="https://code.google.com/p/opencaching-api">API f&#252;r die opencaching Knoten</link>
          <link href="http://www.opencaching.eu">&#220;bersicht &#252;ber das weltweite opencaching-Netzwerk</link>
        </links>
      </event>
      <event guid="none" id="749">
        <date>2014-03-20T14:30:00+01:00</date>
        <start>14:30</start>
        <duration>00:30</duration>
        <room>H2</room>
        <slug></slug>
        <title>Open Data und Selbstorganisation</title>
        <subtitle>Von den Public Space Invaders zur Berliner Gartenkarte</subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract></abstract>
        <description>Open Data und Selbstorganisation

Urbanistische Interventionen und bottom-up grassroots mapping im Lichte kollaborativer Aktionsforschung.

Public Space Invaders und die Berliner Gartenkarte setzen sich beide auf ihre Weise mit dem &#246;ffentlichen Stadtraum auseinander: Auf der einen Seite stehen Selbstorganisationsprozesse temor&#228;rer architektonischer Interventionen, auf der anderen die Visualisierung der Verteilung von Projekten der Urbanen Landwirtschaft in Berlin.

Vermittelt werden beide Aspekte durch die ausschlie&#223;liche Verwendung von Open Source Software und einer medientheoretischen Betrachtung der Prozesse als "Organisierte Netzwerke". Nicht nur flache Hierarchien der Selbstverwaltung oder dezentrale Kommunikationsstrukturen zeichnen diese Vorg&#228;nge empirisch aus, sondern auch ein Bekenntnis zur legalen Ausreizung des Urheberrechts zur Schaffung einer Wissensallmende.

Die Lizenzierung von Daten und Source Code erm&#246;glicht demnach neue Handlungsformen, die erst langsam in der Allgemeinheit Anerkennung finden. Leider f&#252;hren Mischformen noch allzu h&#228;ufig zu pr&#228;keren Arbeitsbeziehungen, da Kollaboration oftmals mit kostenloser Arbeit verwechselt wird.

Nun stellen wir uns die Frage, wie in Realisierung der gemeinschaftlichen Zukunft unserer Gesellschaften Offene Daten und dezentrale Prozesse dem Gemeinwohl dienen werden. Daher liegt ein gro&#223;es Augenmerk gegenw&#228;rtig auf der Sichtbarmachung bereits stattfindender Entwicklungen, um sie gemeinsam in einen gr&#246;&#223;eren Kontext zu stellen.

Ideellerweise helfen semantische Technologien dabei monistische Theorien durch ein Netz lokal definierter Ontologien zu ersetzen, um selbst die Epistemologie zu dezentralisieren. Wir arbeiten gemeinsam an der Schaffung neuer Sprachen der Selbstorganisation.
</description>
        <persons>
          <person id="436">Jon Richter</person>
        </persons>
        <links>
        </links>
      </event>
      <event guid="none" id="655">
        <date>2014-03-20T15:30:00+01:00</date>
        <start>15:30</start>
        <duration>00:30</duration>
        <room>H2</room>
        <slug></slug>
        <title>3D webservices - where do we stand?</title>
        <subtitle></subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract></abstract>
        <description>In den letzten Jahren entwickelten sich zahlreiche Open Source Projekte f&#252;r die Darstellung von 3D-Globen und 3D-Daten im Web. Die Standardisierung von Webservices, Datenformaten und Darstellungsmodellen ist daher ein sehr aktuelles Thema. Inbesondere sind sowohl auf OGC- wie auch auf W3C-Seite Bem&#252;hungen dazu im Gange. Das OGC hat ein Entwurfskantidat f&#252;r 3D Webservices, W3DS, publiziert. Der ISO X3D Standard schl&#228;gt ein XML-basiertes Dateiformat f&#252;r die Speicherung von 3D-Grafiken vor und das W3C &#252;berlegt sich, X3D-Rendering in HTML5 zu integrieren. Andere Projekte implementieren ihre eigenen Webservices und Formate.
Auf der Anwendungsseite unterst&#252;tzt GeoServer W3DS und X3D, die X3DOM Programmbibliothek schl&#228;gt eine m&#246;gliche Implementierung von X3D in HTML5 vor und nicht zuletzt erlauben WebGL-kompatible Browser die Darstellung der 3D-Daten auf der Client-Seite. Die OpenLayers Community arbeitet auf eine interoperable and performente  WebGL Darstellung um 4D Daten im Kombination mit Cesium Virtual Globe darzustellen und zu animieren.

Die Pr&#228;sentation wird die erw&#228;hnten Elemente weiter ausf&#252;hren, einige Beispiele der spannensten Implenentationen vorf&#252;hren und einen m&#246;glichen Weg zu einem 3D-Web f&#252;r die Open Source GIS-Community aufzeigen.</description>
        <persons>
          <person id="263">Emmanuel Belo</person>
        </persons>
        <links>
        </links>
      </event>
      <event guid="none" id="709">
        <date>2014-03-20T16:00:00+01:00</date>
        <start>16:00</start>
        <duration>00:30</duration>
        <room>H2</room>
        <slug></slug>
        <title>Brandenburg 3D - Geologische 3D-Untergrundmodelle im Browser</title>
        <subtitle></subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract></abstract>
        <description>Geologische Untersuchungskampagnen aus den Jahren 1950 bis 1980 auf dem Fl&#228;chengebiet des Bundeslands Brandenburg haben einen gewaltigen Fundus an geologischen Fachinformationen hervorgebracht. In dem Projekt Brandenburg 3D (kurz: B3D) wurde auf Grundlage dieser Tiefbohrungen und geologischen Schnitte ein dreidimensionales Untergrundmodell bestehend aus Schichtgrenzen, St&#246;rungszonen und Salzst&#246;cken modelliert.

Um die Ergebnisse des Projekts an zentraler Stelle zu ver&#246;ffentlichen und ohne fachspezifische Software zug&#228;nglich zu machen, wurde eine kombinierte WebGIS-Architektur entwickelt, die es erlaubt sowohl die vorhandenen zwei- als auch dreidimensionalen Daten &#252;ber den Browser abzurufen. Zu den hier eingesetzten Komponenten z&#228;hlen OpenLayers, GeoExt 2, Ext JS 4, X3DOM, PostGIS 2 und GeoServer.

Alle Daten zu Bohrungen, Tiefenprofilen und geologischen Verbreitungsfl&#228;chen wurden aufbereitet, in einer PostGreSQL/PostGIS Datenbank abgelegt und &#252;ber den GeoServer publiziert. F&#252;r die 3D-Daten kam hierbei der W3DS (Web 3D Service) zum Einsatz, der die Daten als Szenengraph liefert und clientsetig eine volle Interaktion und Navigation erm&#246;glicht. Die Basis f&#252;r den 3D-Client ist das Framework X3DOM, welches im Rahmen des Projekts &#252;ber eine eigene Bibliothek mit Ext JS verbunden wurde, sodass eine einfache Kommunikation zwischen diesen stattfinden kann. Das entwickelte WebGIS basiert rein auf JavaScript und es besteht damit keine Notwendigkeit von Browser-Plugins.

Dieser Vortrag pr&#228;sentiert die technischen Grundlagen der eingesetzten Architektur mit einem Fokus auf die 3D-Visualisierung und die hierauf aufbauenden Client-Funktionalit&#228;ten, z.B. das Generieren virtueller Profilschnitte an beliebiger Stelle des Untergrundmodells.</description>
        <persons>
          <person id="416">Daniel Koch</person>
        </persons>
        <links>
          <link href="http://">http://</link>
        </links>
      </event>
      <event guid="none" id="731">
        <date>2014-03-20T16:30:00+01:00</date>
        <start>16:30</start>
        <duration>00:30</duration>
        <room>H2</room>
        <slug></slug>
        <title>3D City Database v3.0</title>
        <subtitle></subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract></abstract>
        <description>Die 3D City Database (3DCityDB) wurde auf der letzten FOSSGIS in Rapperswil vorgestellt. Es handelt sich dabei um eine freie Datenbankl&#246;sung, mit der CityGML-basierte 3D Stadtmodelle in Oracle Spatial oder PostgreSQL/PostGIS gespeichert werden k&#246;nnen. &#220;ber eine Java-Applikation k&#246;nnen CityGML Dokumente beliebiger Gr&#246;&#223;e in die Datenbank geschrieben und auch wieder in Dateien exportiert werden.

F&#252;r das n&#228;chste Fr&#252;hjahr ist mit Version 3.0 ein neuer Major-Release f&#252;r die 3DCityDB geplant. Neben der vollen Unterst&#252;tzung von CityGML 2.0.0 (u.a. Br&#252;cken, Tunnel) wird die Datenbank auch &#252;ber einen Web Feature Service 2.0 ansprechbar sein. Das vereinfacht die Einbindung der 3DCityDB in eine Geodateninfrastruktur. Die Filterm&#246;glichkeiten eines WFS (gem&#228;&#223; dem OGC Filter Encoding Standard) werden ebenfalls in den Teilmodulen des Importer/Exporter umgesetzt, damit z.B. viel pr&#228;zisere Objektexporte aus der Datenbank m&#246;glich sind.

Die 3DCityDB wird wie viele andere Open-Source-Projekte ab sofort auf GitHub weiterentwickelt. Die bisher parallel entwickelten Importer/Exporter-Versionen f&#252;r Oracle und PostgreSQL werden in einer gemeinsame Schnittstelle aufgehen, so dass eine Unterst&#252;tzung weiterer Datenbanksysteme leichter umzusetzen w&#228;re.

Der Vortrag wird dieses Mal einige Features live vorf&#252;hren. Wer sich f&#252;r die Hintergr&#252;nde des Projektes und technische Details der Software interessiert, dem sei das Abstract und die Slides von meinem Vortrag auf der FOSSGIS 2013 (http://www.fossgis.de/konferenz/2013/programm/events/588.de.html) bzw. ein Besuch auf der Homepage der 3DCityDB (www.3dcitydb.net) empfohlen.</description>
        <persons>
          <person id="306">Felix Kunde</person>
        </persons>
        <links>
        </links>
      </event>
      <event guid="none" id="648">
        <date>2014-03-20T17:00:00+01:00</date>
        <start>17:00</start>
        <duration>00:30</duration>
        <room>H2</room>
        <slug></slug>
        <title>Scientific 3D Printing with GRASS GIS</title>
        <subtitle>A work in progress report</subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract></abstract>
        <description>As the amount of scientific data continues to grow, researchers need new tools to help them visualize complex data. Immersive data-visualisations are helpful, yet fail to provide tactile feedback and sensory feedback on spatial orientation, as provided from tangible objects. The gap in sensory feedback from virtual objects leads to the development of tangible representations of geospatial information to solve real world problems. Examples are animated globes, interactive environments like tangible GIS, and on demand 3D prints.

The production of a tangible representation of a scientific data set is one step in a line of scientific thinking, leading from the physical world into scientific reasoning and back: The process starts with a physical observation, or from a data stream generated by an environmental sensor. This data stream is turned into a geo-referenced data set. This data is turned into a volume representation which is converted into command sequences for the printing device, leading to the creation of a 3D printout. As a last, but crucial step, this new object has to be documented and linked to the associated metadata, and curated in long term repositories to preserve its scientific meaning and context.

The workflow to produce tangible 3D data-prints from science data at the German Research Centre for Geosciences (GFZ) was implemented as a software based on the Free and Open Source Geoinformatics tools GRASS GIS and Paraview.

The workflow was successfully validated in various application scenarios at GFZ using a RapMan printer to create 3D specimens of elevation models, geological underground models, ice penetrating radar soundings for planetology, and space time stacks for Tsunami model quality assessment. 

While these first pilot applications have demonstrated the feasibility of the overall approach, current research focuses on the provision of the workflow as Software as a Service (SAAS), thematic generalisation of information content and long term curation.
</description>
        <persons>
          <person id="270">Peter L&#246;we</person>
        </persons>
        <links>
        </links>
      </event>
      <event guid="none" id="758">
        <date>2014-03-20T17:45:00+01:00</date>
        <start>17:45</start>
        <duration>01:00</duration>
        <room>H2</room>
        <slug></slug>
        <title>PostNAS Anwendertreffen</title>
        <subtitle>Projekt rund um den Import von ALKIS Daten &#252;ber OGR</subtitle>
        <track>Anwendertreffen</track>
        <type>user_meeting</type>
        <language></language>
        <abstract>Auf der FOSSGIS 2014 wird es ein PostNAS Anwendertreffen geben, auf dem aktuellen Entwicklungen im PostNAS-Projekt, die PostNAS-Entwicklungen von NORBIT f&#252;r QGIS und Web-GIS und auch die PostNAS Integration in Mapbender3 vorgestellt werden sollen.

Weitere Informationen finden sich unter: 

http://trac.wheregroup.com/PostNAS/wiki/PostNASAnwendertreffen2014-03-20
</abstract>
        <description></description>
        <persons>
          <person id="65">Astrid Emde</person>
          <person id="70">Olaf Knopp</person>
        </persons>
        <links>
          <link href="http://map.krz.de/?Themen:ALKIS">PostNAS Demo KRZ Lemgo</link>
          <link href="http://postnas.org/">PostNAS Projektseite</link>
          <link href="http://trac.wheregroup.com/PostNAS/wiki/PostNASAnwendertreffen2014-03-20">PostNAS Anwendertreffen auf der FOSSGIS 2014</link>
        </links>
      </event>
    </room>
    <room name="H3">
      <event guid="none" id="725">
        <date>2014-03-20T09:00:00+01:00</date>
        <start>09:00</start>
        <duration>00:30</duration>
        <room>H3</room>
        <slug></slug>
        <title>OpenStreetMap-Daten in der RoboCup Rescue Simulation League</title>
        <subtitle></subtitle>
        <track>Vorträge (OSM)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Die RoboCup Rescue Simulation League ist ein Simulationswettbewerb, bei dem autonome Agenten Katastrophenszenarien bew&#228;ltigen m&#252;ssen. Dieser Vortrag beschreibt, wie wir OpenStreetMap-Daten verwenden, um neue Szenarien f&#252;r die Liga zu erstellen.

</abstract>
        <description>Bei der RoboCup Rescue Simulation League handelt es sich um einen
Wettbewerb, bei dem Teams von Software-Agenten die Folgen einer
simulierten Katastrophe in einer Gro&#223;stadt bew&#228;ltigen
m&#252;ssen. Simulierte Ambulanzen, Feuerwehren und R&#228;umtrupps m&#252;ssen dabei
Br&#228;nde unter Kontrolle halten und Versch&#252;ttete retten, was durch
begrenzte Sicht und Kommunikation erschwert wird.

Die Simulationsliga dient zwei unterschiedlichen Zwecken: Zum einen
der Erforschung heterogener Multi-Agentensysteme, zum anderen der
Entwicklung realistischer Simulatoren und Systeme die bei der
Bew&#228;ltigung solcher Katastrophen hilfreich sein k&#246;nnen. Das
Simulationssystem wird im Rahmen eines Open-Source-Projekts
weiterentwickelt.

Realistische Stadtkarten sind dabei f&#252;r die Simulation enorm wichtig.
Lange Zeit waren offizielle GIS-Daten die einzige M&#246;glichkeit,
realistische Karten f&#252;r die Simulation League zu erzeugen. Solche
Daten waren jedoch nur begrenzt verf&#252;gbar, und restriktive
Lizenzbedingungen h&#228;tten es zum Teil unm&#246;glich gemacht, die
resultierenden Rescue-Karten frei zu ver&#246;ffentlichen.

Daher ist OpenStreetMap eine ideale Datenquelle f&#252;r die Liga: So gut
wie jede gr&#246;&#223;ere Stadt (und viele kleinere St&#228;dte) sind detailliert
gemappt, die Daten sind unter einer freien Lizenz verf&#252;gbar in einem
weltweit einheitlichen Format verf&#252;gbar.

Dieser Vortrag stellt die RoboCup Rescue Simulation League vor,
beschreibt die Unterscheide und Gemeinsamkeiten zwischen den
verwendeten Datenmodellen und denen von OpenStreetMap und die
Herausforderungen die bei der Konvertierung zwischen den Formaten
auftraten.
</description>
        <persons>
          <person id="425">Moritz G&#246;belbecker</person>
        </persons>
        <links>
          <link href="http://roborescue.sourceforge.net/">http://roborescue.sourceforge.net/</link>
          <link href="http://kaspar.informatik.uni-freiburg.de/~osm/">http://kaspar.informatik.uni-freiburg.de/~osm/</link>
        </links>
      </event>
      <event guid="none" id="696">
        <date>2014-03-20T09:30:00+01:00</date>
        <start>09:30</start>
        <duration>00:30</duration>
        <room>H3</room>
        <slug></slug>
        <title>Tatort Niederbayern</title>
        <subtitle></subtitle>
        <track>Vorträge (OSM)</track>
        <type>lecture</type>
        <language></language>
        <abstract>Niederbayerische Mapper berichten aus ihren Ortsgruppen &#252;ber die Zusammenarbeit mit Beh&#246;rden, OpenStreetMap an der Universit&#228;t, Presse- und &#214;ffentlichkeitsarbeit, lokale Aktionen und vieles mehr.</abstract>
        <description>Die deutsche OpenStreetMap-Karte zeigt es auf den ersten Blick: In vielen St&#228;dten gibt es lokale Stammtische und Mappertreffen. So sehr OSM auch auf moderne Browsertechnologien, Crowdsourcing und "soziale" Features in der Website setzt: Ein wichtiges Standbein der Community bleiben die lokalen Treffen von Mapping-Enthusiasten.

In Niederbayern gibt es gleich zwei aktive Stammtische &#8211; in Passau und Landshut &#8211; die zudem viertelj&#228;hrlich ein niederbayernweites Treffen ausrichten. Diese pers&#246;nlichen Begegnungen sind wichtig, sie ermutigen die Anwesenden sich weiterhin zu beteiligen, informieren &#252;ber Neuigkeiten und f&#252;hren vor allem zur Planung neuer Projekte und Aktionen.

In diesem Vortrag stellen Mapper aus Niederbayern viele der Aktivit&#228;ten aus erster Hand vor. Sie berichten von Erfahrungen mit der Zusammenarbeit zwischen Community und Beh&#246;rden, den vielseitigen OSM-Projekten der Passauer Universit&#228;t, der Arbeit mit Presse und &#214;ffentlichkeit und nicht zuletzt den Fortschritten bei der Kartographierung Niederbayerns.

Angesichts der Vielzahl interessanter und informativer Themen d&#252;rfte jeder Zuh&#246;rer die eine oder andere Anregung vom Vortrag mit nach Hause nehmen. Und vielleicht gibt das ja den Ansto&#223;, selbst zum regelm&#228;&#223;igen Besucher eines lokalen Treffens zu werden &#8211; oder sogar eines zu gr&#252;nden.</description>
        <persons>
          <person id="442">Alexander Lehner</person>
          <person id="334">Peter Barth</person>
          <person id="144">Tobias Knerr</person>
        </persons>
        <links>
          <link href="https://wiki.openstreetmap.org/wiki/Passau">Seite der Passauer Mapper</link>
          <link href="https://wiki.openstreetmap.org/wiki/Landshut">Seite der Landshuter Mapper</link>
        </links>
      </event>
      <event guid="none" id="635">
        <date>2014-03-20T10:00:00+01:00</date>
        <start>10:00</start>
        <duration>00:30</duration>
        <room>H3</room>
        <slug></slug>
        <title>Datenschutz bei der Erhebung und Verarbeitung von geografischen Informationen</title>
        <subtitle></subtitle>
        <track>Vorträge (OSM)</track>
        <type>lecture</type>
        <language></language>
        <abstract></abstract>
        <description>Die Erhebung und Verarbeitung von Geodaten wirft eine Reihe von datenschutzrechtlichen Fragen auf. Auch in der Rechtswissenschaft herrscht bei der Beurteilung gro&#223;e Unsicherheit. So ist es bereits mit Schwierigkeiten verbunden, eine verl&#228;ssliche Aussage dar&#252;ber zu treffen, ob und wann ein geographisches Datum gleichzeitig ein personenbezogenes Datum darstellen.

Der Beitrag analysiert zun&#228;chst die Voraussetzungen, wann personenbezogene Daten im Sinne des Bundesdatenschutzgesetzes vorliegen. Sodann wird diese Problematik auf den Bereich von Geodaten bezogen. Am Ende des Beitrags werden Kriterien herausgearbeitet, die es erm&#246;glichen, problematische Geodaten zu identifizieren.

Der Vortrag richtet sich sowohl an Mitwirkende des Open Street Map Projektes als Erfasser von Geodaten als auch an Verwender von Geoinformationssystemen als Verarbeiter von Geodaten. </description>
        <persons>
          <person id="147">Falk Zscheile</person>
        </persons>
        <links>
        </links>
      </event>
      <event guid="none" id="678">
        <date>2014-03-20T11:00:00+01:00</date>
        <start>11:00</start>
        <duration>00:30</duration>
        <room>H3</room>
        <slug></slug>
        <title>Revertieren - aber richtig</title>
        <subtitle>Jeder darf in OpenStreetMap alles eintragen. Aber wie wird man es wieder los?</subtitle>
        <track>Vorträge (OSM)</track>
        <type>lecture</type>
        <language></language>
        <abstract></abstract>
        <description>Was das Revertieren unerw&#252;nschter Edits betrifft, so steckt OpenStreetMap noch in den Kinderschuhen. Wo die Wikipedia schon seit Urzeiten eine Revertierung von Spam oder Vandalismus per Mausklick erm&#246;glicht, da verheddert man sich bei OpenStreetMap mit seinen vielen gegenseitigen Abh&#228;ngigkeiten im Datenmodell ganz schnell in einem Dickicht - und das schlimmste ist, dass alles, was beim beim Reparaturversuch vor&#252;bergehend kaputtmacht, auch noch auf alle Zeiten gut sichtbar in der Historie dokumentiert ist.

Frederik Ramm kann davon ein Lied singen und behandelt in diesem Vortrag eingehend die Ursachen f&#252;r die Komplexit&#228;t von Reverts in OpenStreetMap. Verschiedene h&#228;ufige Szenarien werden vorgestellt und Strategien zur ihrer Bereinigung diskutiert. Dabei kommen die existierenden (Perl-)Skripte zur Anwendung, aber der Vortrag richtet sich durchaus auch an Programmierer, die auf diesem wichtigen Gebiet an eigenen L&#246;sungen basteln m&#246;chten. 
</description>
        <persons>
          <person id="95">Frederik Ramm</person>
        </persons>
        <links>
        </links>
      </event>
      <event guid="none" id="695">
        <date>2014-03-20T11:30:00+01:00</date>
        <start>11:30</start>
        <duration>00:30</duration>
        <room>H3</room>
        <slug></slug>
        <title>Eine Undo-Logik f&#252;r OpenStreetMap</title>
        <subtitle>M&#246;glichkeiten und Grenzen der Qualit&#228;tssicherung</subtitle>
        <track>Vorträge (OSM)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract></abstract>
        <description>Die OpenStreetMap-Community treibt aus mehreren Gr&#252;nden das Problem um, &#196;nderungen verfolgen und ggf. r&#252;ckg&#228;ngig machen zu k&#246;nnen. Verglichen wird dies gerne mit der R&#252;ckg&#228;ngig-Funktion in der MediaWiki-Software.

Da OpenStreetMap aber nicht aus einzelnen Dokumenten besteht, sondern eine zusammenh&#228;ngende Datenbank bildet, gibt es bis heute kein &#252;berzeugendes Konzept dazu, wie ein Ausschnitt r&#252;ckg&#228;ngig gemacht werden kann.

In diesem Vortrag werden wir zun&#228;chst anhand historischer Mapping-Unf&#228;lle ausleuchten, welchen Bedarf es realistischerweise f&#252;r &#196;nderungsverfolgung gibt und welche Einheiten von Daten man gerne r&#252;ckg&#228;ngig gemacht h&#228;tte oder hat. Dies m&#252;ndet in einem Konzept, wie ein bequemes Tool zum r&#252;ckg&#228;ngig machen funktionieren m&#252;sste.

Im zweiten Teil des Vortrages werden wir dann die neue Funktionalit&#228;t der Overpass API vorstellen und erl&#228;utern, welchen Teil des zuvor skizzierten Tools sie abdeckt.
</description>
        <persons>
          <person id="280">Roland Olbricht</person>
        </persons>
        <links>
        </links>
      </event>
      <event guid="none" id="738">
        <date>2014-03-20T12:00:00+01:00</date>
        <start>12:00</start>
        <duration>00:30</duration>
        <room>H3</room>
        <slug></slug>
        <title>OSM-Stra&#223;enlistenauswertung</title>
        <subtitle>Vorstellung und Auswertungsergebnisse</subtitle>
        <track>Vorträge (OSM)</track>
        <type>lecture</type>
        <language></language>
        <abstract>Wie gut sind die Stra&#223;ennamen in den deutschen Gemeinden in OSM bereits erfasst? Auf Basis amtlicher Stra&#223;enlisten werden Soll-/Ist Auswertungen erstellt. Helfen die Auswertungen zur beschleunigten Erfassung der noch fehlenden Stra&#223;ennamen?</abstract>
        <description>* Wurzeln der Stra&#223;enauswertung: aufgegebene Auswertungen von Florian Lohoff und Sven Anders.
* Aufbau des Systems und aktueller Bestand an Stra&#223;enlisten; einige Zahlen zum Datenumfang.
* OSM-Lizenzumstellung 2012: damalige Auswirkungen; Auswirkungen bis heute?
* Aktuelle Stra&#223;ennamen-Abdeckung und historische OSM-Entwicklung bis heute, auf Basis der vollen historischen OSM-Daten.
* Ursprung der Stra&#223;enlisten und zeitliche Entwicklung vor und nach Verf&#252;gbarkeit einer Stra&#223;enliste.
* Verf&#252;gbare OpenData Dienste, die zur Erfassung von Stra&#223;ennamen herangezogen werden k&#246;nnten. Und sollten?
* Mittel, um OSM-Mapper zur Erfassung zu motivieren.
</description>
        <persons>
          <person id="401">Dietmar Seifert</person>
        </persons>
        <links>
          <link href="http://regio-osm.de/listofstreets/index.html">Startseite der Auswertung</link>
          <link href="http://regio-osm.de/listofstreets/kartenuebersicht.html">Grafische Darstellung der Stra&#223;ennamen-Abdeckung nach Bundesl&#228;ndern</link>
          <link href="http://regio-osm.de/listofstreets_wiki">Stra&#223;enlisten-Wiki zur Verwaltung der offiziellen Stra&#223;enlisten</link>
        </links>
      </event>
      <event guid="none" id="752">
        <date>2014-03-20T13:30:00+01:00</date>
        <start>13:30</start>
        <duration>00:30</duration>
        <room>H3</room>
        <slug></slug>
        <title>Lightning Talks OSM</title>
        <subtitle></subtitle>
        <track>Lightning Talks (OSM)</track>
        <type>lecture</type>
        <language></language>
        <abstract></abstract>
        <description></description>
        <persons>
        </persons>
        <links>
        </links>
      </event>
      <event guid="none" id="661">
        <date>2014-03-20T14:00:00+01:00</date>
        <start>14:00</start>
        <duration>00:30</duration>
        <room>H3</room>
        <slug></slug>
        <title>H&#246;henbewusstes Routing mit Radardaten</title>
        <subtitle>Grenzen und Probleme bei 90m-SRTM</subtitle>
        <track>Vorträge (OSM)</track>
        <type>lecture</type>
        <language></language>
        <abstract></abstract>
        <description>H&#246;hendaten aus Radarmessungen wie der Shuttle-Radar-Topography-Misssion (SRTM) lassen sich auch verwenden, um h&#246;henbewusste Routing-Anwendungen zu implementieren. Der global verf&#252;gbare 90m-SRTM Datensatz ist daf&#252;r jedoch nur bedingt geeignet, da durch das grobe Raster grosse Interpolationfehler entstehen und ausserdem durch die nur teilweise Durchdringung des Radars durch Vegetation insbesondere an Waldkanten st&#246;rende Artefakte entstehen. Gleichzeitig gibt es aber steigenden Bedarf f&#252;r h&#246;henbewusstes Routing, da mit dem Aufkommen der Elektromobilit&#228;t nicht mehr nur Radfahrer mit dem Problem der begrenzten Energiereserven konfrontiert sind. Grund genug also, sich mal anzuschauen, was mit 90m-SRTM m&#246;glich ist. H&#246;henbewusstes Routing muss einerseits frei sein von Artefakten - Problemstellen wie enge Flusst&#228;ler, Waldkanten, Tunnel oder Hochhaussiedlungen d&#252;rfen also nicht mit unechten H&#246;hensignalen Routingentscheidungen beeinflussen. Andererseits soll das Routing aber auch f&#252;r kleinere H&#252;gel sensitiv sein. Dieser Zielkonflikt erfordert einen sinnvollen Kompromiss in Form eines Tiefpassfilters, der kleinere H&#246;hendifferenzen herrausfiltert, so dass letztlich keines der beiden Ziele vollst&#228;ndig erreicht werden kann. Deswegen soll der Frage nachgegangen werden, inwiefern mit besseren H&#246;hendaten bessere Routingergebnisse erzielt werden k&#246;nnen und die verf&#252;gbaren Daten gegen&#252;bergestellt werden.  
</description>
        <persons>
          <person id="397">Arndt Brenschede</person>
        </persons>
        <links>
        </links>
      </event>
      <event guid="none" id="681">
        <date>2014-03-20T14:30:00+01:00</date>
        <start>14:30</start>
        <duration>00:30</duration>
        <room>H3</room>
        <slug></slug>
        <title>OSM-Geocoding mit Solr</title>
        <subtitle></subtitle>
        <track>Vorträge (OSM)</track>
        <type>lecture</type>
        <language></language>
        <abstract></abstract>
        <description>Die Informationstiefe von OpenStreetMap w&#228;chst rasant und &#252;bertrifft teilweise die der kommerziellen Anbieter deutlich. Diese Informationen sind zumeist visuell als Karte zug&#228;nglich. Die Daten textuell durchsuchbar zu machen ist vergleichsweise komplizierter aber nicht weniger relevant. Aktuelle Open-Source-L&#246;sungen zur Durchsuchung von OSM-Daten hinken deshalb den kommerziellen Angeboten deutlich hinterher.
Komoot (www.komoot.de) hat erst k&#252;rzlich seinen intern entwickelten Geo-Coder *photon* als Open Source ver&#246;ffentlicht. Damit ebnen wir den Weg zu einer gemeinschaftlichen Entwicklung eines Geo-Coders unter Verwendung des aktuellen Stands der Technik.

Photon verwendet *Apache Solr*, eine effiziente und hochskalierbare Suchtechnologie mit zahlreichen Features, darunter Volltextsuche und r&#228;umliche Abfragen. Mehrsprachigkeit sowie kontinuierliche Suche w&#228;hrend der Texteingabe werden unter anderem unterst&#252;tzt.

Der Vortrag wird auf die Problemstellung n&#228;her eingehen sowie die St&#228;rken und Schw&#228;chen von photon beleuchten. Gerne stellen wir uns Fragen und Anregungen aus dem Publikum.

Unter www.komoot.de kann *photon* im live Betrieb begutachtet werden, n&#228;here Infos zum Projekt finden sich auf github: https://github.com/komoot/photon</description>
        <persons>
          <person id="405">Christoph Lingg</person>
        </persons>
        <links>
          <link href="http://www.komoot.de">komoot.de</link>
          <link href="https://github.com/komoot/photon">photon auf github</link>
        </links>
      </event>
      <event guid="none" id="747">
        <date>2014-03-20T15:30:00+01:00</date>
        <start>15:30</start>
        <duration>00:30</duration>
        <room>H3</room>
        <slug></slug>
        <title>Client Side Map Rendering</title>
        <subtitle></subtitle>
        <track>Vorträge (OSM)</track>
        <type>lecture</type>
        <language></language>
        <abstract>Karten f&#252;r das Internet wurden bisher auf dem Server gerendert und als Bild ausgeliefert. Inzwischen k&#246;nnen die Daten aber mit Technologien wie SVG, 2D Canvas oder WebGL auch auf dem Client verarbeitet und angezeigt werden. Internationalisierung und Interaktion kommt dabei nicht zu kurz.</abstract>
        <description>Rendering maps on the client becomes more important as technologies emerge and devices get faster. While most maps are still served as raster tiles, there is a case for delivering vectors to the client. In this talk, I'll review existing rendering techniques and data formats, as well as point out their advantages and disadvantages.

**Rendering Technologies:** Whether it's SVG or 2D Canvas to draw the map on the client, speed is always of the essence when . We're also going to have a look at using existing C/C++ based renderers in the browser. Finally WebGL and OpenGL open up a new world of possibilities for rendering on mobile and in the browser.

It's a long way from the OpenStreetMap world extract to a manageable data size that we can serve to clients and process on weaker hardware. Additionally, data structures that are suited for rendering look different than for storing the raw source data.

**Text Shaping and Rendering:** Typically, text shaping is one of the lower priority items, but it is vital for multilingual and multi-script maps in non-latin languages. We're going to look at open source software that can lay out text correctly and how to leverage it on the client side.

**Interaction** with the map becomes a lot easier and more intuitive because all the raw data is available on the client and we can redraw the map based on user interaction without costly roundtrips to the server.
</description>
        <persons>
          <person id="433">Konstantin K&#228;fer</person>
        </persons>
        <links>
        </links>
      </event>
      <event guid="none" id="636">
        <date>2014-03-20T16:00:00+01:00</date>
        <start>16:00</start>
        <duration>00:30</duration>
        <room>H3</room>
        <slug></slug>
        <title>Generalisierung von OpenStreetMap-Daten</title>
        <subtitle></subtitle>
        <track>Vorträge (OSM)</track>
        <type>lecture</type>
        <language></language>
        <abstract>Karten auf Basis von OpenStreetMap-Daten sind - wie auch viele andere Internet-Karten - bei geringen Vergr&#246;&#223;erungen oft schlecht lesbar und wenig ansprechend.  Dieser Vortrag erl&#228;utert die Ursachen hierf&#252;r sowie m&#246;gliche Wege, dies durch automatische Generalisierung der Daten zu verbessern.</abstract>
        <description>OpenStreetMap-Daten werden zunehmend f&#252;r die Produktion von Landkarten aller Art eingesetzt. Hierbei wird jedoch fast immer, egal ob es sich um eine Weltkarte oder um einen Innenstadt-Plan handelt, die Darstellung direkt aus den Rohdaten erzeugt.  Die eigentlich f&#252;r gut lesbare Karten sehr wichtige Anpassung der Daten an den Ma&#223;stab und den Stil der zu erstellenden Karte (Generalisierung) wird vernachl&#228;ssigt oder auf eine rein technische Datenvereinfachung reduziert.

Dieser Vortrag stellt einige Ans&#228;tze f&#252;r die automatische Generalisierung von OpenStreetMap-Daten auf Basis von Open-Source-Werkzeugen vor.  Anhand von K&#252;stenlinien, Gew&#228;ssern und Gletschern wird beispielhaft erl&#228;utert, worauf es jeweils bei der Generalisierung ankommt und wie dies in einem automatischen Prozess ber&#252;cksichtigt werden kann.  Es werden die Herausforderungen beschrieben, die sich durch die permanenten Ver&#228;nderungen der Datenbasis bei OpenStreetMap f&#252;r die globale Anwendung eines solchen Verfahrens ergeben.  Der Schwerpunkt des Vortrags liegt hierbei nicht so sehr auf den technischen Details, sondern er erl&#228;utert vor allem auch die Vorteile, welche sich f&#252;r die Kartenqualit&#228;t durch die Generalisierung ergeben sowie die Schwierigkeiten, die die Mapping-Praxis in OpenStreetMap f&#252;r einen solchen Prozess darstellt.
</description>
        <persons>
          <person id="385">Christoph Hormann</person>
        </persons>
        <links>
          <link href="http://www.imagico.de/map/coastline_de.php">Generalisierung von K&#252;stenlinien</link>
          <link href="http://www.imagico.de/map/water_generalize_en.php">Generalizing rivers and lakes</link>
          <link href="http://www.imagico.de/map/map_de.php">Demo-Karte</link>
        </links>
      </event>
      <event guid="none" id="740">
        <date>2014-03-20T16:30:00+01:00</date>
        <start>16:30</start>
        <duration>00:30</duration>
        <room>H3</room>
        <slug></slug>
        <title>OpenStreetMap an die (Schul-)Wand h&#228;ngen</title>
        <subtitle>Der Versuch freie Geodaten zur Erstellung von Schullandkarten zu nutzen</subtitle>
        <track>Vorträge (OSM)</track>
        <type>lecture</type>
        <language></language>
        <abstract>Die Daten des OpenStreetMap-Projektes werden bereits vielseitig eingesetzt. Ob sie dazu geeignet sind als Grundlage f&#252;r Wandkarten zu dienen, wird dieser Vortrag diskutieren. </abstract>
        <description>OpenStreetMap und andere freie Geodaten sind heutzutage eine Selbstverst&#228;ndlichkeit im Alltag. Ob Navigationsger&#228;t, Smartphone-App oder im Browser, interaktive Karten(anwendungen) findet man &#252;berall. Wie sieht es aber aus wenn die Geodaten auf Papier gedruckt werden sollen? Ein Screenshot ist schnell gemacht, Datei -&gt; Drucken und man hat eine Karte in der Hand. Ganz so einfach ist es nicht, wenn man bestimmte Anforderungen zu erf&#252;llen hat. Wo kann man mal eben schnell eine Karte im DIN A0 Format oder gr&#246;&#223;er ausdrucken? Wie wird eine so gro&#223;e Druckdatei erzeugt?

Dieser Vortrag beschreibt den Versuch eine Schullandkarte zu erstellen. Dabei wird ausschlie&#223;lich auf freie Geodaten, insbesondere OpenStreetMap, sowie freie Software gesetzt. Es wird der komplette Prozess beschrieben. Welche Datenquellen werden benutzt? Wie m&#252;ssen die Geodaten aufbereitet werden? Welche Software rendert Karten im Quadratmeterformat? Wo liegen die H&#252;rden, die Grenzen und wie kommen die Karte letztendlich auf das Papier und an die Wand?

Es soll nicht zuviel vorweggenommen werden. Die technischen Anforderungen werden von handels&#252;blicher, freier Software bereits heutzutage erf&#252;llt. Der Aufwand entsteht bei der Auswahl und Aufbereitung der Geodaten. Ebenso ist es sehr sinnvoll grundlegende kartographische Kenntnisse f&#252;r so ein Projekt mitzubringen. Was im Detail herausgefunden wurde, wird pr&#228;sentiert und zur Diskussion gestellt. </description>
        <persons>
          <person id="8">Lars Lingner</person>
        </persons>
        <links>
        </links>
      </event>
      <event guid="none" id="714">
        <date>2014-03-20T17:00:00+01:00</date>
        <start>17:00</start>
        <duration>00:30</duration>
        <room>H3</room>
        <slug></slug>
        <title>Karten auf Stoff: OSM Daten mit OSGeo Software</title>
        <subtitle>Ein kommerzielles Freizeitprodukt auf Basis von Open Data und Open Source Software</subtitle>
        <track>Vorträge (OSM)</track>
        <type>lecture</type>
        <language></language>
        <abstract>Aus der Kombination von OpenStreetMap mit anderen Open Data Quellen lassen sich hervorragende Produkte erzeugen. Am Beispiel von SplashMaps werden technische M&#246;glichkeiten mit Open Source Software vorgestellt und Lizenzfragen gekl&#228;rt.</abstract>
        <description>Wie entsteht ein kommerzielles Freizeitprodukt auf Basis von Open Data und Open Source Software? 

Die in vielen F&#228;llen bereits fl&#228;chendeckende Verf&#252;gbarkeit von OpenStreetMap er&#246;ffnet neue M&#246;glichkeiten f&#252;r die Herstellung von kommerziellen Produkten. Am Beispiel von SplashMaps werden einige technische Herausforderungen und deren L&#246;sungen mit Hilfe von Open Source Software vorgestellt. Des weiteren werden Lizenzfragen diskutiert, vor allem auch welche zus&#228;tzlichen H&#252;rden entstehen, wenn andere Open Data Quellen genutzt werden, die oft nicht, oder anders lizenziert sind als OpenStreetMap. 
</description>
        <persons>
          <person id="51">Arnulf Christl</person>
        </persons>
        <links>
          <link href="http://splashmaps.net">SplashMaps - REAL outdoor Maps</link>
          <link href="http://metaspatial.net/conferences/fossgis2013_open.html#/10/5">SplashMaps - Einf&#252;hrung zu den Open Source Aspekten</link>
        </links>
      </event>
      <event guid="none" id="766">
        <date>2014-03-20T17:45:00+01:00</date>
        <start>17:45</start>
        <duration>02:00</duration>
        <room>H3</room>
        <slug></slug>
        <title>BOF 3D-Modelle f&#252;r OSM </title>
        <subtitle></subtitle>
        <track>Anwendertreffen</track>
        <type>user_meeting</type>
        <language>de</language>
        <abstract></abstract>
        <description></description>
        <persons>
          <person id="144">Tobias Knerr</person>
        </persons>
        <links>
          <link href="http://www.fossgis.de/wiki/Konferenz_2014/Sprints_und_BOFs">Anwendertreffen und BOFs</link>
        </links>
      </event>
    </room>
    <room name="H4">
      <event guid="none" id="664">
        <date>2014-03-20T11:00:00+01:00</date>
        <start>11:00</start>
        <duration>01:30</duration>
        <room>H4</room>
        <slug></slug>
        <title>(F&#196;LLT AUS) Administratives Performancetuning f&#252;r Datenbanksystem am Beispiel von PostgreSQL</title>
        <subtitle></subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language></language>
        <abstract>** DIESER WORKSHOP F&#196;LLT LEIDER AUS! **


Der Workshop befasst sich mit dem administrativen Tuning von der Hardware bis zur Konfigurationsdatei. Der Workshop zeigt auf, welche Kriterien zu beachten sind. Da die GIS-Datenverwaltung sehr schnell zur BigData-Verwaltung werden kann, wird hier besonders auch auf BigData und die Speicherung von GIS-Daten eingegangen. Der Workshop richtet sich eher an Administratoren als an Entwickler. 
SQL Tuning ist NICHT im Umfang des Workshops enthalten. Der Workshop soll den Teilnehmern ein besseres Gef&#252;hl f&#252;r das System vermittelt und das Bewusstsein st&#228;rken, wo die Bremser zu finden sind.

Der Workshop enth&#228;lt KEINE praktischen &#220;bungen. Das w&#228;hrend des Workshops verwendete Skript bzw. Folien werden den Teilnehmern zur Verf&#252;gung gestellt. Der Workshop soll zur gemeinsamen Findung und Erkennung von Problemen anregen. F&#252;r spontane Fragen und Erl&#228;uterungen k&#246;nnte die Tafel zum Einsatz kommen. Das mitbringen von Papier und Stift oder einem Ger&#228;t, mit dem sich die Tafel fotografieren l&#228;sst, ist empfohlen. 


</abstract>
        <description>Datenbanksysteme sind dazu da, Informationen effizient, schnell und vor allem permanent zu speichern. Aber nicht nur das Ablegen der Daten sollte m&#246;glichst schnell geschehen, sondern auch das Auslesen der Daten. Jedes Fahrrad ist nur so schnell, wie der Anwender es tritt. Das l&#228;sst sich auch auf die Informationsverwaltung mit Hilfe von Datenbanksystemen &#252;bertragen. Bei relationalen Datenbanken ist das verwendete SQL die Tretgeschwindigkeit. Gut getuntes SQL tr&#228;gt den Gro&#223;teil zur Geschwindigkeit bei.
Der Workshop befasst sich jedoch NICHT mit SQL Tuning. Er befasst sich mit dem Tuning auf den unteren, administrativen Ebenen. Damit ein Fahrrad rund l&#228;uft, sollten die R&#228;der nicht sechseckig sein. Der erste und zweite Gang mag zwar f&#252;r bergauf gut sein, aber f&#252;r gerade Strecken oder bergab ist ein h&#246;herer Gang vielleicht besser geeignet. Gerade bei GIS-Daten, kommen wir sehr schnell in den BigData Bereich. In Bereiche, in denen nicht mehr alles in den RAM passt und in denen Performance auf administrativer Ebene noch wichtiger wird.
Der Workshop f&#228;ngt auf Hardware-Ebene an und endet mit der Konfigurationsdatei.
Der Workshop enth&#228;lt KEINE praktischen &#220;bungen. Der Workshop soll das Bewusstsein f&#252;r die Funktionalit&#228;t von Datenbanksystemen sch&#228;rfen und aufzeigen, an welchen Stellschrauben Administratoren hier drehen k&#246;nnten. Der Workshop bietet Raum f&#252;r Diskussionen und Fragen.
Gemeinsam er&#246;rtern wir Kriterien, die bei der Hardwareanschaffung bedacht werden sollten. Die Vorteile von SSD und spinnig Disks werden diskutiert und auch die Kriterien f&#252;r die Wahl des Betriebs- und Dateisystems kommen nicht zu kurz. Es wird gezeigt, an welchen Stellen geschraubt werden k&#246;nnten, um eine bessere I/O Performance zu erlangen. Auch RAM und Cache-Tuning kommt hier nicht zu kurz.
Welche Wartungsarbeiten bei PostgreSQL durchgef&#252;hrt werden sollten sowie Tips zum Monitoring kommen auch nicht zu kurz. Unterschiede zwischen dem Umgang mit BigData, GIS-Daten und anderen Datenmengen werden bei den entsprechenden Punkten aufgezeigt.</description>
        <persons>
          <person id="307">Susanne Ebrecht</person>
        </persons>
        <links>
        </links>
      </event>
      <event guid="none" id="755">
        <date>2014-03-20T17:45:00+01:00</date>
        <start>17:45</start>
        <duration>01:00</duration>
        <room>H4</room>
        <slug></slug>
        <title>SHOGun BOF</title>
        <subtitle>Quo Vadis SHOGun - oder: Warum ist SHOgun so gut?</subtitle>
        <track>Anwendertreffen</track>
        <type></type>
        <language></language>
        <abstract></abstract>
        <description>SHOgun ist eine Middleware basierend auf Java Spring und Hibernate. Die Middleare besitzt zudem einen GIS-Clienten basierend auf OpenLayers und GeoExt sowie Oberfl&#228;chen zur Verwaltung und Anlage von WMS/WFS-Layern und WebGIS-Oberfl&#228;chen.
In der BoF wird der aktuelle Stand des SHOGun-Projektes kurz vorgestellt und geht auf Erfahrungen ein,  die beim Einsatz des Frameworks gesammelt wurden.  Anschlie&#223;end wollen wir diskutieren, wie aus der aktuell noch sehr firmenlastigen Software eine wirkliche OpenSource Software mit breiter Community werden kann. 

Dies vor dem Hintergrund, das die Anforderungen an WebGIS-Komplettl&#246;sungen in der Vergangenheit stetig gewachsen sind. H&#228;ufig werden spezifische L&#246;sungen ben&#246;tigt, 
die weit &#252;ber statische Frontendkomponenten, frei zug&#228;ngliche Dienste und Schnittstellen hinausgehen. Konfigurierbare und ansprechende 
Web-GIS-Oberfl&#228;chen, flexible Web-Service-Schnittstellen und ein Benutzer-, Rechte- und Rollenmanagement geh&#246;ren mittlerweile zu den Standardanforderungen.

Weiterhin wollen wir Umstrukturierungen der Software vorstellen und diskutieren. Im Mittelpunkt unserer &#220;berlegungen steht eine Modularisierung mittels derer eine Entkopplung der Komponenten erreicht wird. Dadurch l&#228;sst sich einfach ein gezielt auf die Bed&#252;rfnisse angepasstes Software-Setup erstellen, um perfekt abgestimmte WebGIS-Applikationen, wie zum Beispiel Stadtplanportale oder WebGIS-Fachanwendungen, zu erstellen.

Neben eines SHOGun-Kern-Moduls, welches die Basis f&#252;r jede Anwendung bildet, k&#246;nnten bestehende Funktionen, wie die interaktive Publizierung Geodaten als WMS 
oder ein Proxy zur Absicherung von Geo-Diensten, als einzelne Module bereitgestellt werden. 

Auch die Kollaboration an der Software w&#252;rde vereinfacht, je modularer SHOGun aufgebaut ist.</description>
        <persons>
        </persons>
        <links>
        </links>
      </event>
    </room>
    <room name="WS 429">
      <event guid="none" id="707">
        <date>2014-03-20T09:00:00+01:00</date>
        <start>09:00</start>
        <duration>01:30</duration>
        <room>WS 429</room>
        <slug></slug>
        <title>Agiles Projektmanagement</title>
        <subtitle>Einsatz von Scrum f&#252;r Open Source Geospatial Projekte</subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language></language>
        <abstract>Agiles Projektmanagement wird seit &#252;ber zehn Jahren praktiziert, zunehmend auch in der &#246;ffentliche Verwaltung. Der Workshop stellt die Grundlagen am Beispiel der Methode "Scrum" vor und bietet einen praxisnahen Zugang zum Thema.</abstract>
        <description>Der Workshop stellt die Grundlagen von agilem Projektmanagement am Beispiel der Methode "Scrum" vor und bietet einen praxisnahen und pragmatischen Zugang zum Thema.

Agiles Projektmanagement wird seit &#252;ber zehn Jahren in IT Unternehmen eingesetzt. In den letzten Jahren sind die Erkenntnisse, die prim&#228;r aus der Softwareentwicklung stammen verst&#228;rkt in Unternehmen und die &#246;ffentliche Verwaltung eingezogen. 

Die britische Kataster- und Kartenbeh&#246;rde Ordnance Survey Great Britain hat alle nach au&#223;en gerichteten Karten- und Datenservices auf Open Source umgestellt. Bei dieser Umstellung wurde im Unternehmen erstmals Scrum eingesetzt. Die in diesem Prozess gewonnenen Erfahrungen wurden eingehend analysiert und eine erhebliche Leistungssteigerung vor allem bei Open Source Projekten festgestellt. Der Leiter des Workshops wurde daraufhin in 2012 und 2013 beauftragt, die weitere Verbreitung von Open Source im Unternehmen unter Verwendung von Scrum zu begleiten. Inzwischen ist Scrum fl&#228;chendeckend im gesamten Unternehmen mit 1200 Mitarbeitern erfolgreich eingef&#252;hrt worden. Dabei wurde auch deutlich, dass Dienstleister im Bereich Open Source Geospatial von agiler Projektleitung profitieren. 

Vorkenntnisse der Teilnehmer: Erfahrung in der Projektleitung ist von Vorteil aber nicht zwingend erforderlich.

Lernziele: Grundlagen der Methode Scrum und deren Einf&#252;hrung in Unternehmensprozesse. </description>
        <persons>
          <person id="51">Arnulf Christl</person>
          <person id="23">Till Adams</person>
        </persons>
        <links>
          <link href="http://arnulf.us/publications/innovation_gis.business_2013-07_intergeo.pdf">Agile Beitrag in der GIS Business</link>
          <link href="http://www.computerwoche.de/a/sprinten-mit-dem-v-modell-xt,1911008">Scrum und das V-Modell XT</link>
          <link href="http://de.linkedin.com/company/metaspatial">Agile Angebot metaspatial</link>
        </links>
      </event>
      <event guid="none" id="728">
        <date>2014-03-20T11:00:00+01:00</date>
        <start>11:00</start>
        <duration>01:30</duration>
        <room>WS 429</room>
        <slug></slug>
        <title>OSM mit OGR</title>
        <subtitle>Import von OSM Daten mit Hilfe von OGR nach PostgreSQL/PostGIS</subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language></language>
        <abstract></abstract>
        <description>Referenten:
Harald Schwenk
Olaf Kotzte


Die OGR Simple Feature Library ist eine Datendrehscheibe mit der Vektordaten gelesen und in die unterschiedlichsten Vektorformate &#252;bersetzt werden k&#246;nnen. Die OGR Bibliothek ist eines der m&#228;chtigsten Open Source Tools f&#252;r diesen Einsatzzweck und wird h&#228;ufig in Kombination mit Anwendungssoftware, eingesetzt. Mit der OGR-Version 1.10 aus dem Jahr 2013 k&#246;nnen OSM-Daten (pbf/xml) gelesen und in eine SQLight/Spatialite bzw. PostgreSQL/PostGIS Datenbank &#252;bertragen werden.

Der Workshop zeigt im ersten Teil die Konfigurations- und Steuerungsbefehle mit denen die OGR Bibliothek die OSM Daten in eine PostgreSQL/PostGIS Datenbank &#252;bertragen werden. Hierbei wird zun&#228;chst eine Datenbank angelegt und die notwendigen Spatial Extensions geladen. Des weiteren erfolgt eine Einf&#252;hrung in die Konfiguration des Zieldatenmodells. Und schlussendlich die Steuerungsbefehle, mit denen OGR die &#220;bertragung der OSM Daten vollzieht.

Im weiteren Verlauf des Workshops werden Grundlagen zum Einsatz von SQL-Befehlen f&#252;r eine Datenanalyse gezeigt. Denkbare Analysen sind hierbei: die H&#228;ufigkeit der verwandten Tags in einem bestimmten Kontext, die Anzahl der Hausnummern in einem definierten Gebiet, die L&#228;nge des Stra&#223;enbahnnetzes in einer Stadt oder die L&#228;nge des Autobahnnetzes in einem Bundesland.
   
Des weiteren wird gezeigt, wie die OSM Daten mit deren r&#228;umlicher Auspr&#228;gung in einem Dektop GIS (QGIS) angezeigt werden.

Abschlie&#223;end wird noch auf die Konfiguration eines Datenmodell f&#252;r einen Datenexport eingegangen. Hierbei k&#246;nnten beispielsweise alle Geb&#228;ude mit deren Hausnummern in ein dxf-Format (allgemeines CAD Austauschformat) geschrieben werden.

W&#228;hrend des Workshop werden die Teilnehmer die &#220;bungen weitestgehend, an einem bereitgestellten Arbeitsplatz mit vorinstallierter OSGeo Live Arbeitsumgebung, selbst nachvollziehen.  

Der Workshop richtet sich sowohl an Menschen aus der OSM Community, die OSM Daten in einer GIS-Umgebung verarbeiten m&#246;chten, als auch GIS-Anwender die Verwendung f&#252;r OSM Daten in ihrer gewohnten Arbeitsumgebung haben.

Die Software die w&#228;hrend des Workshop zum Einsatz kommt, wird &#252;berwiegend mit Kommandozeilenbefehlen gesteuert. Eine positive Einstellung zu dieser Arbeitsweise ist von Vorteil.



</description>
        <persons>
          <person id="31">Harald Schwenk</person>
          <person id="440">Olaf Kotzte</person>
        </persons>
        <links>
        </links>
      </event>
      <event guid="none" id="691">
        <date>2014-03-20T13:30:00+01:00</date>
        <start>13:30</start>
        <duration>01:30</duration>
        <room>WS 429</room>
        <slug></slug>
        <title>OSM Data mining for forest and environmental parameters in Europe</title>
        <subtitle>Querying and extracting forest and environmental parameters</subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language></language>
        <abstract></abstract>
        <description>The proposed workshop addresses all levels of the open geospatial community and will present principles basics of free and open source geospatial data as well as particular methodology and tools to perform data mining for environmental and forestry applications. Participants of the three hour workshop will perform particular practical applications to query and extract various spatial data and information from open source geospatial repositories, like OSM, EU data archives and other sources 
The workshop will start with a short motivational talk which discusses the variety of OSM and Open Source GIS applications for forestry and environmental planning, such as mapping of forest road infrastructure, skidding trails for certification, timber logistics and the use of routing systems using only free and open geospatial data. In addition the talk will present other applications like biomass quantification, yield assessments and forest management tools. 
During the 3 h workshop participants will learn about the principles of the data model of free geospatial data and will apply various free software tools for querying the OSM and other open source environmental repositories. The participants will perform individual data mining and queries in order to extract particular forest parameters and environmental information like forest road infrastructure, forest and non-forest land, tree densities, major tree species and forest heights using several different open data repositories. Participants will make active use of and test of various OS geospatial software and will be informed about different particular free and open data resources and repositories offering particular emphasis on environmental indicators and forest management parameters like CORINE Land Cover, ICESat/GLAS canopy height Data, EFI data and EU forest tree species map. 
The selection of parameters and the expected query results will stimulate a discussion among participants about further opportunities and technical challenges implementing free geo-data and open source software systems in the field of environmental and forestry management 
Since some years the GIS department of the University for Sustainable Development Eberswalde and the private company Datalyze Solutions, Berlin are using successfully open GIS software packages for academic teaching and geospatial project implementation, such as data mining and real time sensor data integration and analysis. </description>
        <persons>
          <person id="408">Jan-Peter</person>
        </persons>
        <links>
          <link href="http://www.hnee.de/de/Fachbereiche/Wald-und-Umwelt/Mitarbeiter/Professoren/-innen/Jan-Peter-Mund/Prof.-Dr.-Jan-Peter-Mund-K3188.htm">Website Prof. Dr. Jan-Peter Mund</link>
          <link href="http://www.datalyze-solutions.com/">Datalyze solutions webpage</link>
        </links>
      </event>
      <event guid="none" id="694">
        <date>2014-03-20T15:30:00+01:00</date>
        <start>15:30</start>
        <duration>01:30</duration>
        <room>WS 429</room>
        <slug></slug>
        <title>Daten aus OpenStreetMap extrahieren, analysieren und pflegen mit der Overpass API</title>
        <subtitle></subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language></language>
        <abstract></abstract>
        <description>Die Faszination von OpenStreetMap liegt in der Reichhaltigkeit und oft umfangreichen Verf&#252;gbarkeit der Daten. Leider bedeutet dies auch, dass die schiere Datenmenge hohe Anforderungen an Werkzeuge zur Auswertung stellt. Mit Overpass API ist es m&#246;glich, per einfacher HTTP-Abfrage &#252;ber das Web die Daten gezielt nach eigenen Kriterien wie Thema oder Ort zu filtern und sogar &#196;nderungen fast live zu verfolgen.

Die Overpass API wird heute bereits f&#252;r eine Vielzahl von Anwendungen, z.B. zur Qualit&#228;tssicherung, f&#252;r in Echtzeit erzeugte Kartenoverlays, thematische Downloads oder auch zur Beschleunigung der Main API verwendet. Ihren Geschwindigkeitsvorteil erzielt die Overpass API durch eine optimierte Datenhaltung anstatt einer relationalen Datenbank. Ihre Flexibilit&#228;t bezieht sie aus einer Abfragesprache, die einfach ist, aber speziell auf die Bed&#252;rfnisse von OpenStreetMap zugeschnitten.

In diesem Workshop wird in die Abfragesprache systematisch eingef&#252;hrt. Dazu diskutieren wir zun&#228;chst an zentralen Beispielen, auf welche Weise mit Nodes, Ways und Relationen typische Ph&#228;nomene der Realit&#228;t modelliert werden. Anschlie&#223;end werden wir als Beispiele ein thematisches Kartenoverlay erstellen und diskutieren, wie effizient f&#252;r dieses Beispiel die &#196;nderungen &#252;ber einen unbegrenzten Zeitraum verfolgt werden k&#246;nnen.
</description>
        <persons>
          <person id="280">Roland Olbricht</person>
        </persons>
        <links>
        </links>
      </event>
      <event guid="none" id="767">
        <date>2014-03-20T17:30:00+01:00</date>
        <start>17:30</start>
        <duration>01:00</duration>
        <room>WS 429</room>
        <slug></slug>
        <title>deegree Anwendertreffen </title>
        <subtitle></subtitle>
        <track></track>
        <type></type>
        <language></language>
        <abstract></abstract>
        <description></description>
        <persons>
          <person id="396">bretschneider</person>
        </persons>
        <links>
          <link href="http://www.fossgis.de/wiki/Konferenz_2014/Sprints_und_BOFs">http://www.fossgis.de/wiki/Konferenz_2014/Sprints_und_BOFs</link>
        </links>
      </event>
    </room>
    <room name="WS 438">
      <event guid="none" id="679">
        <date>2014-03-20T09:00:00+01:00</date>
        <start>09:00</start>
        <duration>01:30</duration>
        <room>WS 438</room>
        <slug></slug>
        <title>&#196;nderungsanalyse mit Fernerkundungsbilddaten</title>
        <subtitle>Freie FE-Bilddaten: Prozessierung - Auswertung - Darstellung</subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language></language>
        <abstract></abstract>
        <description>Oft werden aktuelle und/oder historische Informationen f&#252;r einen bestimmten Ort gesucht, um auf Basis dieser beiden Informationsschichten eine &#196;nderungsanalyse durchzuf&#252;hren. Daf&#252;r eigenen sich insbesondere Satellitenbilddaten, denn eine Bildinformation ist immer objektiv und gibt eine Region zu einem bestimmten Zeitpunkt exakt wieder. Eine wichtige Satellitenreihe, die seit &#252;ber 40 Jahren verl&#228;sslich optische Bilddaten der ganzen Erdoberfl&#228;che liefert, ist die Landsat Serie des USGS (United States Geological Survey). Die Bilddaten der Landsat Sensoren sind in gro&#223;en online Bildarchiven gespeichert und f&#252;r jedermann von dort abzurufen.
In diesem Workshop werden wir eine &#196;nderungsanalyse auf Basis von zwei Satellitenbildszenen verschiedenen Aufnahmedatums durchf&#252;hren. Nach einer kurzen Einf&#252;hrung in die physikalischen Grundlagen der Fernerkundung und die technischen Eigenschaften der Satellitensysteme geht es in die praktische Auswertung. Daf&#252;r m&#252;ssen wir uns aber zun&#228;chst mit der Region vertraut machen, die regionale Geographie bedenken. Dann werden wolkenfreie Bilddaten in Bildarchiven gesucht, lokal gespeichert und mit dem freien Programm Multispec vorprozessiert. Anschlie&#223;end erfolgt die eigentliche Auswertung in QGIS und die Darstellung der &#196;nderung in einer thematischen Karte, die als svg-Datei ausgegeben wird.</description>
        <persons>
          <person id="404">Matthias M&#246;ller</person>
        </persons>
        <links>
        </links>
      </event>
      <event guid="none" id="632">
        <date>2014-03-20T11:00:00+01:00</date>
        <start>11:00</start>
        <duration>01:30</duration>
        <room>WS 438</room>
        <slug></slug>
        <title>QGIS Workshop</title>
        <subtitle>Eine Einf&#252;hrung in die Software</subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language></language>
        <abstract></abstract>
        <description>Der Workshop gibt einen &#220;berblick &#252;ber die Funktionalit&#228;ten von QGIS und vermittelt anhand eines praktischen Workflows, wie man auf einfache Art und Weise ein Projekt aufbaut, Analysen durchf&#252;hrt und eine ansprechende Karte erzeugt.

* Einf&#252;hrung in QGIS Funktionalit&#228;t und GUI
* Aufbau eines Projektes
* Umgang mit dem Thema Projektionen
* Visualisieren und Analysieren von Vektor- und Rasterdaten
* Attributmanagement und Digitalisierfunktionen
* Arbeiten mit Plugins
* Layouten einer druckfertigen Karte</description>
        <persons>
          <person id="9">Otto Dassau</person>
        </persons>
        <links>
        </links>
      </event>
      <event guid="none" id="634">
        <date>2014-03-20T13:30:00+01:00</date>
        <start>13:30</start>
        <duration>01:30</duration>
        <room>WS 438</room>
        <slug></slug>
        <title>MapServer II</title>
        <subtitle>Das 'Do what I want' Know How f&#252;r den UMN MapServer</subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language></language>
        <abstract></abstract>
        <description>Der WS richtet sich an alle, die schon einmal einen funktionierenden Mapfile erstellt und die grundlegende Funktionsweise des MapServers verstanden haben. Wer WebMapServices mit MapServer bereit stellt, st&#246;&#223;t fr&#252;her oder sp&#228;ter an die Grenzen der Basisfunktionen, die jedoch meist mit kleinen Tricks und fortgeschrittenen Funktionen &#252;berwunden werden k&#246;nnen. &#220;ber die 'Run-time Substitution' k&#246;nnen dem MapServer vom Client Parameter &#252;bergeben werden, die die Ausgestaltung der Karte beeinflussen oder sogar Geometrien &#228;ndern, mit PHP-Fassaden (wrapper, proxys oder wie auch man sie nennen m&#246;chte) k&#246;nnen Requests und Parameter eingef&#252;hrt werden, die das Verhalten des MapServers den eigenen Bed&#252;rfnissen anpassen oder sogar &#252;ber die OGC-Spezifikationen hinaus gehen. Auch die kreative Nutzung vorhandener und bekannter Funktionen wie regul&#228;re Ausdr&#252;cke und Kakskaddierung von WMS k&#246;nnen f&#252;r optimierte Kartenausgaben genutzt werden - man muss manchmal nur ein wenig um die Ecke denken.

Themen:
* Variablen im Mapfile (Run-time Substitution)
* Erstellung komplexer Symbole
* zwischen cgi und MapScript: PHP-Fassaden
* JOINs mit Datei basierten Datenquellen
* Klassifizierung mit regul&#228;reren Ausdr&#252;cken
* Schnelle Klassifizierung mit Color Ranges
* Dienste-Versch&#246;nerung durch Kaskadierung
* Cluster von Punktobjekten bilden
* Sch&#246;nere Karten Dank Geomtransform (Richtungssymbole, shapesmothing,..)
* Zugriffsbeschr&#228;nkung &#252;ber Client-IPs</description>
        <persons>
          <person id="378">J&#246;rg Thomsen</person>
          <person id="119">toni Pignataro</person>
        </persons>
        <links>
          <link href="http://mapserver.org">http://mapserver.org</link>
        </links>
      </event>
      <event guid="none" id="674">
        <date>2014-03-20T15:30:00+01:00</date>
        <start>15:30</start>
        <duration>01:30</duration>
        <room>WS 438</room>
        <slug></slug>
        <title>Sensor Web und Smart Cities</title>
        <subtitle></subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language></language>
        <abstract>In diesem Workshop wird aufgezeigt, wie das Sensor Web zum Aufbau von Smart Cities-Anwendungen genutzt werden kann. Neben einer Sensor Web-Einf&#252;hrung werden Anwendungsbeispiele vorgestellt sowie die Nutzung des OGC SOS praktisch ge&#252;bt.</abstract>
        <description>Sensordaten spielen im Kontext von Smart Cities-Anwendungen eine besondere Rolle, da sie es erlauben, einen aktuellen Lage&#252;berblick zu erhalten. Typische Anwendungsfelder sind Themen wie Luftqualit&#228;t, Verkehr, Wetter und damit verbundene Einfl&#252;sse auf das Leben in einer Stadt. Gleichzeitig stellt die OGC Sensor Web Enablement-Technologie grundlegende Bausteine bereit, um flexibel unterschiedlichste Anwendungen auf Basis von Sensoren bzw. Sensordaten zu erstellen.

Ziel dieses Workshops ist es, Teilnehmern aus der &#246;ffentlichen Verwaltung und Forschung sowie Entwicklern aufzuzeigen, wie die Sensor Web-Technologie zum Aufbau von Smart Cities-Anwendungen genutzt werden kann. Hierzu wird eine kurze Einf&#252;hrung in die OGC Sensor Web Enablement-Architektur gegeben. Im Anschluss daran werden bestehende Open Source-Komponenten (insbesondere der 52&#176;North Sensor Observation Service, Sensor Event Service und Sensor Web Client) vorgestellt. Begleitend dazu werden praktische Anwendungsbeispiele zur Illustration der Einsatzm&#246;glichkeiten eingef&#252;hrt.

Abschlie&#223;end beinhaltet der Workshop eine praktische &#220;bung auf Basis der OSGeo Live DVD. Die auf dieser DVD enthaltene 52&#176;North Sensor Observation Service-Implementierung wird genutzt, um den Teilnehmern erste Schritte in der Nutzung der OGC SOS-Schnittstelle zu vermitteln. Unter Anleitung k&#246;nnen die Teilnehmer grundlegende SOS-Operationen ausf&#252;hren und werden somit in die Lage versetzt, Daten &#252;ber das Sensor Web bereitzustellen und abzurufen.</description>
        <persons>
          <person id="39">Simon Jirka</person>
        </persons>
        <links>
        </links>
      </event>
    </room>
    <room name="WS 439">
      <event guid="none" id="680">
        <date>2014-03-20T11:00:00+01:00</date>
        <start>11:00</start>
        <duration>01:30</duration>
        <room>WS 439</room>
        <slug></slug>
        <title>Geodaten, Vernetzung, kartographische Darstellung</title>
        <subtitle>Webmapping Projekt</subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language></language>
        <abstract></abstract>
        <description>Wesentliche Bestandteile von allen GIS Projekten sind Geodaten. Diese k&#246;nnen entweder online direkt aus dem WWW in GIS Projekte mit eingebunden werden oder sie stehen offline zur Verf&#252;gung. Als online Quellen sind weitl&#228;ufig die Openstreetmap, Google Maps, Bing Maps, Here.com, etc. als Basisdaten bekannt, die als Basislayer in Desktop-GIS integriert werden k&#246;nnen. Oder die Geoinformationen werden &#252;ber entsprechende Javascript Befehle in einer Geobrowser - Umgebung (wie z.B. Openlayers) mit weiteren, individuellen Geoinformationen kombiniert und online dann in entsprechende Webmapping/online GIS-Projekte integriert.
Der erste Teil des Workshops wird zun&#228;chst systematisch die wichtigsten Quellen f&#252;r online Geodaten vorstellen. Am Bsp. Von Openlayers (OL) und der API wird erkl&#228;rt, wie sich diese Geodaten integrieren lassen, die Zuh&#246;rer k&#246;nnen mit kleinen Beispiel und hands-on &#220;bungen selbst den Fortschritt nachvollziehen.
Weitere wichtige Quellen f&#252;r Geodaten im Vektorformat sind unter verschiedenen Plattformen erh&#228;ltlich, etwa Natural Earth Data (http://www.naturalearthdata.com/) oder aus der Openstreetmap direkt als OSM Datei. In einer zweiten &#220;bung werden diese Daten geladen, lokal in einem freien GIS Programm (QGIS) prozessiert, analysiert und die Ergebnisse werden dann als OGC-konformer Service in das OL Webmapping-Projekt integriert.</description>
        <persons>
          <person id="404">Matthias M&#246;ller</person>
        </persons>
        <links>
        </links>
      </event>
      <event guid="none" id="750">
        <date>2014-03-20T13:30:00+01:00</date>
        <start>13:30</start>
        <duration>01:30</duration>
        <room>WS 439</room>
        <slug></slug>
        <title>OpenStreetmap-Daten in QGIS importieren und regelbasiert visualisieren</title>
        <subtitle></subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language></language>
        <abstract></abstract>
        <description>OSM bietet nicht nur fertige Karten, sondern auch Rohdaten zum herunterladen an. Im QGIS lassen sich diese Daten fu&#776;r eigene Projekte visualisieren und weiterverarbeiten.
Im Workshop ko&#776;nnen die Teilnehmer lernen, wie Sie
&#10007; Openstreetmap- und Google-Layer u&#776;ber OpenLayers in QGIS-Projekte integrieren, ohne u&#776;ber die Fallstricke unterschiedlicher Koordinatenbezugssysteme zu stolpern,
&#10007; OSM-Rohdaten aus dem Netz fu&#776;r ausgewa&#776;hlte Bereiche oder ganze La&#776;nder herunterladen,
&#10007; OSM-Daten ins QGIS laden bzw. mit Hilfe von ogr2ogr und spatialite_osm_map in andere gisga&#776;ngige Geodatenformate (Shapefile, SpatiaLite, PostGis) konvertieren, um sie im QGIS weiterzuverarbeiten,
&#10007; die importierten OSM-Daten mit Hilfe der &#8222;regelbasierten Darstellung&#8220; in QGIS thematisch symbolisieren und in aussagekra&#776;ftige Karten umsetzen,
&#10007; einzelne Themen (Waldfla&#776;chen, Stromleitungen, Eisenbahnstrecken etc.) u&#776;ber SQL- Abfragen aus den &#8222;tags&#8220; extrahieren und dabei mit den Fallstricken von sich u&#776;berlagernden Polygonen und von Multipolygonrelationen umgehen.</description>
        <persons>
          <person id="437">Claas Leiner</person>
        </persons>
        <links>
        </links>
      </event>
      <event guid="none" id="719">
        <date>2014-03-20T15:30:00+01:00</date>
        <start>15:30</start>
        <duration>01:30</duration>
        <room>WS 439</room>
        <slug></slug>
        <title>Einf&#252;hrung in GeoKettle</title>
        <subtitle></subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language></language>
        <abstract></abstract>
        <description>Der Workshop richtet sich an Teilnehmer, die &#252;ber bisher keine Erfahrungen mit GeoKettle verf&#252;gen. 
Neben den ersten Schritten mit GeoKettle wie "Kennenlernen der Benutzeroberfl&#228;che und Terminolgie" sollen im Workshop folgende Inhalte vermittelt werden:
1. Import von Shapedateien in eine Datenbank
2. Koordinatentrasnformation w&#228;hred des Importvorgangs
3. Zusammenf&#252;hren von zwei Shapefiles in eine Datenbanktabelle
4. Aufsplitten von Shapefiles in mehrere Datenbanktabellen
5. Ver&#228;nderung von Sachdaten</description>
        <persons>
          <person id="347">Jens Schaefermeyer</person>
        </persons>
        <links>
          <link href="http://www.spatialytics.org/projects/geokettle/">http://www.spatialytics.org/projects/geokettle/</link>
          <link href="http://live.osgeo.org/de/overview/geokettle_overview.html">http://live.osgeo.org/de/overview/geokettle_overview.html</link>
        </links>
      </event>
    </room>
    <room name="Beuthhalle">
    </room>
  </day>
  <day date="2014-03-21" end="3" start="3" index="3">
    <room name="Meising-Saal">
      <event guid="none" id="759">
        <date>2014-03-21T12:30:00+01:00</date>
        <start>12:30</start>
        <duration>01:00</duration>
        <room>Meising-Saal</room>
        <slug></slug>
        <title>Abschlussveranstaltung</title>
        <subtitle></subtitle>
        <track>Allgemeines</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>* Daniel Morissette (Keynote) 
* FOSSGIS e.V. (Marco Lechner): FOSSGIS - Der Verein
* FOSSGIS e.V. (Marco Lechner): Verlosung</abstract>
        <description>Nach der Abschlussveranstaltung sind alle Mitglieder des FOSSGIS-Vereins, Freunde und Interessierte herzlich auf ein Glas Sekt zum Ausklang der Konferenz eingeladen.

(Antialkoholische Getr&#228;nke stehen ebenfalls zur Verf&#252;gung)</description>
        <persons>
          <person id="441">Daniel Morissette</person>
          <person id="135">Marco Lechner</person>
          <person id="404">Matthias M&#246;ller</person>
        </persons>
        <links>
          <link href="http://www.fossgis.de/konferenz/2014/socialevents/">Information zu den Social Events</link>
        </links>
      </event>
    </room>
    <room name="H1">
      <event guid="none" id="656">
        <date>2014-03-21T09:00:00+01:00</date>
        <start>09:00</start>
        <duration>00:30</duration>
        <room>H1</room>
        <slug></slug>
        <title>geOrchestra INSPIRE GDI</title>
        <subtitle></subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract></abstract>
        <description>geOrchestra besteht aus einer Open Source Community um eine INSPIRE konforme Geodateninfrastruktur aufzubauen. Das Ergebnis ist eine anpassbare, interoperable und freie INSPIRE GDI, basierend auf den besten Open Source Komponenten.
Auf Github gehostet, bietet geOrchestra eine L&#246;sung zur Publikation und Nutzung r&#228;umlicher Daten im Internet und Intranet.
Das Projekt geOrchestra besteht aus mehreren unabh&#228;ngigen und interoperablen Anwendungen:
ein Katalog, mit einer Funktion um Geodaten zu publizieren
einen Viewer und einen Editor
ein Tool um Daten zu extrahieren
ein Kartendienst
ein Content Mangement System (CMS)
Diese Module sind voneinander unabh&#228;ngig und die Kommunikation zwischen den Modulen geschieht &#252;ber OGC-Standards.
geOrchestra wurde konzipiert, um die Anforderungen der INSPIRE-Richtlinie zu erf&#252;llen. Die INSPIRE-Richtlinie hat eine Geodateninfrastruktur auf Europ&#228;ischer Ebene zum Ziel, um sich so den Herausforderungen einer nachhaltigen Entwicklung zu stellen:
Discovery, View und Download von Geodatenservices
Statischer Link zwischen den geografischen Daten und deren Metadaten
INSPIRE-Standards
Administrationstools um die INSPIRE zu verwalten (INSPIRE Themen, GEMET Thesaurus, INSPIRE-Konformit&#228;tspr&#252;fung, etc.)
Einfacher Gebrauch &#252;ber Webservices
Dieser Vortrag wird das geOrchestra Community Projekt beschreiben und den aktuellen Stand des Projekts besprechen.</description>
        <persons>
          <person id="263">Emmanuel Belo</person>
        </persons>
        <links>
        </links>
      </event>
      <event guid="none" id="640">
        <date>2014-03-21T09:30:00+01:00</date>
        <start>09:30</start>
        <duration>00:30</duration>
        <room>H1</room>
        <slug></slug>
        <title>Geodateninfrastruktur Rheinland-Pfalz INSPIREd</title>
        <subtitle></subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract>Im Vortrag werden die Konzepte und Prinzipien der Umsetzung der EU-INSPIRE Richtlinie im GeoPortal.rlp anhand praktischer Beispiele vorgestellt. Die zugrundeliegende Umsetzungsstrategie macht Rheinland-Pfalz derzeit EU-weit zum gr&#246;&#223;ten Datenanbieter.</abstract>
        <description>Das vollst&#228;ndig auf FOSS basierende GeoPortal.rlp wurde seit seiner Inbetriebnahme im Januar 2007 sukzessive an die sich wandelnden Nutzeranforderungen angepasst. Es bildet die zentrale Komponente der Geodateninfrastruktur Rheinland-Pfalz (GDI-RP) und setzt das einer Serviceorientierten Architektur (SOA) zugrundeliegende Publish-Find-Bind Paradigma seit 7 Jahren konsequent und erfolgreich um.
Im Gegensatz zu den allgemein verbreiteten GDI-Architekturen (z.B. GDI-DE und INSPIRE), deren Backends gro&#223;e Kataloge mit standardisierten Metadaten f&#252;r Daten und Dienste bilden, basiert die GDI-RP auf dem Konzept einer Service-Registry. Dezentrale Stellen registrieren OGC konforme WMS und WFS (OWS) in einer zentralen Datenbank. Das zugrundeliegende Konzept wurde 2005 zu einem Zeitpunkt erstellt, zu dem es noch keine standardisierten Schnittstellen f&#252;r den Austausch von Geo-Metadaten gab und basiert auf dem Prinzip eines Single Point of Access (SPA) als Datenquelle f&#252;r alle innerhalb einer GDI ben&#246;tigten Metadaten.
Die Informationen werden dabei aus den Capabilities Dokumenten der OWS extrahiert und einer zentralen Recherche zug&#228;nglich gemacht. Das Prinzip erlaubt die Realisierung eines Metadatenproxies, der sowohl f&#252;r Qualifizierungsma&#223;nahmen, als auch f&#252;r eine zentrale Absicherung genutzt wird. 
Mit der ab 2007 beginnenden Umsetzung der INSPIRE-Richtlinie und ihrer Durchf&#252;hrungsbestimmungen in nationales Recht, ergaben sich neue Herausforderungen. Das auf einer "Standard GDI-Architektur" basierende Prinzip von INSPIRE stellt spezielle Anforderungen an die bereitzustellenden Daten, Dienste und deren Metainformationen und ist weltweit der erste reale Anwendungsfall f&#252;r die urspr&#252;nglich vom OGC erarbeiteten Konzepte und Standards. Es fehlt bis heute noch an Softwareprodukten die diese Anforderungen vollst&#228;ndig umsetzen k&#246;nnen.
Um den ambitionierten Zeitplan der Richtlinie einhalten zu k&#246;nnen, wurden in Rheinland-Pfalz verschiedene Verfahren entwickelt, die es den Datenanbietern erlauben, die bisherigen etablierten GDI Standards WMS 1.1.1 sowie WFS 1.1.0 weiterzuverwenden, ohne ihre Basissoftware anpassen zu m&#252;ssen. Die komplexen Anforderungen werden dabei zentral &#252;ber eine "INSPIRE-Proxy" Funktionalit&#228;t der Service-Registry erf&#252;llt. Mit dieser Vorgehensweise ist Rheinland-Pfalz das einzige Fl&#228;chenland, dass bisher alle von der Richtlinie gesetzten Fristen einhalten konnte. Neben der Fassade f&#252;r die INSPIRE-konformen Darstellungs- und Downloaddiensten umfasst das Verfahren auch die automatisierte Bereitstellung der f&#252;r das EU-Berichtswesen geforderten "Monitoring"-Informationen.
Alle entwickelten Funktionen sind in die zugrundeliegende OSGEO Software Mapbender2 zur&#252;ckgeflossen und stehen damit frei zur Verf&#252;gung. Zus&#228;tzlich gibt es das komplette Portal auch in Form einer VM zum Download.
Im Vortrag werden die zugrundeliegenden Prinzipien der INSPIRE-Umsetzung kurz erl&#228;utert und die implementierten Funktionen anhand praktischer Beispiele vorgestellt. Au&#223;erdem soll ein Ausblick auf das grunds&#228;tzliche Potential gegeben werden, das trotz aller auftretender Probleme in INSPIRE steckt.</description>
        <persons>
          <person id="257">Armin Retterath</person>
        </persons>
        <links>
        </links>
      </event>
      <event guid="none" id="706">
        <date>2014-03-21T10:00:00+01:00</date>
        <start>10:00</start>
        <duration>00:30</duration>
        <room>H1</room>
        <slug></slug>
        <title>Moderne Geodatenbereitstellung im Kontext der europ&#228;ischen Geodateninfrastruktur INSPIRE</title>
        <subtitle></subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract>Der Vortrag behandelt aktuelle technische Entwicklungen bei der Umsetzung von INSPIRE-konformen Netzdiensten. Folgende Themenschwerpunkte sind vorgesehen: OGC WMTS 1.0, OGC WFS 2.0 (u. a. UMN MapServer), INSPIRE Pre-defined Atom-Feeds.</abstract>
        <description>Der Zeitplan der europ&#228;ischen Geodateninfrastruktur INSPIRE sieht die Bereitstellung von Darstellungs- und Downloaddiensten &#8211; f&#252;r die im Anhang III der Richtlinie aufgef&#252;hrten Themen &#8211; ab Dezember 2013 vor. 
F&#252;r die Realisierung von INSPIRE-Darstellungsdiensten werden zunehmend OGC-konforme WMTS-Dienste eingesetzt. Im Gegensatz zu den etablierten WMS-Diensten gelten &#8222;gecachte&#8220; Dienste als einfach und performant. Aufgrund der fehlenden Flexibilit&#228;t sind sie jedoch nicht f&#252;r jeden Anwendungsfall geeignet. Im Vortrag wird der OGC WMTS-Standard er&#246;rtert und auf die konkreten technischen Empfehlungen (Technical Guidance) seitens INSPIRE eingegangen. 
Weiterhin stellt die Realisierung von INSPIRE-Downloaddiensten die Datenanbieter seit 2012 vor Herausforderungen. Die WFS 2.0 Implementierung von GeoServer und deeegree wurde weiter verbessert, zudem wurde im Oktober 2013 mit der WFS 2.0 Implementierung f&#252;r den UMN MapServer begonnen. Der Status Quo der INSPIRE-geeigneten FOSS WFS 2.0 Implementierungen wird betrachtet. 
Des Weiteren finden INSPIRE Pre-defined Atom-Downloaddienste zunehmende Verbreitung. Die Funktionsweise von INSPIRE-Downloaddiensten auf Grundlage von Atom-Feeds (GeoRSS) und OpenSearch wird ausf&#252;hrlich vorgestellt. Atom-Feeds mit INSPIRE-Erweiterung k&#246;nnen inzwischen u. a. mit der beliebten Java-Bibliothek ROME gelesen und geschrieben werden.
INSPIRE-Downloaddienste k&#246;nnen &#8211; neben der Verwendung in klassischen Desktop-GIS &#8211; zur automatisierten Aktualisierung lokaler Geodatenrepositorien eingesetzt werden. Am Beispiel der gdal/ogr-Bibliothek werden verschiedene Einsatzm&#246;glichkeiten betrachtet. </description>
        <persons>
          <person id="354">J&#252;rgen Weichand</person>
        </persons>
        <links>
          <link href="http://www.mapserver.org/fr/development/rfc/ms-rfc-105.html">UMN MapServer MS-RFC-105 WFS 2.0</link>
          <link href="http://www.weichand.de/download/fossgis_2014_Weichand_INSPIRE-Netzdienste.pdf">Tagungsbandbeitrag (PDF)</link>
          <link href="http://www.weichand.de/download/fossgis_2014_Weichand_INSPIRE-Netzdienste.epub">Tagungsbandbeitrag (EPUB)</link>
          <link href="http://www.weichand.de/download/fossgis_2014_Weichand_INSPIRE-Netzdienste.mobi">Tagungsbandbeitrag (MOBI)</link>
          <link href="https://github.com/JuergenWeichand/geospatial-webservices-examples/tree/master/mapserver/wfs">UMN MapServer WFS 2.0 Beispiel (GitHub)</link>
          <link href="http://www.youtube.com/watch?v=Qj4-8OQv7Ng">Vortragsvideo (YouTube)</link>
        </links>
      </event>
      <event guid="none" id="685">
        <date>2014-03-21T11:00:00+01:00</date>
        <start>11:00</start>
        <duration>00:30</duration>
        <room>H1</room>
        <slug></slug>
        <title>Hochgenaue Zeit- und Positionsbestimmung</title>
        <subtitle></subtitle>
        <track>Vorträge (OSM)</track>
        <type>lecture</type>
        <language></language>
        <abstract>Eine Einf&#252;hrung in die Funktionsweise von Satellitenpositionsbestimmung mit interessanten und spannenden Details, die auch die Relevanz hochgenauer Positionsbestimmung f&#252;r OpenStreetMap nicht vermissen l&#228;sst.</abstract>
        <description>Die Grundlagen der Satellitenpositionsbestimmung sind den meisten wohl
bekannt. Dennoch bieten die Funktionsweise und Betriebsbedingungen von
GPS und Co. viele interessante und spannende Details. Z.B. wurde der
k&#252;nstliche Fehler von GPS abgeschaltet, damit das US-Milit&#228;r erh&#246;hte
Positionsgenauigkeit im Golfkrieg erhielt.

Dieser Vortrag f&#252;hrt in die Funktionsweise von GPS ein, und zeigt
viele Erweiterungen zur Erh&#246;hung der Genauigkeit, die von den
Systemarchitekten nie vorgesehen waren. Dies f&#252;hrt bis zu modernen
Verfahren f&#252;r RTKs, die in Echtzeit Positionsbestimmungen im
Millimeterbereich erm&#246;glichen.

Neben dieser Funktionsbeschreibung soll der Vortrag vor allem aber
auch einen &#220;berblick bieten, wie diese Hochgenauigkeit mit kleinen
Tricks auch mit handels&#252;blicher Hardware und OpenSource-Software
m&#246;glich ist und wieviel davon auch im Handy erreicht werden kann. Dass
diese exakte Positionsbestimmung auch in Zeiten hochaufl&#246;sender
Satellitenbilder nicht nur dem Selbstzweck dient wird abschlie&#223;end
anhand m&#246;glicher Anwendungen aufgezeigt und vorgestellt.</description>
        <persons>
          <person id="334">Peter Barth</person>
        </persons>
        <links>
        </links>
      </event>
      <event guid="none" id="711">
        <date>2014-03-21T11:30:00+01:00</date>
        <start>11:30</start>
        <duration>00:30</duration>
        <room>H1</room>
        <slug></slug>
        <title>Open-Source-Software &#8222;survey2GIS"</title>
        <subtitle>A flexible solution for the transfer of survey data into GIS /Eine flexible L&#246;sung f&#252;r den Transfer von Vermessungsdaten ins GIS</subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract></abstract>
        <description>Survey2GIS ist eine kompakte und benutzerfreundliche L&#246;sung, um Tachymeterdaten einer Grabung f&#252;r die Weiterverarbeitung in einem GIS aufzubereiten. Dabei werden zwei- oder dreidimensionale Punktmessdaten zu komplexen Geometrien (Linien und Polygonen) verbunden. Als Eingabedaten erwartet survey2gis eine oder mehrere einfache Textdateien, wobei jede Zeile die Koordinaten eines Punktes und die Attributdaten hierzu enth&#228;lt. Derart strukturierte Daten k&#246;nnen nicht nur tachymetrisch per Totalstation, sondern auch per GPS-Vermessung gewonnen werden. Auf dieser Grundlage erzeugt Survey2GIS GIS-Dateien im Format ESRI(tm) Shapefile (2D oder 3D), nach Geometrietypen getrennt, mit &#220;bernahme der vollst&#228;ndigen Attributdaten. Dieser Prozess l&#228;sst sich so konfigurieren, dass unterschiedlichste Arbeitsabl&#228;ufe und Datenstrukturen unterst&#252;tzt werden.
 
Die Software verf&#252;gt &#252;ber detaillierte Protokollfunktionen zur Qualit&#228;tssicherung und automatischen Dokumentation der Datenverarbeitung. Bei der Entwicklung von survey2GIS wurde gr&#246;&#223;ter Wert auf topologisch korrekte Ausgabedaten gelegt, die sich direkt f&#252;r die quantitative Analyse im GIS eignen. Hierzu geh&#246;ren Funktionen zum Eliminieren doppelter Messpunkte, zum Einrasten von St&#252;tzpunkten auf Polygongrenzen und zum "Ausstanzen" &#252;berlappender Polygone. 

Die freie Software (GNU General Public License) l&#228;uft unter Windows und Linux-Betriebssystemen.
Dabei steht die erste Version 1.x von surveying sowohl als eigenst&#228;ndige Software als auch als Zusatz f&#252;r das Open-Source-Desktop-GIS gvSIG CE zur Verf&#252;gung.
</description>
        <persons>
          <person id="417">David Bibby</person>
        </persons>
        <links>
        </links>
      </event>
    </room>
    <room name="H2">
      <event guid="none" id="693">
        <date>2014-03-21T09:00:00+01:00</date>
        <start>09:00</start>
        <duration>00:30</duration>
        <room>H2</room>
        <slug></slug>
        <title>Einsatzm&#246;glichkeiten von Open Source GIS im Geomarketing</title>
        <subtitle></subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract>Einsatzm&#246;glichkeiten von Open Source GIS im Geomarketing

Im modernen Marketing eines Unternehmens w&#228;chst der Bedarf an Geomarketing-Funktionalit&#228;ten st&#228;ndig. Der Beitrag soll die Einsatzm&#246;glichkeiten von Open Source GIS im Geomarketing analysieren und aufzeigen, welche Systeme f&#252;r das Geomarketing besonders geeignet sind. 
</abstract>
        <description>Autoren: Freckmann, Peter und Denis Majnaric

Einsatzm&#246;glichkeiten von Open Source GIS im Geomarketing

Im modernen Marketing eines Unternehmens w&#228;chst der Bedarf an Geomarketing-Funktionalit&#228;ten st&#228;ndig. Jedoch werden viele Unternehmen von der Tatsache, dass ein Software-Paket und die passenden Daten sehr kostenintensiv sind, abgeschreckt. Trotzdem k&#246;nnen viele Unternehmen nicht auf entsprechende Tools verzichten. In den letzten Jahren entstand ein gro&#223;er Markt f&#252;r frei zug&#228;ngliche Software, darunter auch Geographische Informationssysteme (Open Source GIS), die als Basis f&#252;r Analysen im Geomarketing dienen k&#246;nnen. Dieser Markt w&#228;chst stetig weiter.

Der Beitrag soll die Einsatzm&#246;glichkeiten von Open Source GIS im Geomarketing analysieren (use cases) und aufzeigen, welche Systeme sich f&#252;r Fragestellungen im Geomarketing besonders eignen. Auf Basis von verschiedenen Kriterien wird eine Evaluierung der Systeme durchgef&#252;hrt und die daraus abgeleiteten Erkenntnisse f&#252;r die optimale Wahl eines der g&#228;ngigen Open Source GIS vorgestellt. Dabei stehen sowohl Aspekte des klassischen Marketings als auch insbesondere des Geomarketings im Vordergrund. 
</description>
        <persons>
          <person id="409">Peter Freckmann</person>
        </persons>
        <links>
        </links>
      </event>
      <event guid="none" id="682">
        <date>2014-03-21T09:30:00+01:00</date>
        <start>09:30</start>
        <duration>00:30</duration>
        <room>H2</room>
        <slug></slug>
        <title>JasperReports als Reporting-Werkzeug f&#252;r QGIS</title>
        <subtitle>Vorstellung der ben&#246;tigten Komponenten und Workflow zur Reporterzeugung in einem LAN</subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract>GIS-Anwender w&#252;nschen sich h&#228;ufig Datenbl&#228;tter, die Tabelleninformationen zu einem Geoobjekt in einer les- und ausdruckbaren Form zusammenfassen. Der Vortag zeigt, wie aus QGIS heraus in einem LAN pdf-Dokumente mit dem Reporting-Werkzeug JasperReports erzeugt werden k&#246;nnen.</abstract>
        <description>Liegen GIS-Daten normalisiert in relationalen Datenbanken vor, ist ihre Lesbarkeit aus dem GIS heraus durch die Beziehungen der beteiligten Tabellen untereinander meistens nicht mehr direkt gegeben. Dar&#252;berhinaus interessieren h&#228;ufig r&#228;umliche Beziehungen zu Geometrieobjekten in anderen Tabellen. Anwender w&#252;nschen sich deshalb Datenbl&#228;tter, die alle Informationen zu einem Objekt in einer les- und ausdruckbaren Form zusammenfassen. F&#252;r derartige Datenbl&#228;tter sind dezidierte Reporting-Werkzeuge die erste Wahl, weil ein Desktop-GIS aufgrund seiner andersgelagerten Schwerpunkte voraussichtlich nie deren M&#246;glichkeiten erreichen wird.
Im Bereich der freien Software ist die in Java geschriebene JasperReports Library das bekannteste Reporting-Werkzeug. JasperReports bietet u.a. die Darstellung von Diagrammen und Graphiken sowie Punkten auf GoogleMaps. Die Werkzeuge IReport Designer bzw. Jaspersoft Studio stellen eine WYSIWYG-Oberfl&#228;che zur Verf&#252;gung, die es auch Einsteigern erm&#246;glicht, Reportdateien herzustellen.
Der Vortag zeigt, wie aus QGIS heraus mittels Python in einem LAN pdf-Dokumente mit der JasperReports Implementierung PyJasper erzeugt werden, die auch Kartenausschnitte des Geoobjekts enthalten k&#246;nnen. Die anzuzeigenden Daten werden daf&#252;r in QGIS als XML-String formatiert und zusammen mit einer Reportdatei an den PyJasper-Server &#252;bertragen. Dort wird der Report kompiliert und mit den Daten ein pdf-Dokument gef&#252;llt, das an QGIS zur&#252;ckgegeben wird.</description>
        <persons>
          <person id="299">Bernhard Str&#246;bl</person>
        </persons>
        <links>
        </links>
      </event>
      <event guid="none" id="727">
        <date>2014-03-21T10:00:00+01:00</date>
        <start>10:00</start>
        <duration>00:30</duration>
        <room>H2</room>
        <slug></slug>
        <title>Maps for ESA</title>
        <subtitle>ESA User Services powered by Open Data &amp; Open Source</subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract>Open Data (z.B. OpenStreetMap, EU-DEM und GlobCover) und Open Source Software wie MapCache, EOxServer, MapServer und GDAL bilden die Basis f&#252;r Karten der neuen Benutzerdienste der Europ&#228;ischen Weltraumorganisation (ESA).</abstract>
        <description>Die neuen Benutzerdienste der Europ&#228;ischen Weltraumorganisation (ESA) verwenden aus Open Data generierte Karten. Die Gel&#228;ndekarte zum Beispiel basiert unter anderem auf OpenStreetMap, EU-DEM, und GlobCover Daten und wurde von EOX designed. Der Browse Server, zust&#228;ndig f&#252;r die standardkonforme Auslieferung von Karten und Vorschaubildern (Browse Images), basiert ausschlie&#223;lich auf Open Source Software wie MapCache, EOxServer, MapServer und GDAL und wird im Rahmen des ngEO Projektes von EOX entwickelt. Der Vortrag stellt sowohl das Design der Karten als auch die Architektur und Funktionalit&#228;t des Browse Servers vor.</description>
        <persons>
          <person id="258">Stephan Mei&#223;l</person>
        </persons>
        <links>
          <link href="https://schpidi.github.io/fossgis2014_maps-for-esa">Folien zum Vortrag</link>
        </links>
      </event>
      <event guid="none" id="637">
        <date>2014-03-21T11:00:00+01:00</date>
        <start>11:00</start>
        <duration>00:30</duration>
        <room>H2</room>
        <slug></slug>
        <title>geoCRE - eine kollaborative Forschungsumgebung zur Verwaltung r&#228;umlicher Daten</title>
        <subtitle>Entwicklung einer webbasierten kollaborativen Forschungsumgebung zur Verwaltung r&#228;umlicher Daten auf Basis freier Software</subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract>Zur kollaborativen Verwaltung raumbezogener Daten wurde an der Physischen Geographie der Uni Freiburg ein webbasiertes Tool auf Basis freier Software entwickelt. Dieser Vortrag soll Einblicke in die Technik geben und Praxiserfahrungen in aktuellen Forschungsprojekten vermitteln.</abstract>
        <description>In Forschungsprojekten, an denen mehrere Personen beteiligt sind, stellt die Datenverwaltung h&#228;ufig eine gro&#223;e Herausforderung dar. Unterschiedliche Datenformate, die Speicherung der Daten auf verschiedenen lokalen Datentr&#228;gern, Datenverluste und ungen&#252;gende Dokumentation k&#246;nnen f&#252;r erhebliche Probleme sorgen. Auch der Austausch der aktuellen Datenbest&#228;nde unter den Projektteilnehmern kann Schwierigkeiten bereiten, was die Zusammenarbeit in Forschungsprojekten weiter einschr&#228;nken kann.
Aus diesen Gr&#252;nden wurde an der Physischen Geographie der Uni Freiburg ein webbasiertes Werkzeug entwickelt, welches das kollaborative Arbeiten mit Geodaten vereinfachen soll. Der Fokus lag dabei auf niedrigen Zugangsh&#252;rden, Benutzerfreundlichkeit und hoher Flexibilit&#228;t beim Export der Daten, um eine problemlose Weiterverarbeitung in g&#228;ngigen Programmen zu erm&#246;glichen. Gerade f&#252;r das Bearbeiten r&#228;umlicher Daten sind normalerweise spezielle Software und Kenntnisse erforderlich. Als webbasierte Applikation stehen die zur Dateneingabe erforderlichen Werkzeuge online zur Verf&#252;gung und eine intuitiv zu bedienende Benutzeroberfl&#228;che erm&#246;glicht die Nutzung auch ohne spezielle GIS-Kenntnisse. Weiterhin sorgt die Webapplikation f&#252;r eine standardisierte Datenspeicherung, Datenvalidierung und erm&#246;glicht das einfache Sichern und Archivieren der Daten.
Die Webapplikation besteht aus einem in der Skriptsprache PHP geschriebenen Hauptprogramm. Dar&#252;ber hinaus wurde auf verschiedene Open-Source-Komponenten zur&#252;ckgegriffen, darunter die Webserver-Software Apache HTTP Server, das Datenbankmanagementsystem PostgreSQL mit der Geodaten-Erweiterung PostGIS und die Web-Mapping Bibliothek OpenLayers. Durch die Verwendung dieser frei verf&#252;gbaren Komponenten war es m&#246;glich, innerhalb kurzer Zeit und mit geringen Kosten ein praxistaugliches Werkzeug zur kollaborativen Geodatenverwaltung zu entwickeln.</description>
        <persons>
          <person id="384">Mark Hoschek</person>
        </persons>
        <links>
          <link href="http://geocre.net/">geoCRE - a collaborative research environment for geographic research purposes</link>
        </links>
      </event>
      <event guid="none" id="652">
        <date>2014-03-21T11:30:00+01:00</date>
        <start>11:30</start>
        <duration>00:30</duration>
        <room>H2</room>
        <slug></slug>
        <title>GeoNode2.0 als Geoportall&#246;sung f&#252;r das EU-Projekt CLIMB</title>
        <subtitle>Ein Erfahrungsbericht</subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract></abstract>
        <description>Das von der EU finanzierte Umweltforschungsprojekt CLIMB (Climate Induced Changes on the Hydrology of Mediterranean Basins; www.climb-fp7.eu) untersucht die Auswirkungen des Klimawandels auf die Hydrologie und das Management von Wasserressourcen im mediterranen Raum. Aufgabe eines Teilprojektes war der Aufbau eines Geodatenportals f&#252;r den projektinternen Austausch von Geodaten und die Bereitstellung der auf verschiedenen Klimaszenarien aufsetzenden hydrologischen Ergebnisdaten (wie Oberfl&#228;chenabfluss, Trockenperioden, Bodenfeuchte) in Form von Karten, tabellarischen Zeitreihendaten und automatisiert generierten Abbildungen hydrologisch relevanter Zeitreihendaten. Die zu verwendende Softwarel&#246;sung sollte den Projektpartnern eine individuelle Verwaltung der von ihnen in das Portal eingestellten Daten erm&#246;glichen. Um dar&#252;ber hinaus das Einbinden projektspezifischer Funktionalit&#228;ten zu gestatten, sollte die Software erweiterbar sein. Die hier beschriebene Geoportall&#246;sung basiert auf GeoNode (Ver. 2.0b64), da dieses System nicht nur die o.g. projektseitigen Anforderungen erf&#252;llt, sondern auch ein f&#252;r EinsteigerInnen geeignetes &#8222;GDI-Gesamtpaket&#8220; mit Metadatenkatalog (pycsw), Kartenserver (GeoServer) und WMS-Client (OpenLayers + GeoExt) ist.
Dieser Beitrag schildert die Erfahrungen mit GeoNode2.0 als Geoportall&#246;sung f&#252;r ein internationales, wissenschaftliches Gro&#223;projekt. Dabei wird auf die Nutzung von GeoNode als Content Management System eingegangen und dargestellt, welche besonderen Herausforderungen sich mit Blick auf die unterschiedlichen nationalen Standards in der Haltung von Geodaten ergeben. In diesem Zusammenhang wird gezeigt, wie GeoNode mittels Django und JavaScript zwecks Bereitstellung und Visualisierung der Zeitreihendaten erweitert wurde und welche Tools sich als hilfreich im Umgang mit gro&#223;en Datenmengen in GeoNode erwiesen haben. Im Einzelnen werden dabei die python-Pakete &#8222;gsconfig&#8220; und &#8222;psycopg2&#8220; kurz vorgestellt. 
</description>
        <persons>
          <person id="444">Michael Blaschek</person>
        </persons>
        <links>
        </links>
      </event>
    </room>
    <room name="H3">
      <event guid="none" id="671">
        <date>2014-03-21T09:00:00+01:00</date>
        <start>09:00</start>
        <duration>00:30</duration>
        <room>H3</room>
        <slug></slug>
        <title>OpenSeaMap</title>
        <subtitle>OpenData - Erfahrungen mit Beh&#246;rden, international</subtitle>
        <track>Vorträge (OSM)</track>
        <type>lecture</type>
        <language></language>
        <abstract></abstract>
        <description>OpenData ist in aller Munde...
aber wie sieht es in der Praxis aus?
Erfahrungen mit Bundes- und Landesbeh&#246;rden in DE und international.

OpenSeaMap hat in den letzten Monaten mit vielen Beh&#246;rden sehr positive Erfahrungen gemacht:
- Bundesamt f&#252;r Seeschiffahrt und Hydrogrphie
- Wasser- nd Schiffahrtsverwaltung
- Bundesamt f&#252;r Kartographie und Geod&#228;sie
- SwissTopo
- Land Bayern
- Land Baden-W&#252;rtemberg
- Land Vorarlberg
und weitere Beh&#246;rden

Manchmal steckt der Teufel im Detail... ;-)</description>
        <persons>
          <person id="215">Markus</person>
        </persons>
        <links>
        </links>
      </event>
      <event guid="none" id="729">
        <date>2014-03-21T09:30:00+01:00</date>
        <start>09:30</start>
        <duration>00:30</duration>
        <room>H3</room>
        <slug></slug>
        <title>Open Geodata f&#252;r Ulm - ein Ansatz f&#252;r das Crowdsourcing von Geodaten auch f&#252;r nicht OSM'ler</title>
        <subtitle></subtitle>
        <track>Vorträge (OSM)</track>
        <type>lecture</type>
        <language></language>
        <abstract></abstract>
        <description>Das Schlagwort OpenData geistert seit einiger zeit durch Deutschlands Verwaltungen. Und zu Recht, denn immer mehr Menschen interessieren sich heutzutage f&#252;r &#246;ffentlich zug&#228;ngliche Daten, insbesondere auch f&#252;r Geodaten - zahlreiche Beispiele f&#252;r kostenfreie Services und Anwendungen, die die Geodaten als OpenData f&#252;r den Nutzer frei zur Verf&#252;gung stellen, finden sich im Internet. Es geht hierbei au&#223;erdem h&#228;ufig nicht nur um reines &#8222;Gucken&#8220;, sondern zunehmend auch um das Mitmachen und Mitgestalten von Geodaten durch den Nutzer selbst. OpenStreetMap ist ein leuchtendes Beispiel daf&#252;r.

Aus diesen &#220;berlegungen heraus wurde 2012 in einer Vorstudie gepr&#252;ft, wie sich die Stadt Ulm am OpenData-Gedanken beteiligen kann. Im Fr&#252;hjahr 2013 wurde dann das Projekt &#8222;map-it.ulm.de&#8220; als eine Anwendung zum Sammeln von freien Daten &#252;ber die B&#252;rger einer Stadt im Rahmen der Gesamtumsetzung des &#246;ffentlichen Geoportals der Stadt Ulm verwirklicht.

Das Projekt hat mit der 1. Aktion &#8222;Zeig mir deinen Lieblingsplatz!&#8220; Ende Juni 2013 begonnen. Das Ziel war, die meist geliebten Orte in Ulm und Umgebung, aufgeteilt in 5 Kategorien, &#252;ber Eintragung in der Karte durch Ditigalizieren zu sammeln und diese zu bewerten. Zu diesem Zweck wurde eine auf der OpenSource JavaScript Bibliotheken Ext JS 4.1.1, OpenLayers 2.12 und GeoExt 2 GIS-Applikation entwickelt. Durch die benutzerfreundliche Bedienung und zahlreiche Texthinweise konnte die Eintragung von Lieblingspl&#228;tzen sehr intuitiv gestaltet werden. In knapp 2 Wochen wurden auf diese Art und Weise &#252;ber 450 POIs gesammelt, mehr als 900 Menschen haben am Projekt teilgenommen. Der gesammelte Datensatz wurde anschlie&#223;end im Geoportal der Stadt Ulm ver&#246;ffentlicht, mit den OSM POI-Daten abgeglichen und ist jederzeit zum Anschauen und Download als Open Data abrufbar.

Dieser Vortrag soll einen Ausblick &#252;ber verwendete Techniken und Ideen zur Projektrealisierung geben und diskutieren, ob und wie dies ein Weg sein kann, einfache POI-Daten, auch f&#252;r OpenStreetMap zu sammeln.</description>
        <persons>
          <person id="414">Anna Rieger</person>
        </persons>
        <links>
        </links>
      </event>
      <event guid="none" id="677">
        <date>2014-03-21T10:00:00+01:00</date>
        <start>10:00</start>
        <duration>00:30</duration>
        <room>H3</room>
        <slug></slug>
        <title>enviroCar - Crowdsourcing zur Erhebung von Verkehrsdaten</title>
        <subtitle></subtitle>
        <track>Vorträge (OSM)</track>
        <type>lecture</type>
        <language></language>
        <abstract>In diesem Vortrag wird das 52&#176;North enviroCar-Projekt (enviroCar.org) vorgestellt. Ziel ist die Entwicklung einer offenen Crowdsourcing-L&#246;sung, um in Fahrzeugen verf&#252;gbare Messdaten (z.B. Verbrauch) f&#252;r weitere Analysen zu erschlie&#223;en (z.B. Umwelt-Monitoring).</abstract>
        <description>Der Stra&#223;enverkehr ist ein entscheidender Faktor f&#252;r die Umweltbelastung und Lebensqualit&#228;t in St&#228;dten. Um seine Auswirkungen optimal absch&#228;tzen zu k&#246;nnen und die Planung von Ma&#223;nahmen wie verkehrsberuhigte Zonen zu unterst&#252;tzen, ist eine solide Datenbasis unverzichtbar. &#220;ber  Verkehrsz&#228;hlungen oder die Auswertung von Mobilfunknetzten ist es zwar bereits m&#246;glich Daten &#252;ber Verkehrsdichte und -fluss zu erhalten. Aussagen &#252;ber Umwelteinfl&#252;sse sind hieraus aber nicht direkt abzuleiten. Gleichzeitig verf&#252;gen jedoch nahezu alle aktuellen Fahrzeuge &#252;ber zahlreiche Sensoren, welche weitere Messdaten liefern aus denen sich relevante Umwelteinfl&#252;sse ableiten lassen (z.B. L&#228;rmemission, Kraftstoffverbrauch und CO2-Aussto&#223;).

In diesem Vortrag wird das enviroCar-Projekt (http://enviroCar.org) vorgestellt. Grundidee dieses Projekts ist die Entwicklung einer Crowdsourcing-L&#246;sung welche die in Fahrzeugen verf&#252;gbaren Messdatenquellen f&#252;r weitergehende Analysen und Auswertungen erschlie&#223;t. Hierf&#252;r wird die standardisierte OBD2-Schnittstelle genutzt, welche einen Zugang zu den von einem Auto erhobenen Messdaten erm&#246;glicht. Durch die Kopplung dieser OBD2-Schnittstelle an Smart Phones (&#252;ber einen Bluetooth-Adapter) ist es m&#246;glich, die gemessenen Daten zu sammeln und an einen zentralen Datenserver zu &#252;bertragen.

Neben konzeptionellen Aspekten (insbesondere Architektur und Datenschutz) stellt dieser Vortrag die zugrundeliegende Implementierung auf Basis von Open Source-Software vor.</description>
        <persons>
          <person id="39">Simon Jirka</person>
        </persons>
        <links>
        </links>
      </event>
      <event guid="none" id="660">
        <date>2014-03-21T11:00:00+01:00</date>
        <start>11:00</start>
        <duration>00:30</duration>
        <room>H3</room>
        <slug></slug>
        <title>OpenStreetMap bei Toll Collect</title>
        <subtitle></subtitle>
        <track>Vorträge (OSM)</track>
        <type>lecture</type>
        <language></language>
        <abstract></abstract>
        <description>Das von der Toll Collect GmbH betriebene System zur Erhebung und Abrechnung der Lkw-Maut auf deutschen Autobahnen und Bundesstra&#223;en basiert u.a. auf genauen und aktuellen Stra&#223;endaten. Auf Basis von Stra&#223;enkarten kommerzieller Anbieter und Vermessungsdaten einer eigenen Messflotte pflegen und optimieren wir seit nunmehr &#252;ber einem Jahrzehnt eine Stra&#223;enkarte h&#246;chster Qualit&#228;t. Doch nicht immer reichen die Informationen aus der kommerziellen Karte, der Messflotte oder auch dem Baustelleninformationssystem des Bundes aus, um Ver&#228;nderungen im Stra&#223;ennetz rechtzeitig zu erkennen.

In den letzten Jahren wurde daher OpenStreetMap als zus&#228;tzliche Informationsquelle eingesetzt. Die  OSM-Karte wird als zus&#228;tzliche Basiskarte im  betrieblich eingesetzten GIS verwendet. Vektordaten und Ver&#228;nderungen in den Stra&#223;engeometrien aus OSM werden f&#252;r diverse Analysen regelm&#228;&#223;ig eingesetzt und im f&#252;r uns relevanten mautpflichtigen Netz ausgewertet.

F&#252;r zahlreiche Anwendungsf&#228;lle der Toll Collect haben sich die Daten der OpenStreetMap bew&#228;hrt, dennoch k&#246;nnen wir noch nicht auf die klassischen Kartenanbieter verzichten. Wir m&#246;chten berichten, was uns davon abh&#228;lt, OSM-Daten noch enger in unseren Produktivbetrieb einzubinden und welche Potenziale, aber auch welche Schw&#228;chen wir in der heutigen OSM sehen.
</description>
        <persons>
          <person id="387">Florian Reimann</person>
        </persons>
        <links>
        </links>
      </event>
      <event guid="none" id="700">
        <date>2014-03-21T11:30:00+01:00</date>
        <start>11:30</start>
        <duration>00:30</duration>
        <room>H3</room>
        <slug></slug>
        <title>Die Einsatzkarte</title>
        <subtitle>eine interaktive Karte f&#252;r freiwillige Rettungskr&#228;fte</subtitle>
        <track>Vorträge (OSM)</track>
        <type>lecture</type>
        <language></language>
        <abstract></abstract>
        <description>Die Einsatzkarte : eine interaktive Karte f&#252;r freiwillige Rettungskr&#228;fte

Wir, die K&#252;stenschmiede entwickeln Web-Anwendungen, die vorzugsweise interaktive Karten integrieren. Dabei setzen wir in erster Linie auf OpenStreetMap, OpenLayers, die Overpass-API und auf das Open-Source Content-Management-System Contao. Wir haben f&#252;r das CMS den Erweiterungsbaukasten con4gis geschrieben, der Module bereitstellt, die es einfach machen, interaktive Karten ohne Programmierkenntnisse zu integrieren. Dies soll u.a. auch dazu beitragen dass die OpenStreetMap weitere Verbreitung findet. 

Aktuell arbeiten wir zusammen mit dem Kreisfeuerwehrverband Friesland an einer OSM-basierten Einsatzkarte f&#252;r freiwillige Rettungskr&#228;fte, die es erm&#246;glichen wird, die Eins&#228;tze besser vorzubereiten und zu planen. Dazu haben wir bereits z.B. mehrere tausend Hydranten in die OSM eingespielt. Noch befindet sich die Einsatzkarte im beta-Test, sie soll jedoch sp&#228;testens zum Januar 2014 online gehen und weiteren freiwilligen Rettungsverb&#228;nden vorgestellt werden.

In unserem Vortrag m&#246;chten wir &#252;ber das Projekt berichten, die Anwendungsszenarien f&#252;r die Einsatzkr&#228;fte darstellen und nicht zuletzt die technische Umsetzung erl&#228;utern.

Wir freuen uns, wenn wir auf der FossGis 2014 unser Projekt &#8218;Einsatzkarte&#8216; in einem Vortrag pr&#228;sentieren d&#252;rfen.


</description>
        <persons>
          <person id="410">Claus Vathauer</person>
        </persons>
        <links>
        </links>
      </event>
    </room>
    <room name="H4">
    </room>
    <room name="WS 429">
      <event guid="none" id="683">
        <date>2014-03-21T09:00:00+01:00</date>
        <start>09:00</start>
        <duration>01:30</duration>
        <room>WS 429</room>
        <slug></slug>
        <title>Mapbender3 Workshop</title>
        <subtitle>Aufbau und Konfiguration einer WebGIS Anwendung mit Mapbender3</subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language></language>
        <abstract></abstract>
        <description>Der Workshop soll den Teilnehmern einen ersten Einstieg in die Erstellung von Kartenanwendungen auf Basis von Mapbender3 geben. Neben einem &#220;berblick &#252;ber die neue Architektur auf Basis von Symfony2 und OpenLayers und der Vorstellung des Frontends mit seinen Komponenten wird die Verwendung des Backends zur Verwaltung von Anwendungen im Mittelpunkt stehen.

Dabei werden die M&#246;glichkeiten des Aufbaus von eigenen Anwendungen &#252;ber das  Administrations-Backend erl&#228;utert. Der Aufbau eines Dienste-Repositories wird vorgestellt. Es werden Benutzer und Gruppen angelegt. Au&#223;erdem erfolgt ein Einstieg in die Rechteverwaltung.

Inhalt des Workshops:

    Vorstellung der Anwendung 
    Vorstellung des Administration-Backends
    Erstellung einer Applikation (Kartenanwendung) inkl. Berechtigungen
    Aufbau eines Dienste-Repositories
    Einrichten von Benutzern und Gruppen sowie Rechteverwaltung
</description>
        <persons>
          <person id="65">Astrid Emde</person>
        </persons>
        <links>
          <link href="http://svn.osgeo.org/mapbender/trunk/documents/presentations/FOSSGIS2014/FOSSGIS2014_Mapbender3_2014_Workshop_AEmde.pdf">Folien zum Mapbender3 Workshop</link>
          <link href="http://doc.mapbender3.org/de/book/quickstart.html">Quickstart - der Einfache Einstieg in Mapbender3</link>
          <link href="http://doc.mapbender3.org/de/book/templates.html">Wie lege ich ein eigenes Template an?</link>
          <link href="http://doc.mapbender3.org/en/book/installation.html">Mapbender3 Installation</link>
          <link href="http://mapbender3.org/builds/install_mapbender3.sh">Installationsscript</link>
          <link href="https://github.com/mapbender/mapbender-workshop/archive/master.zip">Workshop Demo Bundle</link>
          <link href="http://mapbender3.org">Mapbender3 Webseite</link>
        </links>
      </event>
    </room>
    <room name="WS 438">
      <event guid="none" id="710">
        <date>2014-03-21T09:00:00+01:00</date>
        <start>09:00</start>
        <duration>01:30</duration>
        <room>WS 438</room>
        <slug></slug>
        <title>Einstieg in die WebGIS-3D Welt</title>
        <subtitle></subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language></language>
        <abstract></abstract>
        <description>Die GIS-Welt hat die 3. Dimension schon seit langem fest im Blick. Kein Wunder also, dass auch die Darstellung von 3D-Geoinformationen im Browser immer mehr in den Fokus r&#252;ckt. Der Workshop soll ein Gef&#252;hl &#252;ber die aktuellen M&#246;glichkeiten im Bereich von OpenSource 3D-WebGIS vermitteln und legt dabei einen besonderen Fokus auf die Verzahnung von bew&#228;hrten Techniken wie PostGIS, GeoServer, ExtJS sowie 3D Bibliotheken.

Der Workshop gliedert sich in 3 Teile:

Im 1. Teil wird ein &#220;berblick &#252;ber bestehende Open Source Bibliotheken gegeben, mit denen Daten in der 3. Dimension angezeigt werden k&#246;nnen. Dabei werden Projekt-Beispiele vorgestellt und der Einsatzbereich der jeweiligen Bibliotheken diskutiert.

Im 2. Teil legen die Teilnehmer selber &#8222;hands on&#8220; und werden mit einem auf Cesium und ExtJS basierenden WebGIS-Client, der als Prototyp f&#252;r ein Freizeit-Community-Portal entstanden ist, arbeiten und einfache API-Funktionen von Cesium kennen lernen (u.a. Einbinden von Kartendiensten). Dabei k&#246;nnen die Teilnehmer eine selbst mitgebrachte GPX-Datei (oder eine von uns), z.B. einer Wanderung, eines Segelflugs oder auch einer Rafting- oder Fahrradtour selber in den o.g. Client einladen. Die Daten werden dann &#228;hnlich einem Video nach Zeitstempeln der verschiedenen Koordinaten abgespielt.

Im 3. Teil wird ein weiterer 3D-Client sowie einige 3D-Funktionen von PostGIS vorgestellt. Der Client basiert auf ExtJS und X3Dom. Die Teilnehmer werden selber eine Punktwolke mit x,y,z-Werten in PostGIS laden, diese dort in eine 3D-Oberfl&#228;che umwandeln und schlie&#223;lich die Oberfl&#228;che im 3D-Client visualisieren.

Der Workshop richtet sich an alle, die sich f&#252;r das Thema WebGIS und 3D interessieren. Vorkenntnisse sind nicht erforderlich.</description>
        <persons>
          <person id="416">Daniel Koch</person>
          <person id="23">Till Adams</person>
        </persons>
        <links>
        </links>
      </event>
    </room>
    <room name="WS 439">
      <event guid="none" id="704">
        <date>2014-03-21T09:00:00+01:00</date>
        <start>09:00</start>
        <duration>01:30</duration>
        <room>WS 439</room>
        <slug></slug>
        <title>GeoExt 2  - Workshop</title>
        <subtitle></subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language></language>
        <abstract></abstract>
        <description>GeoExt ist eine Javascript-Bibliothek zur Erstellung von umfangreichen, webbasierten GIS-Applikationen. Die Bibliothek baut auf Ext JS und OpenLayers auf und ist mittlerweile in der Version 2.0 verf&#252;gbar. Ext JS bietet dabei UI-Komponenten und solide Schnittstellen zur Datenverarbeitung. OpenLayers ist der de facto Standard f&#252;r dynamisches Web mapping.

GeoExt bietet neben kartenbezogenen UI-Komponenten zudem den Zugang zu OGC-Services, OpenLayers Objekten und entfernten Datenquellen. Dazu dient eine gro&#223;e Auswahl an Widgets. Von der Combobox, &#252;ber Grids bis hin zu Karten und Trees. Die benutzerfreundliche API reduziert dabei den Code und f&#252;hrt zu ansprechenden und intuitiven Mapping-Applikationen.

Die neueste Version von GeoExt2 basiert auf den aktuellen Versionen von OpenLayers (2.13.1) und Ext JS (4.2.1).

Der Workshop wird theoretische Grundlagen zu den Funktionen und den Umgang mit GeoExt 2 vermitteln. Mit einher gehen verschiedene praktische &#220;bungsaufgaben, an denen die Anwendung und Funktionsweise von jedem Teilnehmer ausprobiert und nachvollzogen werden kann. Der Workshop richtet sich somit sowohl an Neulinge als auch an diejenigen, die bereits Erfahrungen mit Geoext1.x gesammelt haben, da der Umstieg auf die neue Version deutlich erleichtert wird.

Durchgef&#252;hrt wird der Workshop von Kernentwicklern von GeoExt2.

Vorwissen: Grunds&#228;tzliche Kenntnisse von JavaScript oder OpenLayers/ExtJS sind n&#252;tzlich, werden aber nicht zwingend vorausgesetzt.</description>
        <persons>
          <person id="162">Johannes Weskamm</person>
        </persons>
        <links>
        </links>
      </event>
    </room>
    <room name="Beuthhalle">
    </room>
  </day>
</schedule>
