<?xml version="1.0" encoding="UTF-8"?>
<schedule>
  <conference>
    <title>FOSSGIS 2015</title>
    <subtitle>Konferenz f&#252;r freie und Open Source-Software im GIS-Bereich und f&#252;r freie Geodaten</subtitle>
    <venue>Westf&#228;lische Wilhelms-Universit&#228;t</venue>
    <city>M&#252;nster</city>
    <start>2015-03-11</start>
    <end>2015-03-13</end>
    <days>3</days>
    <release>69887500199100</release>
    <day_change>07:00</day_change>
    <timeslot_duration>00:15</timeslot_duration>
  </conference>
  <day index="1" start="1" end="1" date="2015-03-11">
    <room name="Aula">
      <event id="901" guid="none">
        <date>2015-03-11T13:00:00+01:00</date>
        <start>13:00</start>
        <duration>00:30</duration>
        <room>Aula</room>
        <slug></slug>
        <title>Er&#246;ffnung</title>
        <subtitle></subtitle>
        <track></track>
        <type></type>
        <language></language>
        <abstract>Er&#246;ffnungsveranstaltung der FOSSGIS-Konferenz 2015.  

Kurze Begr&#252;&#223;ung durch den Veranstalter (FOSSGIS e.V.) und Gru&#223;worte der gastgebenden Universit&#228;t durch Herrn Prof. Dr. Edzer Pebesma, stellvertretender Direktor des IFGI. 
Anschlie&#223;ende Vorstellung des Goldsponsors WhereGroup GmbH &amp; Co. KG durch Olaf Knopp.
</abstract>
        <description></description>
        <persons>
          <person id="142">Dominik Helle</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="890" guid="none">
        <date>2015-03-11T13:30:00+01:00</date>
        <start>13:30</start>
        <duration>00:30</duration>
        <room>Aula</room>
        <slug></slug>
        <title>Nicht zuschauen - Mitmachen!</title>
        <subtitle>10 Arten, wie Sie OpenStreetMap voranbringen k&#246;nnen</subtitle>
        <track>Vorträge (OSM)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>OpenStreetMap lebt vom Mitmachen. Dieser Vortrag zeigt einige naheliegende und einiger weniger naheliegende Wege auf, wie auch Sie OpenStreetMap weiter voranbringen k&#246;nnen - als Privatperson, als Unternehmen, oder als Teil der &#246;ffentlichen Hand. </abstract>
        <description>Dass jeder bei OpenStreetMap einen Account anmelden kann, ist bekannt - trotzdem schadet es nichts, das ab und zu zu wiederholen, und vor allem auf neue, einfachere M&#246;glichkeiten der Datenerhebung hinzuweisen. Viele m&#246;gen vielleicht denken, "es ist doch schon alles da", aber weit gefehlt - jeder hat noch irgendwas im Kopf, was bei OSM n&#252;tzlich sein kann.

Das direkte Beisteuern von Daten ist aber nur einer von vielen Wegen, OSM n&#252;tzlich zu sein. Auch "indirekte" Datenbereitstellungen - Luftbilder, Vergleichsdaten, Stra&#223;enlisten und so weiter - k&#246;nnen dem Projekt n&#252;tzen.

Hacker lassen sich von den OSM-Daten zu neuer Software inspirieren und demonstrieren damit, was mit den freien Daten alles m&#246;glich ist. Sogar einige Unternehmen entwickeln mittlerweile Open Source Software, die in OpenStreetMap eingesetzt werden kann, sei es zur Erfassung oder Nutzung der Daten - auch das bringt das OpenStreetMap-Universum voran.

Privatleute und Organisationen werden Mitglied im FOSSGIS e.V. oder der OSM Foundation und st&#228;rken so die Position dieser institutionellen St&#252;tzen des OpenStreetMap-Projekts. Interessierte bringen sich in die Arbeit in verschiedenen Gremien der Vereine ein - zum Beispiel bei den "Working Groups" der OSM Foundation, die immer Leute suchen.

Nicht zuletzt helfen nat&#252;rlich auch Geldspenden an den FOSSGIS e.V. oder die OSM Foundation, wichtige Investitionen f&#252;r das Projekt zu decken.

Dieser Vortrag stellt die verschiedenen M&#246;glichkeiten vor, OSM zu helfen - in der Hoffnung, dass f&#252;r jede(n) im Publikum etwas dabei ist.</description>
        <persons>
          <person id="95">Frederik Ramm</person>
        </persons>
        <links>
          <link href="http://">http://</link>
        </links>
      </event>
      <event id="826" guid="none">
        <date>2015-03-11T14:00:00+01:00</date>
        <start>14:00</start>
        <duration>00:30</duration>
        <room>Aula</room>
        <slug></slug>
        <title>Softwarewartung f&#252;r OpenSource. Ein Widerspruch?</title>
        <subtitle></subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract>In meinem Vortrag m&#246;chte ich ein Thema diskutieren, das sowohl die Open Source Welt, als auch die kleine, heile FOSSGIS-Welt und damit nat&#252;rlich auch uns bei terrestris seit einiger Zeit umtreibt:
Softwarewartung f&#252;r Open Source!</abstract>
        <description>Der Inhalt des Vortrags Talks widmet sich der Software-Wartung bzw. Betriebssicherheit. Wenn es darum geht, Open Source Software einzusetzen, wird dem oft das Argument entgegengesetzt, das ja keiner verantwortlich sei, das es keine Betriebsgarantie gibt und die Entwickler ja &#8222;morgen schon was anderes machen k&#246;nnten&#8220;. Ich sehe dies als letzte Bastion der propriet&#228;ren Hersteller im k&#252;rzlich als zu Ende erkl&#228;rtem Glaubenskrieg zwischen Propriet&#228;rer und Open Source Software-Verfechtern.

Ich m&#246;chte in meinem Vortrag nicht diskutieren, inwieweit Architekturwechsel propriet&#228;rer Hersteller in der Vergangenheit dazu gef&#252;hrt haben, das Unsummen an investiertem Geld trotz sogenannter Betriebssicherheit unwiderbringlich den Rhein herabgeflossen sind (Stichwort ArcView GIS, Windows XP u.v.m.). Trotzdem wird solchen Anbietern eher zugetraut, das eine angebotene Softwarewartung zu Betriebs- und damit Investitionssicherheit beitr&#228;gt. Im Vortrag steht vielmehr die Frage im Raum, ob es eine Verletzung des Open Source Grundsatzes ist, wenn eine Firma, die ma&#223;geblich hinter der Entwicklung einer oder mehrerer Open Source (GIS-)Projekten steht, eine solche Wartung nach propriet&#228;rem Gesch&#228;ftsmodell zu einem j&#228;hrlichen Fixpreis anbietet? Kann das Angebot von Betriebssicherheit und auch Support dazu f&#252;hren, das Open Source eher eingesetzt wird? W&#252;rde ein solches Angebot &#252;berhaupt Chancen beim Kunden haben - da sie ja anders als beim propriet&#228;ren Gesch&#228;ftsmodell nicht obligatorisch w&#228;re (sein kann!)? De Fakto bieten Firmen solche Modelle bereits an, es stellt sich die Frage, ob der Markt reif ist f&#252;r diese n&#228;chste &#8222;Professionalisierungsstufe&#8220;?

All dies sind Fragen die ich in meinem Vortrag behandeln und anschlie&#223;end gerne auch diskutieren m&#246;chte. </description>
        <persons>
          <person id="23">Till Adams</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="902" guid="none">
        <date>2015-03-11T14:30:00+01:00</date>
        <start>14:30</start>
        <duration>00:30</duration>
        <room>Aula</room>
        <slug></slug>
        <title>Lightning Talks</title>
        <subtitle></subtitle>
        <track></track>
        <type>lightning</type>
        <language></language>
        <abstract>Civic Tech in Deutschland, 
Intermodales &#214;PNV/Rad/Fuss Routing,
Hierarchische Geometrien f&#252;r OSM Daten und
FOSSGIS in der Hochschule</abstract>
        <description></description>
        <persons>
          <person id="397">Arndt Brenschede</person>
          <person id="51">Arnulf Christl</person>
          <person id="480">Mila Frerichs</person>
          <person id="463">Robert Buchholz</person>
        </persons>
        <links>
          <link href="http://render.buch703.de">Beispiel-Karte, gerendert mit dem COORDS-Backend</link>
          <link href="http://rbuch703.github.io/coords">COORDS Projektseite auf Github</link>
        </links>
      </event>
    </room>
    <room name="S10">
      <event id="818" guid="none">
        <date>2015-03-11T15:30:00+01:00</date>
        <start>15:30</start>
        <duration>00:30</duration>
        <room>S10</room>
        <slug></slug>
        <title>Neues von QGIS 2.8</title>
        <subtitle></subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Im Vortrag werden die wichtigsten neuen Features von QGIS 2.6 und der kommenden Version 2.8 vorgestellt. Es wird ein Blick auf die Entwicklung in Richtung QGIS 3 geworfen.</abstract>
        <description>Seit der FOSSGIS2014 in Berlin hat sich QGIS, dank der Investitionen der QGIS Anwender und der Spenden vieler Sponsoren, erheblich weiter entwickelt. Im Vortrag werden die wichtigsten neuen Features von QGIS 2.6 und der kommenden Version 2.8 vorgestellt. Ausserdem wird ein Blick auf die k&#252;nftige Entwicklung in Richtung QGIS 3 geworfen.</description>
        <persons>
          <person id="13">Horst D&#252;ster</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="833" guid="none">
        <date>2015-03-11T16:00:00+01:00</date>
        <start>16:00</start>
        <duration>00:30</duration>
        <room>S10</room>
        <slug></slug>
        <title>QGIS Plugins</title>
        <subtitle>Must-Haves, Fachl&#246;sungen und Geheimtipps</subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract>Eine grosse St&#228;rke von QGIS ist die einfache, aber umfassende Erweiterbarkeit mittels Python Plugins. In kompakter Form wird eine Selektion aus der grossen Menge an &#246;ffentlich verf&#252;gbaren Plugins aus verschiedensten Bereichen vorgestellt.</abstract>
        <description>Eine grosse St&#228;rke von QGIS ist die einfache, aber umfassende Erweiterbarkeit mittels Python Plugins. In kompakter Form wird eine Selektion aus der grossen Menge an &#246;ffentlich verf&#252;gbaren Plugins aus verschiedensten Bereichen vorgestellt.
Die Auswahl geht vom bestens bekannten Open Layers Plugin und weiteren "Must-Haves" &#252;ber wenig bekannte Core-Plugins wie dem Offline Editing Plugin bis zu Insidertipps wie dem Remote Debugging Plugin. Neben n&#252;tzlichen Helfern werden auch umfangreiche Fachl&#246;sungen kurz vorgestellt. Es werden Anwendungsbereiche von der Datenerfassung bis zur Plugin-Entwicklung abgedeckt, aber auch Tipps gegeben, wie man selbst ein passendes Plugin findet und evaluiert.</description>
        <persons>
          <person id="99">Pirmin Kalberer</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="846" guid="none">
        <date>2015-03-11T16:30:00+01:00</date>
        <start>16:30</start>
        <duration>00:30</duration>
        <room>S10</room>
        <slug></slug>
        <title>Neues vom QGIS&#160;Print Composer und Atlas-Seriendruck</title>
        <subtitle></subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Der Vortrag fasst die in den letzten QGIS-Versionen eingef&#252;hrten Verbesserungen im Print Composer und im Atlas-Seriendruck zusammen. 
Die meisten bestehenden Elemente im QGIS print composer haben Detailverbesserungen erhalten. Ausserdem wurde der Umgang mit mehrseitigen Layouts verbessert. Viele Eigenschaften von Elementen im Kartenlayout k&#246;nnen neu aufgrund von Datenspalten und Berechnungen definiert werden.
Pl&#228;ne f&#252;r die Entwicklung einer Reporting-Engine in einer zuk&#252;nftigen QGIS-Version werden vorgestellt.</abstract>
        <description>Die meisten bestehenden Elemente im QGIS print composer haben Detailverbesserungen erhalten. Ausserdem wurde der Umgang mit mehrseitigen Layouts verbessert. So k&#246;nnen Tabellen und Rich-Text Inhalte (HTML-Frame) besser &#252;ber mehrere Seiten fliessen. Viele Eigenschaften von Elementen im Kartenlayout (z.b. Dateipfade, Position, Gr&#246;sse, HTML-Inhalte) k&#246;nnen neu aufgrund von Datenspalten und Berechnungen (QGIS&#160;Expressions) definiert werden. Kartengitter k&#246;nnen nun in anderen Koordinatensystem definiert werden und mehrere Kartengitter k&#246;nnen &#252;bereinander gelegt werden (z.b. UTM/Meter und Grad/Minuten/Sekunden im WGS84 System). Fotos/Grafiken haben verschiedene Skalierungsmodi und Ankerpunkte erhalten - v.a. n&#252;tzlich wenn diese in Seriendrucken verwendet werden. Ausserdem k&#246;nnen Grafiken direkt aus dem Web eingebunden werden.

Der Atlas-Seriendruck hat verschiedene Verbesserungen erhalten: Geometrien welche im Zusammenhang mit dem jeweiligen Atlas-Feature stehen k&#246;nnen unterschiedlich symbolisiert werden. Es bestehen verbesserte Filteroptionen f&#252;r die Atlas-Feature-Liste, die Kartenansicht und Tabellen - ebenfalls im Zusammenhang mit dem jeweiligen Atlas-Feature. Seriendrucke k&#246;nnen auch unterschiedliche Seitenformate aufweisen und die Masst&#228;be der Kartenansichten k&#246;nnen auf optimale runde Massstabszahlen festgelegt werden.

Ein Ausblick erl&#228;utert die Pl&#228;ne f&#252;r die Einf&#252;hrung einer neuen Reporting Engine in den n&#228;chsten QGIS&#160;Versionen.</description>
        <persons>
          <person id="79">Andreas Neumann</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="895" guid="none">
        <date>2015-03-11T17:00:00+01:00</date>
        <start>17:00</start>
        <duration>00:30</duration>
        <room>S10</room>
        <slug></slug>
        <title> QField for QGIS</title>
        <subtitle>Eine native Benutzerschnittstelle f&#252;r mobile touch Ger&#228;te</subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract>QField ist die native Benutzerschnittstelle f&#252;r mobile touch Ger&#228;te und bietet eine vollwertige mobile GIS Daten Verwaltungsinfrastruktur. Das Synchronisationtool erm&#246;glicht einen nahtlose Datenaustausch zwischen dem mobilen Ger&#228;t und der vorhandenen Infrastruktur. Die Erg&#228;nzung der QGIS Suite mit einer native touch User Interface bietet den Anwendern eine vollwertige mobile GIS Daten Verwaltungsinfrastruktur. Die Ubiquit&#228;t von mobilen Ger&#228;ten aller Gr&#246;ssen ist in den letzten Jahren enorm gestiegen, auf dem stetig wachsenden Markt, kommen folglich immer mehr mobile Ger&#228;te in der Arbeitswelt zum Einsatz.</abstract>
        <description>Die Ubiquit&#228;t von mobilen Ger&#228;ten aller Gr&#246;ssen ist in den letzten Jahren enorm gestiegen. Mit weltweit mehr als 2 Milliarden verkauften Mobile Ger&#228;ten bis 2014 [0] und einem stetig wachsenden Markt kommen folglich auch immer mehr solcher Ger&#228;te in der Arbeitswelt zum Einsatz.

Intuitive Bedienung, erh&#246;te Handlichkeit, integriertes GPS und (relativ) geringe Anschaffungskosten machen heute den Kauf mobiler Ger&#228;te schmackhafter und einfacher den je.

Dank seiner Multi-plattform Natur (Win, Mac, Linux und Android) und seinen breiten Features-Set (Desktop, Server, Web-Client), ist QGIS eine der verbreitesten Open-Source GIS Softwaren und wird bereits von vielen Institutionen benutzt. Die Erg&#228;nzung der QGIS Suite mit einer native touch User Interface bietet den Anwendern eine vollwertige mobile GIS Daten Verwaltungsinfrastruktur.

Durch die Erfahrungen bei der Entwicklung von QGIS f&#252;r Android haben wir bei OPENGIS.ch herausgefunden was f&#252;r eine mobile Anwendung notwendig ist und funktioniert. Vor allem haben wir Erkenntisse dar&#252;ber gewonnen was absolut zu vermeiden ist: Komplexit&#228;t, kleine UI Elemente und Projektdefinitionsarbeit auf mobilen Ger&#228;ten.

Unser Motto bei der Entwicklung unserer neuen UI ist: &#8220;Less is more&#8221;. Dank vordefinierter Modi (Datenerhebung, Datenpr&#252;fung, Vermessungen, etc.) und klaren Bedienungselementen k&#246;nnen sich somit die Anwender in jeder Situation auf ihre Aufgaben konzentrieren.

Um den Arbeitsablauf noch weiter zu vereinfachen haben wir ein neues offline Synchronisationtool entwickelt. Dieses erm&#246;glicht einen nahtlose Datenaustausch zwischen dem mobilen Ger&#228;t und der vorhandenen Infrastruktur.</description>
        <persons>
          <person id="274">Marco Bernasocchi</person>
        </persons>
        <links>
          <link href="http://qfield.opengis.ch">[0]</link>
        </links>
      </event>
      <event id="909" guid="none">
        <date>2015-03-11T17:30:00+01:00</date>
        <start>17:30</start>
        <duration>01:00</duration>
        <room>S10</room>
        <slug></slug>
        <title>xPlanBox Anwendertreffen</title>
        <subtitle></subtitle>
        <track></track>
        <type></type>
        <language></language>
        <abstract>Mit der xPlanBox k&#246;nnen Planwerke der kommunalen Bauleitplanung einfach bereitgestellt werden.</abstract>
        <description></description>
        <persons>
        </persons>
        <links>
          <link href="http://www.lat-lon.de">xPlanBox</link>
        </links>
      </event>
    </room>
    <room name="S2">
      <event id="860" guid="none">
        <date>2015-03-11T15:30:00+01:00</date>
        <start>15:30</start>
        <duration>00:30</duration>
        <room>S2</room>
        <slug></slug>
        <title>Herausforderungen bei der Umsetzung der INSPIRE-Richtlinie</title>
        <subtitle></subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Von Datenspezifikationen, komplexen Feature-Modellen, Open Source Softwareprodukten f&#252;r INSPIRE und Darstellungs- und Dounloaddiensten.</abstract>
        <description>Seit 2012 stehen die ersten INSPIRE-Downloaddienste bereit. Konforme, aber nicht interoperable Dienste stellen hierbei INSPIRE-relevante Daten in einem vom Datenanbieter definierten Datenmodell bereit. Meist werden hierf&#252;r einfach strukturierte Feature-Modelle eingesetzt. Das GML-Schema eines einfachen Feature-Modells (GML SF-0) kann automatisiert aus der Struktur der verwendeten Datenquelle (z. B. Datenbanktabelle) abgeleitet werden. F&#252;r jede durch den WFS-Server unterst&#252;tzte GML-Version (2.1, 3.1, 3.2) kann ein korrespondierendes GML-Schema erzeugt werden.

Bei den INSPIRE-Datenmodellen handelt es sich komplexe Feature-Modelle (GML-Anwendungsschemata). Gelegentlich wird das Problem bei der Bereitstellung von Daten gem&#228;&#223; INSPIRE-Datenspezifikationen auf das Thema Datenmodelltransformation reduziert. Eine weitere gro&#223;e Herausforderung ergibt sich jedoch bei der anschlie&#223;enden Bereitstellung der transformierten Daten &#252;ber Darstellungs- und Downloaddienste.

Daher werden im Vortrag folgende Fragestellungen erl&#228;utert und diskutiert:
&#8226; Wie unterscheiden sich einfache und komplexe Feature-Modelle?
&#8226; Welche L&#246;sungsans&#228;tze gibt es bei der Bereitstellung von komplexen Feature-Modellen?
&#8226; Mit welchen OpenSource-Softwareprodukten ist die Bereitstellung von INSPIRE-konformen Daten m&#246;glich?

Weiterhin wird am Beispiel QGIS auf vorhandene Einschr&#228;nkungen bei der Verwendung von Geodaten auf Grundlage von GML-Anwendungsschemata eingegangen. </description>
        <persons>
          <person id="354">J&#252;rgen Weichand</person>
        </persons>
        <links>
          <link href="http://www.weichand.de">geoinformatik blog</link>
          <link href="http://www.weichand.de/download/fossgis_2015_INSPIRE-Herausforderungen-Weichand.pdf">Tagungsbandbeitrag (PDF)</link>
          <link href="http://www.weichand.de/download/fossgis_2015_INSPIRE-Herausforderungen-Weichand_Vortrag.pdf">Vortragsfolien (PDF)</link>
          <link href="https://www.youtube.com/watch?v=kHJfr5jfELg">Vortrag (YouTube)</link>
        </links>
      </event>
      <event id="835" guid="none">
        <date>2015-03-11T16:00:00+01:00</date>
        <start>16:00</start>
        <duration>00:30</duration>
        <room>S2</room>
        <slug></slug>
        <title>GeoPortal.rlp</title>
        <subtitle>Ein Erfolgsmodell f&#252;r den Einsatz von FOSS in der &#246;ffentlichen Verwaltung</subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Dieser Vortrag illustriert anhand der Entstehungsgeschichte des rheinland-pf&#228;lzischen Geoportals, das mittlerweile auch im Saarland und in Hessen eingesetzt wird, welches immense Potential im Einsatz von FOSS-Software in der &#246;ffentlichen Verwaltung steckt. Der Vortrag diskutiert neben unerwarteten positiven Nebenwirkungen wie der verst&#228;rkten Zusammenarbeit der Verwaltungen auch Risiken und Probleme, die in der 9-j&#228;hrigen Geschichte des Projekts zu bew&#228;ltigen waren.</abstract>
        <description>Das vollst&#228;ndig auf FOSS basierende GeoPortal.rlp wurde im Jahr 2006 konzipiert, um die GDI-RP aufzubauen. Rheinland-Pfalz hat sich damals f&#252;r den Einsatz lizenzkostenfreier Software entschieden, um auch anderen L&#228;ndern bzw. Organisationen die M&#246;glichkeit zu geben an dem Projekt mitzuwirken. Zum Zeitpunkt der Freischaltung des Portals im Jahr 2007 war die rheinland-pf&#228;lzische L&#246;sung europaweit das einzige System seiner Art. Es basiert auf einem eigenst&#228;ndig entwickeltem Architekturkonzept (OWS-Service-Registry) und setzte zum damaligen Zeitpunkt auch weltweit Ma&#223;st&#228;be. 
Im Jahr 2009 wurde das System vom Saarland &#252;bernommen und es kam zu einer engen Kooperation der beiden Bundesl&#228;nder, in deren Rahmen man sich die Weiterentwicklungskosten aufteilen konnte. 
Zur Umsetzung der EU-INSPIRE-Richtlinie wurden in der zugrundeliegenden Software Mapbender viele Funktionen implementiert, die den dezentralen Datenanbietern in Rheinland-Pfalz und im Saarland die Erf&#252;llung der europ&#228;ischen Anforderungen stark erleichtern. In Folge dessen haben diese beiden Bundesl&#228;nder bez&#252;glich der Datenbereitstellung derzeit europaweit eine Spitzenposition inne.
Der Erfolg des Systems hat dazu gef&#252;hrt, dass auch Hessen sich im Jahr 2013 dazu entschieden hat sein aktuell noch auf propriet&#228;rer Software basierendes Geoportal durch die FOSS-L&#246;sung aus Rheinland-Pfalz zu ersetzen. Im Januar 2015 wird der Prototyp des neuen Geoportals Hessen freigeschaltet.
Anhand der Entwicklung Projektes in den letzten 9 Jahren kann gezeigt werden welches immense Potential im Einsatz von FOSS steckt. Es wird neben Darstellung der Vorteile aber auch auf die Risiken und die Probleme eingegangen, die w&#228;hrend dieser Zeit auftauchten und zu bew&#228;ltigen waren.
</description>
        <persons>
          <person id="257">Armin Retterath</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="773" guid="none">
        <date>2015-03-11T16:30:00+01:00</date>
        <start>16:30</start>
        <duration>00:30</duration>
        <room>S2</room>
        <slug></slug>
        <title>Geonetzwerk metropoleRuhr</title>
        <subtitle>Die Geoinformationsplattform f&#252;r das Ruhrgebiet</subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Das Geonetzwerk metropoleRuhr ist eine Kooperation der Kreise und kreisfreien St&#228;dte im Ruhrgebiet mit dem Regionalverband Ruhr. Ziele sind GDI-Aufbau, Pr&#228;sentation von Geodaten im eigenen Geoportal, Metadatenpflege, gegenseitige technische Unterst&#252;tzung und gemeinsame Umsetzung der INSPIRE-Richtlinie. Der Vortrag fokussiert den ersten Schritt der Bereitstellung eines gemeinsamen Geoportals.</abstract>
        <description>Das Geonetzwerk metropoleRuhr ist eine Kooperation der Kreise und kreisfreien St&#228;dte im Ruhrgebiet mit dem Regionalverband Ruhr. Ziele sind:
-	Aufbau einer Geodateninfrastruktur, Betrieb eines eigenen Geoportals als Anlaufstelle f&#252;r Geodaten-Suchende (Firmen, Investoren, B&#252;rger, Vereine) und Datendrehscheibe 
-	Der Wissenstransfer und fachliche Austausch auf dem Gebiet der Geoinformatik
-	Gegenseitige technische Unterst&#252;tzung nach Bedarf, Bereitstellung zentraler Komponenten durch den RVR.
-	Erarbeitung gemeinsamer Datenmodelle und Darstellungsvorschriften
-	Unterst&#252;tzung bei der Umsetzung der INSPIRE-Richtlinie.
Kooperationsmitglieder sind zun&#228;chst die Mitglieder des RVR. Kreisangeh&#246;rige Kommunen k&#246;nnen auf Antrag aufgenommen werden. Andere Institutionen k&#246;nnen ohne Stimmrechte einbezogen werden. Das Land NRW begleitet das Vorhaben.
Der Vortrag fokussiert den ersten Schritt der Bereitstellung eines gemeinsamen Geoportals. Hierbei wird die Pflege von Metadaten bis hin zum Geodatenupload und Bereitstellung von INSPIRE-konformen Darstellungs- und Downloaddiensten beleuchtet. &#220;ber das gemeinsame Geoportal des Geonetzwerk metropoleRuhr wird das auch technisch unbedarften Nutzern erm&#246;glicht. Als Software wird im Frontend zur Metadatenpflege, Geodatenupload und Dienstekonfiguration das CMS Drupal 7 benutzt. Als Dienste-Server wird GeoServer eingesetzt.</description>
        <persons>
          <person id="38">David Arndt</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="861" guid="none">
        <date>2015-03-11T17:00:00+01:00</date>
        <start>17:00</start>
        <duration>00:30</duration>
        <room>S2</room>
        <slug></slug>
        <title>Spatial Index von Solr </title>
        <subtitle>Erfahrungen und Einblicke im Umgang mit Solr Spatial Index am Beispiel des Geoportal.de</subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Seit der Version 4 bietet Solr Funktionen eines umfangreichen Spatial Indexes an. Am Beispiel des Geoportal.de sollen Erfahrungen und Einblicke in die Verwendung des Spatial Index mit Solr gegeben werden. Die GDI-DE stellt Beschreibungen und Zugangsdaten
zu Geodaten von Bund, L&#228;ndern und Kommunen bereit, welche &#252;ber das Geoportal.de recherchiert werden k&#246;nnen.
&#220;ber eine Volltextsuche k&#246;nnen derzeit ca. 130000 Datens&#228;tze gefunden werden. F&#252;r einen performanten Zugriff auf die Datens&#228;tze wird die Open Source Software Solr eingesetzt. Derzeit erfolgt die Suche ausschlie&#223;lich &#252;ber die themenbezogenen Inhalte der Metadaten.</abstract>
        <description>Die GDI-DE stellt Beschreibungen und Zugangsdaten zu Geodaten von Bund, L&#228;ndern und Kommunen bereit, welche &#252;ber das Geoportal.de recherchiert werden k&#246;nnen. &#220;ber eine Volltextsuche k&#246;nnen derzeit ca. 130000 Datens&#228;tze gefunden werden. F&#252;r einen performanten Zugriff auf die Datens&#228;tze wird die Open Source Software Solr eingesetzt. Derzeit erfolgt die Suche ausschlie&#223;lich &#252;ber die themenbezogenen Inhalte der Metadaten. Hierf&#252;r finden u.a. die Attribute UUID, Titel, Abstract, Keywords und Kontaktdaten aus den Metadaten Ber&#252;cksichtigung. Auf Basis einer individuellen Konfiguration erstellt Solr f&#252;r jede Suchanfrage ein sogenanntes Scoring. Dieses ergibt sich aus der Anzahl gefundener Suchbegriffe und deren Position im Datensatz und bestimmt die Platzierung in der Ergebnisausgabe. Seit der Version 4 bietet Solr die M&#246;glichkeit einer erweiterten geobasierte Suche an. Diese beinhaltet GIS-Funktionalit&#228;ten wie Distance, Contains, Intersects und Within zum Verarbeiten von Punkt-, Linien- und Fl&#228;chengeometrien. Neben der Verwendung f&#252;r das Scoring bietet es sich an die Suchergebnisse &#252;ber diese Operationen gezielt vom Nutzer filtern und sortieren zu lassen. Um die GIS-Funktionen nutzen zu k&#246;nnen werden die in den Metadaten angegebenen Bounding Boxen indexiert. Aktuell befinden sich diese Funktionen in der Testphase. Der Vortrag soll Einblicke und Erfahrungen im Umgang mit einem r&#228;umlichen Index auf Basis von Solr vermitteln.</description>
        <persons>
          <person id="473">Balschmiter</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="789" guid="none">
        <date>2015-03-11T17:30:00+01:00</date>
        <start>17:30</start>
        <duration>01:00</duration>
        <room>S2</room>
        <slug></slug>
        <title>Mapbender Anwendertreffen</title>
        <subtitle></subtitle>
        <track></track>
        <type>user_meeting</type>
        <language>de</language>
        <abstract>Zu diesem Treffen sind Anwender und Entwickler der WebGIS Client Suite Mapbender eingeladen. Der aktuelle Stand von Mapbender3 wird vorgestellt. Zuk&#252;nftige Entwicklungen werden diskutiert. Die Anwender k&#246;nnen sich austauschen. Alle Interessierten sind herzlich eingeladen.
</abstract>
        <description>Zu diesem Treffen sind Anwender und Entwickler der WebGIS Client Suite Mapbender eingeladen.

Auf dem Treffen wird der aktuelle Stand von Mapbender3 vorgestellt. Au&#223;erdem sollen zuk&#252;nftige Entwicklungen diskutiert werden und ein Austausch der Anwender soll stattfinden.

Alle Interessierten sind herzlich eingeladen.</description>
        <persons>
          <person id="65">Astrid Emde</person>
          <person id="70">Olaf Knopp</person>
        </persons>
        <links>
          <link href="http://mapbender3.org">http://mapbender3.org</link>
        </links>
      </event>
    </room>
    <room name="S1">
      <event id="904" guid="none">
        <date>2015-03-11T10:30:00+01:00</date>
        <start>10:30</start>
        <duration>01:30</duration>
        <room>S1</room>
        <slug></slug>
        <title>Was ist Open Source, wie funktioniert das?</title>
        <subtitle>Die Organisation der Open Geo- und GIS-Welt. Worauf man achten sollte.</subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract>Open Source hat viele Facetten - und es ranken sich inzwischen ebenso viele Mythen darum. Was davon richtig ist und was nicht stellen wir in einer kurzen Einf&#252;hrung zusammen. Der Vortrag richtet sich an alle, die mit Open Source bisher noch wenig Kontakt hatten und die Grundlagen verstehen m&#246;chten.</abstract>
        <description>Open Source ist auf der einen Seite ein Entwicklungsmodell und auf der anderen ein Lizenzmodell. Zusammen bilden sie eine Kultur offener Entwicklungsgmemeinschaften, die h&#246;chst effektiv arbeiten. Diese Kultur ist um ein Vielfaches effektiver, als propriet&#228;re Modelle es je sein k&#246;nnen. Unter anderem sieht man das an einfachen Beispielen: Das Betriebssystem des Herstellers Apple basiert vollst&#228;ndig auf dem Open Source Unix FreeBSD. Es gibt halt einfach nichts besseres, und es selbst herzustellen w&#228;re unendlich teuer. Sogar der hyper-propriet&#228;re Hersteller Apple hat das eingesehen. 

Der Vortrag stellt die Geschichte der Entwicklung von Open Source vor und geht auf wichtige Grundlagen ein. 

Ziel des FOSSGIS e.V. und der OSGeo ist die F&#246;rderung und Verbreitung freier Geographischer Informationssysteme (GIS) im Sinne Freier Software und Freier Geodaten. Dazu z&#228;hlen auch Erstinformation und Klarstellung von typischen Fehlinformationen &#252;ber Open Source und Freie Software, die sich &#252;ber die Jahre festgesetzt haben. </description>
        <persons>
          <person id="51">Arnulf Christl</person>
          <person id="65">Astrid Emde</person>
          <person id="142">Dominik Helle</person>
          <person id="23">Till Adams</person>
        </persons>
        <links>
          <link href="http://www.fossgis.de/wiki/Konferenz_2014/FLOSS_Einf&#252;hrung">Inhalte der Einf&#252;hrung in Open Source</link>
          <link href="https://github.com/GeoDodo/fossgis-oss">Pr&#228;sentation</link>
        </links>
      </event>
      <event id="859" guid="none">
        <date>2015-03-11T15:30:00+01:00</date>
        <start>15:30</start>
        <duration>00:30</duration>
        <room>S1</room>
        <slug></slug>
        <title>Welches M&#252;nster meinen sie?</title>
        <subtitle>Wie man Geocodern beibringt Orte mit gleichen Namen richtig zu sortieren</subtitle>
        <track>Vorträge (OSM)</track>
        <type>lecture</type>
        <language></language>
        <abstract>Wie sortiert man Orte nach Wichtigkeit, wenn sie den gleichen Namen haben? Wir schauen uns Daten zu Suchverhalten, Gr&#246;&#223;e, Bev&#246;lkerungsdichte, Tagging in OpenStreetMap und Verlinkung in Wikipedia/Wikidata anhand des Nominatim Geocoders an.</abstract>
        <description>Der Nominatim Geocoder nutzt OpenStreetMap, min&#252;tlich aktualisiert. Die Suchergebnisse werden nach Relevanz sortiert. Einige Faktoren, wie dass L&#228;ndernamen wichtiger sind als Strassennamen sind jedem klar. Auf Mailinglisten kommt aber hin und wieder die Frage auf warum genau ein Ort wichtiger eingesch&#228;tzt wird als ein anderer.

Frankfurt gibt es zweimal, beide sind grosse St&#228;dte. M&#252;nster gibt es mehrfach (http://de.wikipedia.org/wiki/M%C3%BCnster). Sogar Paris, Berlin und Frankreich sobald man die ganze Welt betrachtet.

Nominatim nutzt u.a. einen vorberechneten Score (numerischer Wert), der auf den Verlinkungen innerhalb Wikipedia basiert. Die erste Version sogar auf Seitenabrufen. Das hat Vor- und Nachteile (und Bugs). Leider sind selbst f&#252;r Nutzer (Administratoren) von Nominatim die Algorithmen dahinter nicht transparent genug. Viele laden einfach eine selten aktualisierte Bin&#228;rdatei von http://www.nominatim.org/.

Ich habe mich damit intensiver besch&#228;ftigt und plane bis zur FOSSGIS die Scripte neu schreiben und neu dokumentieren. Selbst wenn nicht wird der Vortrag ein guter &#220;berlick werden. Ich arbeite bei http://data.opencagedata.com/index.html#about-section und wir bieten einen Geocoder u.a. auf Basis von Nominatim an http://geocoder.opencagedata.com/. Ich arbeite seit 2006 Jahren mit geocodern mit underschiedlichen kommerziellen und offenen Daten.

Privat wohne ich in M&#252;nster und freue mich nicht nach Karlsruhe (state of the map) oder Berlin (FOSSGIS 2014, wherecamp) reisen zu m&#252;ssen.</description>
        <persons>
          <person id="472">Marc Tobias Metten</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="788" guid="none">
        <date>2015-03-11T16:00:00+01:00</date>
        <start>16:00</start>
        <duration>00:30</duration>
        <room>S1</room>
        <slug></slug>
        <title>Offene Geodaten-Lage von Orten im Vergleich</title>
        <subtitle></subtitle>
        <track>Vorträge (OSM)</track>
        <type>lecture</type>
        <language></language>
        <abstract>Offene Geodaten bez&#252;glich der Lage von Orten (GeoNames Geographical Database, OSM, Wikipedia) werden vergleichend miteinander und in Bezug zu offenen amtlichen Geodaten untersucht.</abstract>
        <description>Die Lage von Orten (wie St&#228;dte, Gemeinden und Siedlungen) ist eine wichtige Grundlage f&#252;r die Erstellung von Karten und f&#252;r diverse Geoanwendungen. Solche Daten stehen im zunehmenden Ma&#223;e zur Verf&#252;gung. Neben der "GeoNames Geographical Database" mit rund 2,8 Millionen Orten stellen u.a. OpenStreetMap und Wikipedia weltweite Ortskoordinaten zur Verf&#252;gung.

Folgende Aspekte haben insbesondere Bedeutung:

* die Nutzbarkeit der Daten: Einfachheit des Zugriffs, bereitgestellte Attribute und Zuordnungsm&#246;glichkeiten zu einem gegebenen Ort; letztgenanntes ist Voraussetzung f&#252;r Mashups,
* die Vollst&#228;ndigkeit der Daten und
* die Qualit&#228;t der Koordinaten.

F&#252;r den erstgenannten Aspekt wurden die genannten Datenquellen zun&#228;chst hinsichtlich eines Anforderungskataloges bewertet und verglichen. F&#252;r alle drei Aspekte wurden experimentelle Vergleiche f&#252;r vier Ortsgruppen durchgef&#252;hrt: (a) Gemeinden in Deutschland, (b) Populated Places in Neuseeland, (c) Localidades in Argentinien und (d) Townships in China. F&#252;r die drei ersten Gruppen wurden zudem offene amtliche Geodaten herangezogen. Im Rahmen studentischer Aufgaben sind (f&#252;r Teilaufgaben) Vergleichs- und Visualisierungswerkzeuge auf Basis der Open-Source-Bibliothek GeoTools in Java entwickelt worden. 
</description>
        <persons>
          <person id="454">Thomas Brinkhoff</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="803" guid="none">
        <date>2015-03-11T16:30:00+01:00</date>
        <start>16:30</start>
        <duration>00:30</duration>
        <room>S1</room>
        <slug></slug>
        <title>Drohnen-Mapping </title>
        <subtitle>Wie kann man mit Bildern einer Flugdrohne  zu OSM beisteuern? </subtitle>
        <track>Vorträge (OSM)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Technische und legale Aspekte werden diskutiert, sowie die Frage der Genauigkeit und Verlaesslichkeit solcher erhobenen Bild-Daten. </abstract>
        <description>'Armchairmapping' via bing  kann durch eigene Bilder angereichert und verbessert werden. Nicht immer ist jedoch der Weg zum Erfolg so einfach wie gedacht.
Geometrische Verzeichnung, Referenzierung zu Fixpunkten, Linsen-Parameter stellen einen grossen Aufwand dar, der kompensiert werden muss. Nichtsdestotrotz bietet diese Technik eine faszinierende Einsicht in die Welt von Oben, der sich kaum einer entziehen kann. </description>
        <persons>
          <person id="442">Alexander Lehner</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="793" guid="none">
        <date>2015-03-11T17:00:00+01:00</date>
        <start>17:00</start>
        <duration>00:30</duration>
        <room>S1</room>
        <slug></slug>
        <title>Ein GeoWiki auf OSM-Basis</title>
        <subtitle></subtitle>
        <track>Vorträge (OSM)</track>
        <type>lecture</type>
        <language></language>
        <abstract>Wikis bieten editierbare Informationen in Text und Bild, OSM geographische Objekte u.a. in Kartenform. Unser GeoWiki leistet eine enge Integration beider Konzepte, indem Textstellen direkt und interaktiv auf Geoobjekte verweisen und umgekehrt. Die referenzierten und dargestellten Geoobjekte m&#252;ssen dabei nicht zwingend in der OSM-Datenbank vorliegen, sondern k&#246;nnen auch vom Nutzer im Wiki direkt angelegt werden. Zum einen senkt dies die Hemmschwelle etwas falsch zu machen, zum anderen erlaubt es die Nutzung des GeoWikis f&#252;r private Daten.</abstract>
        <description>Die OpenStreetMap-Datenbank basiert auf kollaborativ erfassten Geoobjekten (Nodes, Ways, Relations), die mit zus&#228;tzlichen Metadaten in Form von Key-Value-Paaren angereichert werden k&#246;nnen. Die meisten Nutzer kennen OSM in Form der aus diesen Daten gerendereten Kartendarstellungen.
Ein klassisches Wiki bietet einfach editierbare Texte, in die Bilder und vielleicht auch Karten eingebunden werden k&#246;nnen.

Unser GeoWiki verbindet diese beiden Konzepte. Beschreibungen im Text, die sich auf beliebige Geoobjekte (St&#228;dte, Pl&#228;tze, H&#228;user, &#8230;) beziehen, verweisen direkt und interaktiv auf eine eingebundene OSM-Karte. Durch Anklicken der entsprechenden Verweise im Text wird das zugeh&#246;rige Geoobjekt auf der Karte hervorgehoben und bei Bedarf der passende Kartenausschnitt gescrollt und gezoomt. Umgekehrt verweisen auf der Karte dargestellte Geoobjekte auf die Wikiseiten, auf denen sie referenziert werden.
Diese enge Integration von Text und Karte bietet die M&#246;glichkeit, einzelne Geoobjekte im Text ausf&#252;hrlicher und im Kontext eines gr&#246;&#223;eren Textes zu beschreiben, was in Form von Tags nicht m&#246;glich w&#228;re.

Die referenzierten und dargestellten Geoobjekte m&#252;ssen dabei nicht zwingend in der OSM-Datenbank vorliegen, sondern k&#246;nnen auch vom Nutzer im Wiki direkt angelegt werden. Zum einen senkt dies die Hemmschwelle etwas falsch zu machen, zum anderen erlaubt es die Nutzung des GeoWikis f&#252;r private Daten.
</description>
        <persons>
          <person id="243">Klaus Stein</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="885" guid="none">
        <date>2015-03-11T17:30:00+01:00</date>
        <start>17:30</start>
        <duration>01:00</duration>
        <room>S1</room>
        <slug></slug>
        <title>ows.js Entwickler-Treffen</title>
        <subtitle>Entwicklung der JS-Bibliothek f&#252;r OWS-Clients.</subtitle>
        <track></track>
        <type>developer_meeting</type>
        <language>de</language>
        <abstract>ows.js ist ein neues OSGeo-Projekt, mit dem Ziel, eine Client-Bibliothek f&#252;r die OGC Web Services in JavaScript zu implementieren.

Auf dem Entwickler-Treffen werden wir &#252;ber die Anforderungen, Erfahrungen, Architektur und Entwicklung sprechen.</abstract>
        <description>GeoTools f&#252;r Java, OWSLib f&#252;r Python - f&#252;r viele Programmiersprachen gibt es schon sehr gute Bibliotheken, um die Clients f&#252;r die OGC Web Services zu entwickeln.

ows.js ist ein neues OSGeo-Projekt, mit dem Ziel, eine JavaScript-Bibliothek f&#252;r die OWS-Clients (Clients f&#252;r die verschiedene OGC Web Services) zu implementieren.

Auf dem Entwickler-Treffen, das auch f&#252;r die Interessenten und hoffentlich zuk&#252;nftige Anwender offen ist, haben wir die Gelegenheit uns &#252;ber folgende Fragen auszutauschen:

Was wollen wir eigentlich von ows.js? Was sind die Anforderungen?
Was sind die Ziel-Plattformen? Nur Web? Auch Node.js?
Was sind die Priorit&#228;ten? Welche Services/Spezifikationen werden zuerst ben&#246;tigt?
Welche Erfahrungen haben wir bereits in dem Umfeld?
Wie k&#246;nnte die Architektur aussehen?
Wie organisieren wir den Entwicklungsprozess?
Welche Ressourcen haben wir f&#252;r die Entwicklung?
Die Liste der Themen ist offen. Das Wichtigste ist allerdings dass wir uns kennenlernen.</description>
        <persons>
          <person id="464">Alexey Valikov</person>
        </persons>
        <links>
          <link href="https://github.com/OSGeo/ows.js">ows.js auf GitHub</link>
          <link href="http://lists.osgeo.org/pipermail/owsjs/">ows.js Mailing List</link>
        </links>
      </event>
    </room>
    <room name="StudLab 1">
      <event id="832" guid="none">
        <date>2015-03-11T10:30:00+01:00</date>
        <start>10:30</start>
        <duration>01:30</duration>
        <room>StudLab 1</room>
        <slug></slug>
        <title>52&#176;North WPS Workshop</title>
        <subtitle></subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language></language>
        <abstract>Der Workshop gibt einen &#220;berblick &#252;ber die Funktionalit&#228;ten des 52&#176;North WPS und vermittelt anhand von praktischen &#220;bungen, wie man den WPS administriert, Prozesse erstellt, verf&#252;gbar macht und wie WPS Prozesse nutzbar sind.</abstract>
        <description>Der Workshop gibt einen &#220;berblick &#252;ber die Funktionalit&#228;ten des 52&#176;North WPS und vermittelt anhand von praktischen &#220;bungen, wie man den WPS administriert, Prozesse erstellt und verf&#252;gbar macht und wie WPS Prozesse genutzt werden.

Programm:
* Vorstellung des 52&#176;North WPS und Anwendungsbeispiele
* Nutzung der Administrationsoberfl&#228;che des WPS 
* Erstellen eines Java-Prozesses und Upload in die WPS Instanz
* Upload von Prozess-Ergebnissen in eine GeoServer Instanz
* Raumzeitliche Analyse mit der R Software und WPS4R

Die &#220;bungen werden mithilfe der OSGeo Live DVD bearbeitet.
Vorwissen: Grunds&#228;tzliche Kenntnisse von Java und R sind n&#252;tzlich, werden aber nicht zwingend vorausgesetzt.</description>
        <persons>
          <person id="391">Benjamin Pross</person>
        </persons>
        <links>
          <link href="http://52north.org/wps">Infos &#252;ber den 52&#176;North WPS</link>
          <link href="https://wiki.52north.org/bin/view/Geoprocessing">52&#176;North Geoprocessing Community Wiki</link>
        </links>
      </event>
      <event id="809" guid="none">
        <date>2015-03-11T15:30:00+01:00</date>
        <start>15:30</start>
        <duration>01:30</duration>
        <room>StudLab 1</room>
        <slug></slug>
        <title>Einf&#252;hrung in das Sensor Web</title>
        <subtitle></subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language></language>
        <abstract>Ziel dieses Workshops ist es Teilnehmern aus der &#246;ffentlichen Verwaltung und Forschung sowie Entwicklern aufzuzeigen, wie die Sensor Web-Technologie zur Bereitstellung bzw. zum Abruf von Messdaten genutzt werden kann. Hierzu wird eine kurze Einf&#252;hrung in die OGC Sensor Web Enablement-Architektur gegeben.</abstract>
        <description>In Fachgebieten wie der Hydrologie, der Umweltbeobachtung (z.B. Luftqualit&#228;t) und der Ozeanographie ist die Sensor Web-Technologie, insbesondere die OGC Sensor Web Enablement-Architektur, mittlerweile ein wichtiger Baustein um bestehende Geodateninfrastrukturen um Messdaten als zus&#228;tzliche Informationsquelle zu erweitern. Ebenso spielen diese Standards im Kontext von INSPIRE eine wichtige Rolle zur Bereitstellung von Messdaten.

Ziel dieses Workshops ist es Teilnehmern aus der &#246;ffentlichen Verwaltung und Forschung sowie Entwicklern aufzuzeigen, wie die Sensor Web-Technologie zur Bereitstellung bzw. zum Abruf von Messdaten genutzt werden kann. Hierzu wird eine kurze Einf&#252;hrung in die OGC Sensor Web Enablement-Architektur gegeben. Im Anschluss daran werden bestehende Open Source-Komponenten vorgestellt. Begleitend dazu werden zur Illustration Anwendungsbeispiele vorgestellt.

Um die in der ersten H&#228;lfte des Workshops theoretisch vorgestellten Grundlagen und Anwendungsbeispiele zu vertiefen, wird in der zweiten H&#228;lfte des Workshops eine praktische &#220;bung durchgef&#252;hrt. Hierbei k&#246;nnen die Teilnehmer unter Anleitung selbst mit der OGC SOS-Schnittstelle interagieren und neue Sensoren/Messdaten einf&#252;gen sowie diese Daten anschlie&#223;end mit einem SOS-Client visualisieren. Zus&#228;tzlich zur OSGeo Live-DVD werden wir in diesem Jahr einen Demo-Server im Web zur Umsetzung der praktischen Demo bereitstellen, um dadurch Risiken bei der Nutzung der OSGeo Live-DVD zu minimieren.</description>
        <persons>
          <person id="39">Simon Jirka</person>
        </persons>
        <links>
        </links>
      </event>
    </room>
    <room name="StudLab 2">
      <event id="774" guid="none">
        <date>2015-03-11T10:30:00+01:00</date>
        <start>10:30</start>
        <duration>01:30</duration>
        <room>StudLab 2</room>
        <slug></slug>
        <title>OSM-Daten in QGIS</title>
        <subtitle>Regelbasierte Darstellung und Geodatenanalyse mit QGIS</subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language>de</language>
        <abstract>OSM bietet nicht nur fertige Karten, sondern auch seine Rohdaten zum herunterladen an. Im Workshop lernen die Teilnehmer/innen OSM in QGIS zu importieren, regelbasiert als thematische Karten zu symbolisieren und mit Hilfe von QGIS zu analysieren.</abstract>
        <description>OSM bietet nicht nur fertige Karten, sondern auch seine Rohdaten zum herunterladen an. Im QGIS lassen sich diese Daten fu&#776;r eigene Projekte visualisieren und weiterverarbeiten. Im Workshop lernen die Teilnehmer/innen, wie Sie OSM-Rohdaten aus dem Netz fu&#776;r ausgewa&#776;hlte Bereiche oder ganze La&#776;nder beziehen, ins QGIS laden oder mit Hilfe von ogr2ogr und spatialiteosmmap in gisga&#776;ngige Geodatenformate (Shapefile, SpatiaLite, PostGis) konvertieren.
Die Symbolisierung der OSM-Daten im QGIS ist aufgrund der komplexen Attributierung (des taging) nicht einfach. QGIS verf&#252;gt mit der "regelbasierten Symbolsisierung" &#252;ber ein sehr m&#228;chtiges Werkzeug, um das komplexe OSM-Taging in eine gut lesbare thematische Kartengestaltung umzusetzen.
Die OSM-Daten enthalten in ihren tags umfangreiche verborgene Sachinformationen, die sich mit Hilf des Ausdruckseditors und der Geodatenverarbeitung-Funktionen von QGIS ans Tageslicht heben lassen. Im Workshop lernen die Teilnehmer/innen Vorgehensweisen zur Extraktion von Stromleitungsnetzen, Mountainbikestrecken und zur Erzeugung von Kerneldichte-Darstellungen spezifischer Inhalte kennen.
Der Kurs wendet sich an Leute, die mit der grundlegenden Bedienung von QGIS oder zumindestens von vergleichbaren GIS-Programmen vertraut sind.
Der Workshop sollte in einem Computerpool stattfinden, damit eine einheitliche Softwareumgebung zur Verf&#252;gung steht.</description>
        <persons>
          <person id="12">Claas Leiner</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="794" guid="none">
        <date>2015-03-11T15:30:00+01:00</date>
        <start>15:30</start>
        <duration>01:30</duration>
        <room>StudLab 2</room>
        <slug></slug>
        <title>PostGIS f&#252;r Einsteiger</title>
        <subtitle>Einf&#252;hrung in die Verwaltung von Geodaten in der PostgreSQL Datenbank mit PostGIS</subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language>de</language>
        <abstract>Dieser Workshop erm&#246;glicht Einsteigern den Zugang zu PostgreSQL/PostGIS und hilft bei den ersten Schritten im Umgang mit r&#228;umlichen Daten in der Datenbank. Datenarten, Datenmodell, Visualisierung, Datenimport, Schnittstellen und SQL werden behandelt.
</abstract>
        <description>Dieser Workshop soll Einsteigern den Zugang zu PostgreSQL/PostGIS erm&#246;glichen und bei den ersten Schritten im Umgang mit r&#228;umlichen Daten in der Datenbank helfen.

* Einf&#252;hrung PostgreSQL / PostGIS - Vorstellung der M&#246;glichkeiten (Vektordaten, Rasterdaten)
* Erkl&#228;rung des Datenmodells
* Visualisierung von Daten mit QGIS
* Datenimport &#252;ber QGIS DB Manager und shp2pgsql
* Aufzeigen der M&#246;glichkeiten anhand von einfachen SQLs
* Schnittstellen</description>
        <persons>
          <person id="65">Astrid Emde</person>
          <person id="31">Harald Schwenk</person>
        </persons>
        <links>
          <link href="http://download.geofabrik.de/europe/germany/nordrhein-westfalen/muenster-regbez-latest.shp.zip">OSM Daten Regierungsbezirk M&#252;nster</link>
          <link href="https://github.com/astroidex/presentations/tree/master/FOSSGIS2015/PostGIS_fuer_Einsteiger">PostGIS Pr&#228;sentation und SQLs</link>
        </links>
      </event>
    </room>
    <room name="StudLab 3">
      <event id="879" guid="none">
        <date>2015-03-11T10:30:00+01:00</date>
        <start>10:30</start>
        <duration>01:30</duration>
        <room>StudLab 3</room>
        <slug></slug>
        <title>Mapping mit d3</title>
        <subtitle></subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language>de</language>
        <abstract>Dieser Workshop richtet sich an erfahrenere Entwickler die im Browser generierte Karten benutzen wollen, ohne auf ein klassisches Mapping Framework zur&#252;ckzugreifen.</abstract>
        <description>Dieser Workshop richtet sich an erfahrenere Entwickler die im Browser generierte Karten benutzen wollen, ohne auf ein klassisches Mapping Framework zur&#252;ckzugreifen.
D3 ist ein Visualiserungstool welches h&#228;ufig von Zeitungen und f&#252;r Dashboards eingesetzt wird.
Aber d3 kann viel mehr als das. Durch die sehr ausgereifte Mapping Funktionalit&#228;t lassen sich einfache Karten erstellen, sowie auch deren Projektion einfach &#228;ndern. 
Durch den Einsatz von SVG mit d3 sind Karten auf fast allen Browsern darstellbar und einfach skalierbar. Dar&#252;ber hinaus kann alles manipuliert, als auch exportiert werden. 
Die beiden wichtigsten Web Mapping Frameworks Leaflet und OpenLayers benutzen beide SVG um Visualisierungen auf den Karten zu erm&#246;glichen. 
Durch die direkte Benutzung von SVG sowohl f&#252;r die Karte als auch f&#252;r die Visualisierung vereinfacht sich die Handhabung und die Kontrolle &#252;ber alle Elemente wird gewahrt.  
Mit d3 lassen sich einfache choroplet Karten sowie Karten mit weiteren Visualisierungen (zB bubbles Charts) schnell und Browser kompatibel umsetzen.

Die Kenntnis von Javascript wird vorausgesetzt. 

Gliederung
* Kurze Einf&#252;hrung in d3.js
* Benutzung von ogr2ogr
* Benutzung von topojson
* eine einfache choroplet karte
* Eine Karte mit bubbles
* Einsatz von Projektionen
* interaktivit&#228;t (Zoom und mouse Effekte)
* Limitierungen</description>
        <persons>
          <person id="480">Mila Frerichs</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="780" guid="none">
        <date>2015-03-11T15:30:00+01:00</date>
        <start>15:30</start>
        <duration>01:30</duration>
        <room>StudLab 3</room>
        <slug></slug>
        <title>OpenStreetMap-Daten pflegen und finden mit der Overpass API</title>
        <subtitle></subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language></language>
        <abstract>Faszination und Fluch von OpenStreetMap ist die Menge und Reichhaltigkeit der verf&#252;gbaren Daten. Mit der Overpass API ist es m&#246;glich, per einfacher HTTP-Abfrage &#252;ber das Web die Daten gezielt nach eigenen Kriterien wie Thema oder Ort zu filtern, auch alte Daten zu extrahieren und &#196;nderungen zu verfolgen.</abstract>
        <description>Faszination und Fluch von OpenStreetMap ist die Menge und Reichhaltigkeit der verf&#252;gbaren Daten. Mit der Overpass API ist es m&#246;glich, per einfacher HTTP-Abfrage &#252;ber das Web die Daten gezielt nach eigenen Kriterien wie Thema oder Ort zu filtern, auch alte Daten zu extrahieren und sogar &#196;nderungen fast live zu verfolgen.

Die Overpass API wird heute bereits f&#252;r eine Vielzahl von Anwendungen, z.B. zur Qualit&#228;tssicherung, f&#252;r in Echtzeit erzeugte Kartenoverlays, thematische Downloads oder auch zur Beschleunigung der Main API verwendet. Ihre Flexibilit&#228;t bezieht die Overpass API aus einer Abfragesprache, die einfach, aber speziell auf die Bed&#252;rfnisse von OpenStreetMap zugeschnitten ist.

In diesem Workshop wird in die Abfragesprache systematisch eingef&#252;hrt. Dazu diskutieren wir zun&#228;chst an zentralen Beispielen, auf welche Weise mit Nodes, Ways und Relationen typische Ph&#228;nomene der Realit&#228;t modelliert werden.

Als fortgeschrittenes Beispiel werden wir am Ende unsere Werkzeuge so konfigurieren, dass wir damit tagt&#228;glich alle eingehende &#196;nderungen in wenigen Minuten sichten k&#246;nnen, inwiefern sie zu einem spezifischen Qualit&#228;tsziel beitragen oder nicht. Die Werkzeuge stehen als Websites f&#252;r den Browser zur Verf&#252;gung. Daher kann mit dem eigenen Rechner gearbeitet werden.
</description>
        <persons>
          <person id="280">Roland Olbricht</person>
        </persons>
        <links>
        </links>
      </event>
    </room>
  </day>
  <day index="2" start="2" end="2" date="2015-03-12">
    <room name="Aula">
      <event id="903" guid="none">
        <date>2015-03-12T13:45:00+01:00</date>
        <start>13:45</start>
        <duration>00:45</duration>
        <room>Aula</room>
        <slug></slug>
        <title>FOSSGIS Zukunftswerkstatt</title>
        <subtitle>Menschen begeistern im FOSSGIS-Verein mitzuwirken </subtitle>
        <track></track>
        <type>podium</type>
        <language></language>
        <abstract>Wer steckt hinter dem FOSSGIS e.V.? Um diese Frage zu beantworten veranstaltet der FOSSGIS e.V eine Zukunftswerkstatt. Erfahren Sie mehr &#252;ber Ziele, Strukturen und Menschen im Verein. Lassen Sie sich begeistern von der Idee gemeinsam etwas zu bewegen. Das Ziel der Veranstaltung ist, Ihnen zu erl&#228;utern wie der Verein funktioniert, wie sie sich einbringen k&#246;nnen und was sie davon haben. </abstract>
        <description>Wer steckt hinter dem FOSSGIS e.V.? Um diese Frage zu beantworten veranstaltet der FOSSGIS e.V eine Zukunftswerkstatt. Erfahren Sie mehr &#252;ber Ziele, Strukturen und Menschen im Verein. Lassen Sie sich begeistern von der Idee gemeinsam etwas zu bewegen. </description>
        <persons>
          <person id="51">Arnulf Christl</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="905" guid="none">
        <date>2015-03-12T19:30:00+01:00</date>
        <start>19:30</start>
        <duration>02:00</duration>
        <room>Aula</room>
        <slug></slug>
        <title>Vollversammlung FOSSGIS e.V.</title>
        <subtitle>(Senatssaal)</subtitle>
        <track></track>
        <type>other</type>
        <language></language>
        <abstract>Die ordentlichen Mitgliederversammlung 2015 des FOSSGIS e.V. findet am Donnerstag, den 12. M&#228;rz 2014, um 19:30 Uhr
am Rande der FOSSGIS Konferenz statt.</abstract>
        <description></description>
        <persons>
          <person id="135">Marco Lechner</person>
        </persons>
        <links>
        </links>
      </event>
    </room>
    <room name="S10">
      <event id="841" guid="none">
        <date>2015-03-12T09:00:00+01:00</date>
        <start>09:00</start>
        <duration>00:30</duration>
        <room>S10</room>
        <slug></slug>
        <title>OpenLayers 3</title>
        <subtitle>Stand, Neues &amp; Zuk&#252;nfiges </subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>OpenLayers 3 wird vorgestellt, zahlreiche Beispiele zeigen die Verwendung. Unterschiede zur Vorg&#228;ngerversion werden aufgezeigt und auch wo und warum OpenLayers 3 anders ist. Aktuelle Entwicklungen, wie etwa das OL3-Cesium Project, welches die dritte Dimension f&#252;r OpenLayers zu&#228;nglich macht, werden pr&#228;sentiert und ein Blick in die zuk&#252;nftige Entwicklung gewagt.
</abstract>
        <description>OpenLayers 3 (der Nachfolger des weitverbreiteten OpenLayers 2) liegt nach l&#228;ngerer Entwicklungszeit seit Ende August 2014 in der Version 3.0.0 vor und bringt als hoch performante und vielf&#228;ltige JavaScript Bibliothek alles mit, was man f&#252;r moderne Kartenanwendungen im Web ben&#246;tigt.

Der Vortrag wird OpenLayers 3 vorstellen und zahlreiche Beispiele der Verwendung zeigen. Auf Unterschiede zur Vorg&#228;ngerversion wird eingegangen werden, und wir werden zeigen, wo und warum OpenLayers 3 anders ist. Wir werden aktuelle Entwicklungen -- wie etwa das OL3-Cesium Project, welches die dritte Dimension f&#252;r OpenLayers zu&#228;nglich macht -- pr&#228;sentieren und auch einen Blick in die zuk&#252;nftige Entwicklung wagen.

</description>
        <persons>
          <person id="173">Andreas Hocevar</person>
          <person id="488">Bart van den Eijnden</person>
          <person id="34">Marc Jansen</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="850" guid="none">
        <date>2015-03-12T09:30:00+01:00</date>
        <start>09:30</start>
        <duration>00:30</duration>
        <room>S10</room>
        <slug></slug>
        <title>Ein Duett: OpenLayers 3 im Zusammenspiel mit AngularJS</title>
        <subtitle></subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract>AngularJS im Zusammenspiel mit OpenLayers3. Zwei m&#228;chtige Javascript-Bibliotheken treffen aufeinander. Potentiale des Zusammenspiels beider Komponenten werden anhand von Praxisbeispielen aufgezeigt. </abstract>
        <description>Die Ausgangslage: AngularJS ist ein m&#228;chtiges Open-Source-Framework mit der clientseitige Webanwendungen nach dem MVC-Prinzip erstellt werden k&#246;nnen. OpenLayers ist wohl eine der bekanntesten Javascript-Bibliotheken um Karten im Netz nutzen zu k&#246;nnen. Zudem wird diese gerade durch die Neuentwicklung der Version 3 auf den aktuellsten Stand der Technik gebracht.

Im Vortrag werden M&#246;glichkeiten und Anregungen des Zusammenspiels dieser beiden Komponenten aufgezeigt. Ein erstes Aufeinandertreffen der beiden Komponenten gab es f&#252;r den Autor dieses Vortrags im Rahmen eines Projektes in dem eine Kartenanwendung umgesetzt wurde. Besonderes Augenmerk lag bei der Entwicklung auf der schnellen und leichten anpassbar- und Wiederverwendbarkeit der Komponenten. So wurde die Konfiguration von Layern abstrahiert und der Einstieg in die Kartenwelt f&#252;r AgnularJS-Nutzer &#252;ber die Bereitstellung einer Karten-Directive vereinfacht. Zudem wurden AngularJS dazu genutzt typische Kartenelemente wie eine Layerauswahl, eine Ma&#223;stabsanzeige oder einen Permalink zur Kartenanwendung hinzuzuf&#252;gen. 

Neben dem Einblick in die Entwicklung und der Pr&#228;sentation einiger Praxisbeispiele soll am ggf. Ende des Vortrags zudem zu einer BoF aufgerufen werden um eventuelle vorhandene Interessen zu b&#252;ndeln und zu nutzen.</description>
        <persons>
          <person id="142">Dominik Helle</person>
        </persons>
        <links>
          <link href="http://talks.omniscale.de/2015/fossgis/anol/">Online-Folien</link>
        </links>
      </event>
      <event id="834" guid="none">
        <date>2015-03-12T10:00:00+01:00</date>
        <start>10:00</start>
        <duration>00:30</duration>
        <room>S10</room>
        <slug></slug>
        <title>GeoExt</title>
        <subtitle>Ein ExtJS basiertes Rich-Client-WebGIS-Framework in Zeiten von AngularJS und Konsorten</subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract>Der Vortrag stellt die neueste Version von GeoExt vor und zeigt auf, welches Handwerkszeug dem Entwickler hier bereitsgestellt wird. Unterschiede zwischen ExtJS und anderen Bibliotheken werden benannt, dies kann als Diskussionsgrundlage f&#252;r die Wahl einer Bibliothek dienen. Schwerpunkt ist die Betrachtung der zuk&#252;nftigen Entwicklung von GeoExt. 
</abstract>
        <description>GeoExt [1] ist eine auf den JavaScript-Bibliotheken OpenLayers (f&#252;r interaktive Karten im Web und Verarbeitung einer F&#252;lle von OGC-konformen Formaten, [2]) und ExtJS (Framework zur Erstellung von Desktop-&#228;hnlichen Webanwendungen mit nativem Look and Feel, [3]) aufbauende OpenSource JavaScript-Bibliothek, die es vereinfacht, Kartenmaterial in ansprechenden und komplexen Oberfl&#228;chen zu pr&#228;sentieren, so genannte "Rich Webmapping Applications".

Neben ExtJS bietet der Markt eine Vielzahl weiterer JavaScript-Frameworks und Bibliotheken an, die sich ebenfalls der Herausforderung angenommen haben, die Entwicklung von webbasierten JavaScript Clients zu vereinfachen und zu harmonisiseren. Hier sind -- und das ist nur eine willk&#252;rliche Auswahl -- etwa AngularJS ([4]) und EmberJS ([5]) zu nennen. Eben jene Frameworks sind derzeit in der Entwicklergemeinschaft sehr beliebt, es werden viele klare Vorz&#252;ge dieser modernen Frameworks gelobt und die Art und Weise der Probleml&#246;sung spricht viele Developer an.

Der Vortrag wird die neueste Version von GeoExt vorstellen und aufzeigen, welches Handwerkszeug dem Entwickler hier bereitsgestellt wird. Wir werden Unterschiede zwischen ExtJS und den vorgenannten Bibliotheken benennen und Diskussionsgrundlage f&#252;r die Wahl einer Bibliothek geben. Hierbei k&#246;nnen wir als Kernentwickler von GeoExt nie vollst&#228;ndig neutral vorgehen, wir wollen jedoch versuchen jeweilige Vor- und Nachteile der jeweiligen Bibliotheken herauszustellen.

Zum Zeitpunkt der Abstract-Einreichung wird an GeoExt massiv weiterentwickelt: Es stehen die Unterst&#252;tzung von ExtJS 5 und (sp&#228;ter) OpenLayers 3 an. Ein weiterer Schwerpunkt wird dementsprechend auf der Betrachtung dieser und der zuk&#252;nftigen Entwicklung von GeoExt liegen. </description>
        <persons>
          <person id="163">Christian Mayer</person>
          <person id="34">Marc Jansen</person>
        </persons>
        <links>
          <link href="http://emberjs.com/">[5]</link>
          <link href="https://angularjs.org/">[4]</link>
          <link href="http://www.sencha.com/products/extjs/">Version 4.2.1 [3]</link>
          <link href="http://geoext.github.io/geoext2/">Version 2.0.2 [1]</link>
          <link href="http://openlayers.org/two/">Version 2.13.1 [2]</link>
        </links>
      </event>
      <event id="822" guid="none">
        <date>2015-03-12T11:15:00+01:00</date>
        <start>11:15</start>
        <duration>00:30</duration>
        <room>S10</room>
        <slug></slug>
        <title>MapServer Pro-Tipps</title>
        <subtitle>Das 'Do what I want' Know How f&#252;r den UMN MapServer</subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>&#220;ber das Basiswissen hinaus gehende Funktionen des MapServers, wie PHP-Fassaden, JOINs mit Datei basierten Datenquellen, ColorRanges, Buildt-In Openlayers-Client, Cluster von Punktobjekten, Geomtransform, IP-Zugriffsbeschr&#228;nkung sind Themen des Vortrages.
</abstract>
        <description>MapServer ist bekannt f&#252;r seine Zuverl&#228;ssigkeit, Performance und Stabilit&#228;t. Gerne wird aber auch &#252;ber die Konfiguration mit den Mapfiles gest&#246;hnt. Dabei bietet gerade diese Art der Konfiguration M&#246;glichkeiten, die tief in der Dokumentation versteckt sind und die bei kniffligen Augaben wirklich hilfreich sein k&#246;nnen. Die meisten Anwender kennen nur die Basis-Konfigurationen, aber wer wei&#223; schon dass es einen eingebauten OpenLayers-Client gibt, der es erm&#246;gicht nur mit einem Mapfile eine interakive Karte zu ver&#246;ffentlichen, wie man Linien mit Pfeilspitzen versieht, Geometrien gl&#228;ttet oder den Zugriff auf MapServer-WMS direkt im Mapfile auf bestimmte IP-Adressen beschr&#228;nken kann? Mit einfachen PHP (oder anderen) Scripten er&#246;ffnen sich dar&#252;ber hinaus vielf&#228;ltige M&#246;glichkeiten, den MapServer um weitere Funktionen zu erweiteren oder sogar auszutricksen.

Themen:
* zwischen cgi und MapScript: PHP-Fassaden
* JOINs mit Datei basierten Datenquellen
* Schnelle Klassifizierung mit Color Ranges
* Cluster von Punktobjekten bilden
* Sch&#246;nere Karten Dank Geomtransform (Richtungssymbole, shapesmothing,..)
* Buildt-In Openlayers-Client
* Zugriffsbeschr&#228;nkung &#252;ber Client-IPs</description>
        <persons>
          <person id="378">J&#246;rg Thomsen</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="851" guid="none">
        <date>2015-03-12T11:45:00+01:00</date>
        <start>11:45</start>
        <duration>00:30</duration>
        <room>S10</room>
        <slug></slug>
        <title>Mapnik oder MapServer</title>
        <subtitle>...wer macht die sch&#246;nsten Karten</subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Mit Mapnik und MapServer stehen zwei OpenSource Kartenrenderer zur Verf&#252;gung, die in Geschwindigkeit, Funktionsumfang und Bildqualit&#228;t kaum W&#252;nsche &#252;brig lassen. Aber welche Software nehme ich f&#252;r mein Projekt?</abstract>
        <description>Mit Mapnik und MapServer stehen zwei OpenSource Kartenrenderer zur Verf&#252;gung, die in Geschwindigkeit, Funktionsumfang und Bildqualit&#228;t kaum W&#252;nsche &#252;brig lassen. Aber welche Software nehme ich f&#252;r mein Projekt?

Der Vortrag geht auf die kleinen und gro&#223;en Unterschiede zwischen Mapnik und MapServer ein.
F&#252;r welche Einsatzzwecke ist MapServer besser geeignet? Was kann Mapnik besonders gut? Wie k&#246;nnen die Renderer in Anwendungen und Server integriert werden? Gibt es &#252;berhaupt nennenswerte Unterschiede?

Der Vortrag zeigt ausserdem anhand von Beispielen, welche Software das bessere Kartenbild liefert und welche Verbesserungen von den zuk&#252;nftigen Versionen Mapnik 3 und MapServer 7 zu erwarten sind.</description>
        <persons>
          <person id="153">Oliver Tonnhofer</person>
        </persons>
        <links>
          <link href="http://mapnik.org/">http://mapnik.org/</link>
          <link href="http://mapserver.org/">http://mapserver.org/</link>
          <link href="http://talks.omniscale.de/2015/fossgis/mapnik-mapserver/#1">Online-Folien</link>
        </links>
      </event>
      <event id="842" guid="none">
        <date>2015-03-12T12:15:00+01:00</date>
        <start>12:15</start>
        <duration>00:30</duration>
        <room>S10</room>
        <slug></slug>
        <title>GeoServer in action</title>
        <subtitle>Fortgeschrittene M&#246;glichkeiten beim Einsatz des GeoServers</subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>GeoServer in action - Der Vortrag fokussiert sich weniger auf die "Out-of-the-box"-Verwendung des GeoServers, sondern beleuchtet vielmehr fortgeschrittene M&#246;glichkeiten beim Einsatz dieser Software. Es geht um Kompilieren, Schnittstellenverwendung, Extensions, Performance-Tuning, GeoWebCache-Einsatz, Troubleshooting und Stolperfallen.</abstract>
        <description>Der GeoServer ist ein weithin bekannter und m&#228;chtiger OpenSource Kartenserver. Sofern man die Umgebung eingerichtet hat, ist sowohl die Installation als auch die Konfiguration von ersten WMS- und WFS-Layern sehr einfach. In diesem Vortrag wird auf die typischen Anforderungen eines "GeoServers in action" eingegangen. Der Vortrag fokussiert sich also weniger auf die "Out-of-the-box"-Verwendung des GeoServers, sondern beleuchtet vielmehr fortgeschrittene M&#246;glichkeiten beim Einsatz dieser Software.

In diesem Rahmen werden u.a. folgende Themen behandelt:
* GeoServer auf Basis des Source-Codes selber kompilieren
* Verwendung der REST-Schnittstelle
* Einsatz des GeoWebCache (GWC)
* GeoServer Extensions
* Performance-Tuning f&#252;r den Produktiveinsatz auf verschiedenen Ebenen
* Typische Stolperfallen und Troubleshooting

Der Vortrag richtet sich an Entwickler, Anwender und Interessierte.</description>
        <persons>
          <person id="412">Nils B&#252;hner</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="876" guid="none">
        <date>2015-03-12T14:30:00+01:00</date>
        <start>14:30</start>
        <duration>00:30</duration>
        <room>S10</room>
        <slug></slug>
        <title>Routing in der Datenbank</title>
        <subtitle>K&#252;rzeste-Wege-Berechnung und mehr mit pgRouting</subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract>Diese Pr&#228;sentation gibt einen &#220;berblick &#252;ber das pgRouting Projekt und den aktuellen Entwicklungsstand. Die pgRouting-Erweiterung erm&#246;glicht es, auf Daten in einer PostgreSQL-Datenbank eine k&#252;rzeste-Wege-Suche und andere netzorientierte Algorithmen anzuwenden. Neben den etablierten Funktionen sind f&#252;r die nahe Zukunft eine Reihe neuer Algorithmen zur Tourenplanung zu erwarten. Dieser Vortrag stellt die verschiedenen Algorithmen vor und geht darauf ein, wie die Struktur der Netzdaten die Leistung des Systems beeinflussen kann.</abstract>
        <description>pgRouting erweitert eine PostGIS/PostgreSQL Geo-Datenbank um Funktionen f&#252;r &#8220;K&#252;rzeste-Wege&#8221; Berechnung und andere netzorientierte Algorithmen. 

Diese Pr&#228;sentation gibt einen &#220;berblick &#252;ber das pgRouting Projekt und den aktuellen Entwicklungsstand. Neben den bekannten "Shortest Path" Suchalgorithmen, Einzugsbereichsermittlung oder "Travelling Salesperson Problem" (TSP) Optimierung, erhalten Sie einen Ausblick und eine Einf&#252;hrung in die kommenden neuen Features wie den "Vehicle Routing Problem" (VRP) Algorithmus und &#228;hnliche Werkzeuge zur Planung und Optimierung von Touren.

Sie erfahren zudem, warum die Datenstruktur der Netzdaten wichtig ist, um bessere Routing-Ergebnisse zu erzielen. Dar&#252;ber hinaus werden wir zeigen, wie man die Qualit&#228;t der Abfrage mit dynamischer Kosten verbessern kann, und wie das Kostenmodell die Ergebnisse beeinflusst. Sie werden auch &#252;ber Schwierigkeiten und Einschr&#228;nkungen von pgRouting zu erfahren, und f&#252;r welche Anwendungsf&#228;lle die Bibliothek vielleicht nicht nicht das richtige Werkzeug f&#252;r Ihre Routing-Anwendung ist.</description>
        <persons>
          <person id="466">Daniel Kastl</person>
        </persons>
        <links>
          <link href="http://pgrouting.org">http://pgrouting.org</link>
          <link href="http://talks.dkastl.georepublic.info/2015/tourplan.html">http://talks.dkastl.georepublic.info/2015/tourplan.html</link>
        </links>
      </event>
      <event id="871" guid="none">
        <date>2015-03-12T15:00:00+01:00</date>
        <start>15:00</start>
        <duration>00:30</duration>
        <room>S10</room>
        <slug></slug>
        <title>PostGIS Memento</title>
        <subtitle>Versionierung von PostGIS-Datenbanken</subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Memento. Gibt es nicht einen Film, der so hei&#223;t? Jemand, der kein Ged&#228;chtnis hat und sich alle Ereignisse aufschreibt? Zumindest geht es bei pgMemento darum. pgMemento zeichnet alle Ver&#228;nderungen in einer PostgreSQL Datenbank auf und erlaubt die Wiederherstellung beliebiger fr&#252;here Zeitst&#228;nde.</abstract>
        <description>pgMemento ist ein neues Projekt, dass einen Ansatz Datenbanken zu versionieren vorschl&#228;gt. Alle Ver&#228;nderungen werden mittels Triggern in einer Log-Tabelle als JSON-Fragmente aufgezeichnet. Durch den Einsatz von JSON ist es egal, wie die Tabelle beschaffen ist und ob sie sich &#252;ber die Zeit strukturell ver&#228;ndert hat. Mittels einer zus&#228;tzlichen ID-Spalte wird der Bezug zu allen Versionen einer Zeile hergestellt. So k&#246;nnen beliebige fr&#252;here Zeitst&#228;nde eines Tabellentupels ganz einfach wieder hergestellt werden. Mit den JSON-Funktionen von PostgreSQL k&#246;nnen auch komplexe Datentypen wie PostGIS-Geometrien verarbeitet werden. Das Erstellen von fr&#252;heren Versionen der Datenbank erfolgt in separaten Schemata und nicht in der Produktionsdatenbank selbst. 

Wen ein Blick in die Vergangenheit der Datenbank interessiert, der st&#246;&#223;t vielleicht auch auf Informationen, die im Zuge eines Anwenderfehlers irgendwann einmal verloren gegangen aber eigentlich noch g&#252;ltig sind. Da pgMemento zu jedem Log-Eintrag auch stets die dazugeh&#246;rige Transaktion protokolliert, k&#246;nnten alle Ver&#228;nderungen einer Transaktion wieder r&#252;ckg&#228;ngig gemacht werden. Seien es einfache Update-Befehle oder L&#246;schvorg&#228;nge. Das komplette Zur&#252;cksetzen der Datenbank zu einem bestimmten Zeitstempel w&#228;re also nicht notwendig. Dieses Feature muss jedoch erst noch entwickelt werden.

pgMemento ist komplett in PL/pgSQL programmiert, d.h. die Versionierungslogik ist f&#252;r jeden Nutzer transparent und es kann sehr einfach in bestehende Datenbanken eingebunden werden.</description>
        <persons>
          <person id="306">Felix Kunde</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="847" guid="none">
        <date>2015-03-12T16:00:00+01:00</date>
        <start>16:00</start>
        <duration>00:30</duration>
        <room>S10</room>
        <slug></slug>
        <title>Docker f&#252;r den GIS-Einsatz</title>
        <subtitle></subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract>Mit der leichtgewichtige Virtualisierungs-Software Docker schnell und einfach Anwendungs-Container f&#252;r Ihre GIS-Fachanwendung erstellen. Haben die GIS-Admins demn&#228;chst wieder mehr Zeit f&#252;r ungleich spannendere Aufgaben als die Installation von Fachanwendungen? Diese Fragen werden im Vortrag beleuchtet und mit der Erstellung eines Anwendungs-Container f&#252;r die Breitstellung eines WMS-Dienstes abgerundet.</abstract>
        <description>Die leichtgewichtige Virtualisierungs-Software Docker [1] ist zur Zeit in aller Munde.
Mit Docker lassen sich Anwendungen samt ihrer Abh&#228;ngigkeiten in Container verpacken, in denen sie sich sp&#228;ter leicht weitergeben und ausf&#252;hren lassen. ImVergleich zu virtuellen Maschinen sollen Docker-Container sparsamer im Umgang mit Ressourcen sein und schneller starten k&#246;nnen.
Doch was bedeutet Docker f&#252;r den GIS-Einsatz oder die GIS-Entwicklung? Fallen bald die 100seitigen Installationshandb&#252;cher f&#252;r die Installation von Fachanwendungen weg? Haben die GIS-Admins demn&#228;chst wieder mehr Zeit f&#252;r ungleich spannendere Aufgaben als die Installation von Fachanwendungen? Welche Vorteile ergeben sich durch die Anwendungs-Container? Wann lohnt sich der Einsatz von
Anwendungs-Container und wann sollte man lieber zur Virtualisierungs-Software wie VirtualBox und Co. greifen?

All diese Fragen werden im Vortrag auf der FOSSGIS 2015 in M&#252;nster beleuchtet und mit der Erstellung eines Anwendungs-Container f&#252;r die Breitstellung eines WMS-Dienstes abgerundet.</description>
        <persons>
          <person id="57">Bjoern Schilberg</person>
        </persons>
        <links>
          <link href="https://www.docker.com">[1] Docker -  Build, Ship and Run Any App, Anywhere</link>
        </links>
      </event>
      <event id="785" guid="none">
        <date>2015-03-12T16:30:00+01:00</date>
        <start>16:30</start>
        <duration>00:30</duration>
        <room>S10</room>
        <slug></slug>
        <title>GeoCouch</title>
        <subtitle>Ein multidimensionaler Index f&#252;r Couchbase</subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>GeoCouch ist ein multidimensionaler Index f&#252;r Couchbase, einer verteilten dokumentenorientierten Datenbank. Diese sind nicht auf zwei Dimensionen begrenzt, sondern k&#246;nnen durch weitere Attribute erweitert werden. So ist es m&#246;glich Faktoren, wie Zeit, Ausma&#223; oder Kategorien einzubeziehen. Dieser Vortrag wird eine kurze Einf&#252;hrung in Couchbase, die r&#228;umliche Abfragen erm&#246;glicht, und die Datenmodellierung geben und dann in eine Live-Demonstration &#252;bergehen.
</abstract>
        <description>Couchbase ist eine verteilte dokumentenorientierten Datenbank und geh&#246;rt damit zur Kategorie der NoSQL Datenbanken. Das bedeutet, dass das Datenmodell nicht relational ist, also ein gewisses Umdenken bei der Strukturierung der Daten n&#246;tig ist.
GeoCouch ist in Couchbase integriert und erm&#246;glicht r&#228;umliche Abfragen. Diese sind nicht auf zwei Dimensionen begrenzt, sondern k&#246;nnen durch weitere Attribute erweitert werden. So ist es m&#246;glich Faktoren, wie Zeit, Ausma&#223; oder Kategorien einzubeziehen.
Eine beispielhafte multidimensionale Datenbankabfrage w&#228;ren alle Einwohner eines bestimmten Gebiets, die unter 30 Jahre alt sind und in einer Mietwohnung mit weniger als 50m&#178; wohnen.
Dieser Vortrag wird eine kurze Einf&#252;hrung in Couchbase und die Datenmodellerung geben und dann in eine Live-Demonstration &#252;bergehen.
Couchbase ist Open-Source und unter der Apache Lizenz 2.0 lizenziert.

</description>
        <persons>
          <person id="33">Volker Mische</person>
        </persons>
        <links>
          <link href="https://github.com/couchbase/geocouch">GeoCouch Quelltext</link>
          <link href="https://github.com/couchbase/manifest">Couchbase Quelltext</link>
          <link href="http://couchbase.com/">Couchbase</link>
        </links>
      </event>
      <event id="831" guid="none">
        <date>2015-03-12T17:00:00+01:00</date>
        <start>17:00</start>
        <duration>00:30</duration>
        <room>S10</room>
        <slug></slug>
        <title>Vector Tiles</title>
        <subtitle>Performante &#220;bertragung von umfangreichen Vektordaten</subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Der Vortrag beleuchtet die Vor- und Nachteile von Vectortiling und der Vektordaten-Prozessierung im Client allgemein. Als praktischer Anwendungsfall wird das Prinzip der Vectortiles anhand des Software-Stacks TileStache, OpenLayers3 und PostGIS auf Basis von OSM-Daten vorgestellt.</abstract>
        <description>Die Nutzung von Kacheln bzw. &#8222;Tiles&#8220; f&#252;r Rasterdaten in GIS-Anwendungen ist ein alter Hut. Mit der allgemein steigenden Bandbreite von Internetanbindungen, verbesserten Performance der Clients und auch moderneren Webbrowsern r&#252;ckt jedoch wieder eine Idee in den Fokus der WebGIS-Welt, die in der Vergangenheit zwar bereits diskutiert wurde, jedoch mangels technischer Voraussetzungen zum Scheitern verurteilt war: Das Laden und Rendern von umfangreichen Vektordaten im Client. Um eine m&#246;glichst performante &#220;bertragung an den Client zu erreichen, bietet sich die Nutzung von so genannten Vectortiles an.

Die Vorz&#252;ge von Vektoren im Client liegen auf der Hand: Liegen sowohl Geometrien als auch Attribute im Browser vor, so erlaubt dies ein dynamisches Styling im Client, w&#228;hrend der Nutzer bei Rasterdaten keinen Einfluss auf die serverseitig gerenderten Kartenansichten hat. Durch den direkten Zugriff auf Geometrien und Attribute ergeben sich ausserdem Funktionen wie Highlighting, Selektion, Attributabfrage oder Filterung, ohne das jedesmal eine Client-Server-Kommunikation vonn&#246;ten w&#228;re. Ein Gro&#223;teil der Prozessierung wird somit vom Server auf den Client ausgelagert.

Der Vortrag beleuchtet die Vor- und Nachteile von Vectortiling und der Vektordaten-Prozessierung im Client allgemein. Als praktischer Anwendungsfall wird das Prinzip der Vectortiles anhand des Software-Stacks TileStache, OpenLayers3 und PostGIS auf Basis von OSM-Daten vorgestellt.</description>
        <persons>
          <person id="162">Johannes Weskamm</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="908" guid="none">
        <date>2015-03-12T17:30:00+01:00</date>
        <start>17:30</start>
        <duration>01:00</duration>
        <room>S10</room>
        <slug></slug>
        <title>deegree Anwendertreffen</title>
        <subtitle></subtitle>
        <track></track>
        <type></type>
        <language></language>
        <abstract></abstract>
        <description></description>
        <persons>
        </persons>
        <links>
          <link href="http://www.deegree.org">deegree</link>
        </links>
      </event>
    </room>
    <room name="S2">
      <event id="854" guid="none">
        <date>2015-03-12T09:00:00+01:00</date>
        <start>09:00</start>
        <duration>00:30</duration>
        <room>S2</room>
        <slug></slug>
        <title>GRASS Funktionalit&#228;t in QGIS nutzen</title>
        <subtitle>M&#246;glichkeiten der optimalen Interaktion von QGIS und GRASS</subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Seit 2005 ist GRASS GIS in QGIS &#252;ber das GRASS Plugin integriert und stellt hunderte Analysemethoden &#252;ber QGIS bereit - erg&#228;nzend mittlerweile auch &#252;ber das Processing und WPS Plugin. Wir vergleichen die drei Varianten und schauen in die Zukunft.
</abstract>
        <description>Seit 2005 ist GRASS GIS Funktionalit&#228;t in QGIS &#252;ber das GRASS Plugin integriert und bietet die M&#246;glichkeit, hunderte, bew&#228;hrte GRASS Module zur Datenanalyse und -modellierung &#252;ber die benutzerfreundliche QGIS GUI anwenden zu k&#246;nnen. Durch das Processing und das WPS Plugin ist diese Interaktion in den letzten Jahren durch zwei neue, v&#246;llig unterschiedliche Ans&#228;tze erg&#228;nzt und erweitert worden.

Wir starten in diesem Vortrag einen Vergleich der drei M&#246;glichkeiten zur Interaktion von GRASS und QGIS. Anhand von Beispielen stellen wir die Vor- und Nachteile dar und versuchen aufzuzeigen, welche Variante in welcher Situation die beste L&#246;sung darstellt. Wann ist es sinnvoll das Processing Plugin zu verwenden, wann sollte man auf das bew&#228;hrte GRASS Plugin setzen und welche St&#228;rken und Schwachstellen bietet die Integration von GRASS Funktionalit&#228;t &#252;ber das WPS Plugin. 

Als Abschluss stellen wir die Aktuelle Entwicklung der Interaktion zwischen GRASS und QGIS vor und versuchen einen Blick in die zuk&#252;nftige Entwicklung zu werfen. 

</description>
        <persons>
          <person id="9">Otto Dassau</person>
          <person id="35">S&#246;ren Gebbert</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="862" guid="none">
        <date>2015-03-12T09:30:00+01:00</date>
        <start>09:30</start>
        <duration>00:30</duration>
        <room>S2</room>
        <slug></slug>
        <title>Zeitreihenanalyse mit GRASS GIS</title>
        <subtitle>GRASS das temporale Open Source GIS</subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract>Durch die Integration der Zeit als neue Dimension in GRASS GIS stehen nun &#252;ber 45 Werkzeuge zur Zeitreihenalayse bereit. Eine Auswahl an Werkzeugen f&#252;r die Analyse, Verarbeitung und Visualisierung von Raster- und Vektor-Zeitreihen wird vorgestellt.</abstract>
        <description>Seit den 90iger Jahren wurde GRASS GIS f&#252;r die Analyse von Satellitenbild-Zeitreihen und numerischen Modellen verwendet. Seit der GRASS GIS Version 7 steht nun jedoch eine neue Dimension von Werkzeugen zur Zeitreihenanalyse zur Verf&#252;gung. 

GRASS GIS ist das erste Open Source GIS in das die Zeit als eine weiterer Dimension integriert wurde. 
Dabei wurde Wert auf Effizienz und parallele Verarbeitung von gro&#223;en Zeitreihen gelegt. Dadurch ist GRASS GIS in der Lage Zeitreihen mit zehntausenden Raster, 3D Raster- oder Vektorlayern zu verarbeiten.

Es stehen &#252;ber 45 Werkzeuge f&#252;r Management, Analyse, Verarbeiten und Visualisierung von Raster-, 3D Raster und Vektorzeitreihen bereit. In diesem Vortrag wird eine Auswahl der verschiedenen Werkzeuge vorgestellt. 

Diese umfassen die:
* Effiziente Handhabung von tausenden Raster- und Vektor-Layern in so genannten Space Time Datasets
* Kombinierte r&#228;umliche und zeitliche Abfragen mittels SQL und algebraischen Ausdr&#252;cken
* Zeitreihenverabreitung mittels einer Raum-Zeit Kartenalgebra
* Zeitliche Aggregation sowie Akkumulation von Rasterzeitreihen
* Visualisierung von verschiedenen Raster- und Vektorzeitreihen mittels Animation
* Darstellung von temporalen Beziehungen zwischen Zeitreihen
</description>
        <persons>
          <person id="35">S&#246;ren Gebbert</person>
        </persons>
        <links>
          <link href="http://ifgi.uni-muenster.de/~epebe_01/tgrass.pdf">Wissenschaftlicher Artikel &#252;ber Zeit in GRASS GIS</link>
          <link href="http://www.josis.org/index.php/josis/article/view/206">Wissenschaftlicher Artikel &#252;ber das GRASS GIS Temporal Framework (im Review Prozess)</link>
        </links>
      </event>
      <event id="830" guid="none">
        <date>2015-03-12T10:00:00+01:00</date>
        <start>10:00</start>
        <duration>00:30</duration>
        <room>S2</room>
        <slug></slug>
        <title>Kreisbogen in QGIS</title>
        <subtitle></subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Neben den g&#228;ngigen Vektorelementen (Punkt, Linie, Polygon) unterst&#252;tzt QGIS neu Kreisbogengeometrien. Es ist jetzt m&#246;glich solche Geometrietypen (ST_CircularString, ST_CompoundCurve, ST_CurvePolygon etc.) aus einer Postgis-Datenbank zu lesen, anzuzeigen, zu editieren und wieder zu speichern.</abstract>
        <description>G&#228;ngige Vektorelemente eines Geografischen Informationssystems sind Punkt, Linie und Polygon. In der amtlichen Vermessung (amtlicher Liegenschaftskataster) und anderen Themenkreisen ist zus&#228;tzlich der Kreisbogen zum Definieren und Verwalten von Objekten erlaubt. Propriet&#228;re geografische Informationssysteme zur Erfassung und Verwaltung der amtlichen Vermessung erlauben, im Gegensatz zu den g&#228;ngigen FOSSGIS Desktop L&#246;sungen, den Umgang mit Kreisbogen. FOSSGIS L&#246;sungen segmentieren die Kreisbogen beim Import in das Zielsystem. Dieser pragmatische Ansatz hat neben einigen Vorteilen aber leider den Nachteil, dass man das Wissen &#252;ber die Lage und die Definition eines Kreisbogenelementes verliert. 

F&#252;r die Verifikation verschiedener Datens&#228;tze wurden Entwicklungen im Kern von QGIS hinsichtlich der Verwaltung und Bearbeitung von Kreisbogen gemacht. Neu k&#246;nnen Kreisbogengeometrien (ST_CircularString, ST_CompoundCurve, ST_CurvePolygon etc.) aus einer Postgis-Datenbank gelesen, in QGIS angezeigt und editiert werden und anschliessend wieder gespeichert werden. Daf&#252;r wurde die Geometrieklasse von QGIS neu entwickelt. Zus&#228;tzlich zu den Kreisb&#246;gen kann durch das Redesign korrekt mit M- und Z-Werten von Koordinaten umgegangen werden. Ebenfalls denkbar sind zuk&#252;nftig weitere Geometrietypen wie Splines etc. 

Neben den technischen Erweiterungen und den daraus resultierenden Herausforderungen wird gezeigt aus welchem Grund nicht alle Arbeitsschritte den Umgang mit Kreisbogen beherrschen. So k&#246;nnen zum Beispiel die meisten Geometrieoperatieon (Verschnitte, Differenzen etc.) noch nicht mit Kreisbogengeometrien umgehen. F&#252;r diese Arbeitsschritte wird die Geometrie on-the-fly segmentiert.

Neben dem eigentlichen Ausl&#246;ser - der Verifikation von Geodaten - darf auch der Vorteil bei der Erfassung nicht untersch&#228;tzt werden. So sind in verschiedenen Themenkreisen Daten viel schneller erfasst, wenn sie mittels Kreisbogen (drei Punkte) definiert werden k&#246;nnen.

Aktuelle Entwicklungen in anderen Projekten (ogr2ogr, GeoServer) zeigen, dass die Thematik &#8220;Kreisbogen&#8221; endg&#252;ltig in der Open Source GIS Welt angekommen ist.</description>
        <persons>
          <person id="183">Stefan Ziegler</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="877" guid="none">
        <date>2015-03-12T11:15:00+01:00</date>
        <start>11:15</start>
        <duration>00:30</duration>
        <room>S2</room>
        <slug></slug>
        <title>Geospatial Ruby</title>
        <subtitle></subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Der Talk &#187;Geospatial Ruby&#171; gibt einen &#220;berblick dar&#252;ber, was mit Ruby im Geo Bereich m&#246;glich ist. Viele gro&#223;e erfolgreiche Webprojekte sind mit Ruby und dem dazugeh&#246;rigen Webframework Rails umgesetzt worden. </abstract>
        <description>Auf der letzen FOSS4G in Portland trafen sich einige Ruby Entwickler die im Geo Bereich aktiv sind um sich auszutauschen. Diese kleine Gruppe hat sich zum Ziel gesetzt Ruby der Geospatial Community n&#228;her zu bringen. Ich war Teil dieser kleinen Gruppe und will meinen Beitrag mit diesem Talk leisten.

Der Vortrag &#187;Geospatial Ruby&#171; soll einen &#220;berblick dar&#252;ber geben, was mit Ruby im Geo Bereich m&#246;glich ist. 
Ruby ist eine dynamische Programmiersprache die sehr Entwicklerfreundlich ist und eine sehr aktive und Test-freudige Community hat.
Viele gro&#223;e erfolgreiche Webprojekte sind mit Ruby und dem dazugeh&#246;rigen Webframework Rails umgesetzt worden. 
Der Fokus von &#8222;Geospatial Ruby&#8220; liegt auf drei wichtigen Bibliotheken. Alle drei vereinfachen den Umgang mit Geo Daten in einer sehr erfolgreichen und angenehmen zu schreibenden Sprache. 

Die erste Bibliothek ist das terraformer.rb von ESRI (Washington+Portland), welches eine Portierung der Javascript Bibliothek terraformer.js ist. 
Terraformer ist ein Toolkit um mit Geometrie, Geographie, Formaten und um Geo-Datenbanken umzugehen.

Die zweite Bibliothek ist rgeo. rgeo ist die Allzweckwaffe f&#252;r alles was Geo in Ruby betrifft. 
Sie vereinfacht das Schreiben von Location-Aware Applikationen.

Die dritte Bibliothek ist SimpleTile von propublica. 
Mit dieser Bibliothek ist es sehr einfach einen TileServer aufzusetzen. 
Es k&#246;nnen sowohl einfache Raster-Tiles als auch komplexere Vektor-Tiles ausgeliefert werden. </description>
        <persons>
          <person id="480">Mila Frerichs</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="814" guid="none">
        <date>2015-03-12T11:45:00+01:00</date>
        <start>11:45</start>
        <duration>00:30</duration>
        <room>S2</room>
        <slug></slug>
        <title>Jsonix: OGC Web Services in JSON</title>
        <subtitle>nie mehr XML in JavaScript-Apps verarbeiten, mit Jsonix spricht JSON mit den OGC Web Services </subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract>Wie kann man mit den OGC Web Services in reinem JSON (statt XML) sprechen? Mit Jsonix, einem m&#228;chtigen JavaScript-Tool f&#252;r XML&lt;-&gt;JSON Konvertierung. Es gibt Live-Demos von WMS, WFS, CSW sowie OL3 WPS Client.</abstract>
        <description>JSON hat wahrscheinlich XML schon l&#228;ngst als "lingua franca" ersetzt. Es ist viel leichtgewichtiger und einfacher zu verwenden als XML, vor allem in den JavaScript-basierten Web Apps.

Das Web GIS Umfeld wird von JavaScript-Bibliotheken wie OpenLayers und Leaflet dominiert. F&#252;r die geh&#246;rt JSON sowieso zur Muttersprache. 
Aber die OGC-Standards sind fast alle XML-basiert und durch XML Schemata spezifiziert. Also, muss man auch in JS-Apps XML sprechen k&#246;nnen.
Und das ist l&#228;stig. Der OL3 KML-Parser ist &#252;ber 2.5KLoc, davon ist ca. 90% reines XML-Parsing und nur 10% die Payload-Verarbeitung.
W&#228;re es nicht sch&#246;n, wenn man mit den OGC Web Services in JSON sprechen k&#246;nnte? Und 90% des Aufwands sparen?
Jsonix ist eine Open-Source Bibliothek f&#252;r die XML&lt;-&gt;JS Konvertierung, die genau das m&#246;glich macht.
Mit Jsonix kann man ein XML Schema nehmen und daraus eine Mapping-Datei erzeugen. Damit kann man zwischen XML und JSON in beiden Richtungen konventieren.
Dabei ist Jsonix Typ- und Struktur-sicher. Z.B. wird es aus `xs:decimal` ein `Number`, und da wo in XSD ein wiederholbares Element war, bekommt man in JSON einen Array.
Die Mappings kann man entweder selber generieren - oder eines der vorgenerierten holen.
Das `OGC Schemas` Projekt liefert vorgenerierte und durchgetestete Mappings f&#252;r viele OGC Schemas (WMS, WFS, CSW, ...).
Dieser Vortrag gibt eine &#220;berblick von Jsonix und zeigt es Live in WMS, WFS, CSW sowie OL3 WPS Client Demos vor.</description>
        <persons>
          <person id="464">Alexey Valikov</person>
        </persons>
        <links>
          <link href="http://confluence.highsource.org/display/JSNX/User+Guide">Jsonix Dokumentation</link>
          <link href="https://github.com/highsource/jsonix">Jsonix auf GitHub</link>
        </links>
      </event>
      <event id="845" guid="none">
        <date>2015-03-12T12:15:00+01:00</date>
        <start>12:15</start>
        <duration>00:30</duration>
        <room>S2</room>
        <slug></slug>
        <title>Serverseitiges JavaScript und GIS</title>
        <subtitle>Mit Node.js und npm die Welt beherrschen</subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Der Vortrag gibt eine allgemeine Einf&#252;hrung in eine recht junge Open Source Plattform f&#252;r serverseitige Netzwerkanwendungen Node.js und zeigt wie mit Node.js geo-relevante Probleme, wie das Einlesen von GIS-Datenformaten sowie die Verarbeitung von Geodaten m&#246;glich werden. Ebenso wird eine &#220;bersicht von n&#252;tzlichen Node.js-Modulen aus dem GIS-Bereich sowie Beispielanwendungen vorgestellt.</abstract>
        <description>Node.js [1] ist eine recht junge Open Source Plattform f&#252;r serverseitige Netzwerkanwendungen, die erstmalig in 2009 f&#252;r Linux ver&#246;ffentlicht wurde. Die Besonderheit ist dabei, dass die Programme in JavaScript geschrieben werden, was bislang nur f&#252;r Client-Anwendungen im Browser g&#228;ngig war. Durch die Event-getriebene Architektur sowie einen asynchronen, nicht-blockierenden IO-Mechanismus kann performante und ressourcenschonende Software entwickelt werden. Node.js liegt aktuell (November 2014) in der Version 0.10.33 vor und ist unter der offenen MIT-Lizenz [2] ver&#246;ffentlicht.

Da JavaScript die f&#252;hrende Programmiersprache f&#252;r browserbasierte Webmapping-Anwendungen ist, was etablierte Bibliotheken wie OpenLayers, Leaflet oder GeoExt zeigen, wird verdeutlicht welche M&#246;glichkeiten sich JavaScript-GIS-Entwicklern nun mit der serverseitigen Prozessierung er&#246;ffnen: Mit etablierten Werkzeugen k&#246;nnen Anwendungen und Webservices zur Geoprozessierung erstellt werden ohne die gewohnte Programmiersprache verlassen zu m&#252;ssen. Des Weiteren liegt mit npm ("Node Packaged Modules", dem Node.js Paket Manager) [3] eine Software vor, die es eminent vereinfacht modular und wiederverwertbar zu entwickeln und auf der Arbeit anderer Entwickler eigene Software aufzubauen.

Der Vortrag gibt eine allgemeine Einf&#252;hrung in die Node.js-Welt und zeigt wie mit Node.js geo-relevante Probleme, wie das Einlesen von GIS-Datenformaten sowie die Verarbeitung von Geodaten m&#246;glich wird. Ebenso wird eine &#220;bersicht von n&#252;tzlichen Node.js-Modulen aus dem GIS-Bereich sowie Beispielanwendungen vorgestellt.</description>
        <persons>
          <person id="163">Christian Mayer</person>
          <person id="34">Marc Jansen</person>
        </persons>
        <links>
          <link href="https://nodejs.org/">[1]</link>
          <link href="http://opensource.org/licenses/mit-license.php">[2]</link>
          <link href="https://www.npmjs.org/">[3]</link>
        </links>
      </event>
      <event id="821" guid="none">
        <date>2015-03-12T14:30:00+01:00</date>
        <start>14:30</start>
        <duration>00:30</duration>
        <room>S2</room>
        <slug></slug>
        <title>Erfassung von Landnutzungsver&#228;nderungen mit FOSS Image Processing Tools</title>
        <subtitle>Change Detection mit QGIS - Landnutzungs- und -bedeckungsver&#228;nderungen erfassen </subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract>Im Rahmen einer Masterarbeit am Geographischen Institut der Universit&#228;t Bonn wurden zwei Change Detection Verfahren mit Free &amp; Open Source Image Processing Tools angewandt und evaluiert.  Ver&#228;nderungen der Landnutzung- und -bedeckung konnten mit diesen Verfahren quantitativ erfassen werden. </abstract>
        <description>Im Rahmen einer Masterarbeit am Geographischen Institut der Universit&#228;t Bonn wurden zwei Change Detection Verfahren mit Free &amp; Open Source Image Processing Tools angewandt und evaluiert. Auf Grundlage von zwei multispektralen Satellitenbilder (Landsat-5) wurde f&#252;r den Zeitraum von 1989 bis 2010 einerseits ein Post-Classification Comparison und andererseits ein NDVI Image Differencing mit QGIS  f&#252;r die Region K&#246;ln/Bonn durchgef&#252;hrt. Ver&#228;nderungen der Landnutzung- und -bedeckung konnten mit diesen Verfahren quantitativ erfassen werden. Zu den verwendeten Free &amp; Open Source Image Processing Tools z&#228;hlen das Semi-Automatic Classification Plugin und Image Processing Tools der Orfeo Toolbox und SAGA im Rahmen des Processing Framework von QGIS. Das Ziel war es zum einen die M&#246;glichkeiten der Free &amp; Open Source Image Processing Tools f&#252;r Fernerkundungsanalysen im Kontext von Landnutzungs- und -bedeckungsver&#228;nderungen aufzuzeigen und andererseits zwei g&#228;ngige Change Detection Verfahren hinsichtlich der quantitativ Erfassung von Ver&#228;nderungen der Vegetation im Untersuchungsgebiet zu evaluieren. Im Untersuchungsgebiet wurden drei Subsets ausgew&#228;hlt, um mehrere R&#228;ume mit unterschiedlichen Anteilen und Verteilungen der Landnutzungs- und -bedeckungsklassen zu haben. Ein Vergleich der ermittelten Ver&#228;nderungen zeigte, dass beide Change Detection Verfahren die Vegetationszu- und -abnahmen in unterschiedlichem Ma&#223;e erfasst haben.</description>
        <persons>
          <person id="465">Jakob Tworek</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="856" guid="none">
        <date>2015-03-12T15:00:00+01:00</date>
        <start>15:00</start>
        <duration>00:30</duration>
        <room>S2</room>
        <slug></slug>
        <title>Automatisiertes Geodatenmanagement mit  GeoKettle</title>
        <subtitle></subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Dieser Vortrag stellt verschiedene Einsatzm&#246;glichkeiten der freien ETL-Software GeoKettle vor. GeoKettle ist die Open Source-Alternative zur verbreiteten Software "FME" und kann nicht nur Geodatenformate konvertieren, sondern beispielsweise auch Objekte verteilen und zusammenfassen, redundante Daten finden oder Prozesse in einer grafischen Oberfl&#228;che modellieren.</abstract>
        <description>WhereGroup GmbH &amp; Co. KG 

Abstract

GeoKettle
GeoKettle ist ein ETL-Programm f&#252;r r&#228;umliche Daten. ETL steht f&#252;r Extract, Load und Transform. GeoKettle basiert auf der OpenSource Software Pentaho Data Integration (Kettle) und ist mit der LPGL lizensiert. GeoKettle unterst&#252;tzt dabei u.a. die OpenSource Bibliotheken GeoTools, Degree und gdal/ogr und sextante. Es kann als OpenSource-Alternative f&#252;r die FME eingesetzt werden und bietet vielf&#228;ltige Einsatzm&#246;glichkeiten.
W&#228;hrend des Vortrags werden einige Einsatzm&#246;glichkeiten und Funktionen von GeoKettle vorgestellt, um dem Auditorium einen Einblick in die Leistungsf&#228;higkeit von Geokettle zu geben. Zu den Funktionalit&#228;ten geh&#246;ren:
Import verschiedener (Geo-)Datenformate
Verteilen von Objekten in einem Shapefile auf mehrere Tabellen
Zusammenfassen von Objekte aus mehreren Shapefiles mit unterschiedlichen Attributfeldern in einer Tabelle
Ver&#228;nderung von Attributen
Entfernen von redundanten Daten
Benutzten des graphischen Benutzeroberfl&#228;che zur Modellierung von Prozessen.
Benutzen der Shellskripte zur automatisierten Verwendung von GeoKettle &#252;ber cronjobs
...</description>
        <persons>
          <person id="347">Jens Schaefermeyer</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="848" guid="none">
        <date>2015-03-12T16:00:00+01:00</date>
        <start>16:00</start>
        <duration>00:30</duration>
        <room>S2</room>
        <slug></slug>
        <title>WPS, GeoServer und SHOGun</title>
        <subtitle></subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Der Vortrag stellt die Erweiterung des SHOgun Frameworks als WPS-CLient dar. Als WPS Server kommt der GeoServer-WPS zum Einsatz. Der Vortrag wird zum einen kurz die Mechanismen des WPS erl&#228;utern, die Einbindung in das SHOGun Framework an praktischen Beispielen zeigen und am Ende die M&#246;glichkeiten, die sich daraus f&#252;r ein WebGIS ergeben, vorstellen. Das Prinzip eines WPS wird vorgestellt und die Umsetzung innerhalb von SHOGun gezeigt, St&#228;rken, Potentiale, aber auch Schw&#228;chen oder m&#246;gliche Begrenzungen werden gezeigt.</abstract>
        <description>SHOGun ist ein OpenSource WebGIS Framework, das bereits auf den letzten FOSSGIS Konferenzen vorgestellt wurde.

In der derzeitigen Version bietet SHOGun die M&#246;glichkeit aus einer Installation Layer aus verschiedenen Kartendiensten, WebGIS-Oberfl&#228;chen und Benutzer zu verwalten, WMS und WFS-Dienste abzusichern sowie dar&#252;ber hinaus viele Webschnittstellen &#252;ber Mittel des Frameworks Java Spring zur Verf&#252;gung zu stellen. SHOGun ist somit eine m&#228;chtige, datenbankunabh&#228;ngige Middleware, die in gro&#223;en Verwaltungen ein komplettes GIS ersetzt.

Der WebGIS-Client zeichnet sich durch eine F&#252;lle an Funktionen aus, die weit &#252;ber den normalen Funktionsumfang eines WebGIS hinaus gehen. Dennoch erfordert jede funktionale Erweiterung bisher eine entsprechende Programmierung in SHOGun. Aus diesem Grunde wurde f&#252;r die Wasserwirtschafts-Verwaltung Rheinland-Pfalz SHOGun um eine Web Processing Service (WPS) Client-Schnittstelle erweitert. Da SHOGun ohnehin in der Lage ist, GeoServer &#252;ber seine REST-API anzusprechen, wurde auch der GeoServer WPS verwendet. &#220;ber die Verwaltungsoberfl&#228;che von SHOGun lassen sich einzelne oder verkettete WPS-Prozesse in einen WebGIS-Clienten einbinden. Damit ist eine funktionale Erweiterung mittels Konfiguration &#252;ber die Oberfl&#228;che m&#246;glich. Zur Ergebnisverarbeitung stellt SHOGun wiederum verschiedene Methoden und Funktionen bereit. 
Selbstverst&#228;ndlich hat die Implementierung Einschr&#228;nkungen, dies alleine aufgrund der de facto unbegrenzten M&#246;glichkeiten, die die WPS-Spezifikaiton bietet.

Der Vortrag stellt das Prinzip eines WPS vor und die Umsetzung innerhalb von SHOGun, zeigt St&#228;rken, Potentiale, aber auch Schw&#228;chen oder m&#246;gliche Begrenzungen auf.</description>
        <persons>
          <person id="23">Till Adams</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="792" guid="none">
        <date>2015-03-12T16:30:00+01:00</date>
        <start>16:30</start>
        <duration>00:30</duration>
        <room>S2</room>
        <slug></slug>
        <title>Mapbender3 f&#252;r den einfachen Aufbau von WebGIS Anwendungen </title>
        <subtitle>So einfach ist der Aufbau von WebGIS Anwendungen mit Mapbender3</subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Mapbender3 ist eine Software zur einfachen Erstellung von WebGIS Anwendungen. &#220;ber ein paar Klicks k&#246;nnen mit dem webbasierten Administrations-Backend individuelle Anwendungen erstellt werden, eine Benutzer- und Gruppenverwaltung mit der M&#246;glichkeit Rechte zuzuweisen. Der Vortrag geht vor allem auf die neuen Komponenten in Mapbender3 ein und stellt diese vor. Anpassung an das eigne Layout durch den webbasierten CSS-Editor, suchen in eignen Daten und Rechteverwaltung werden thematisiert.</abstract>
        <description>Mapbender3 ist eine Software zur einfachen Erstellung von WebGIS Anwendungen. &#220;ber ein paar Klicks k&#246;nnen mit dem webbasierten Administrations-Backend individuelle Anwendungen erstellt werden. Das Administrations-Backend beinhaltet au&#223;erdem die M&#246;glichkeit, ein Dienste-Repository aufzubauen. Mapbender3 bietet zudem eine Benutzer- und Gruppenverwaltung mit der M&#246;glichkeit Rechte zuzuweisen.

Basierend auf dem Symfony2 Framework wurde eine moderne Webanwendung geschaffen, die durch das Baukastensystem der Bundles von Symfony2 einzeln als auch in andere Anwendungen integriert Verwendung finden kann. OpenLayer 2 dient als Kartenanwendung und wird &#252;ber MapQuery angesprochen.

Der Vortrag geht vor allem auf die neuen Komponenten in Mapbender3 ein und stellt diese vor. Im letzten Jahr ist viel passiert, so dass es Einiges zu pr&#228;sentieren gibt. Das Anpassen von Mapbender3 Anwendungen an das eigene Layout ist durch den webbasierten CSS-Editor und auch durch die M&#246;glichkeit direkt HTML zu definieren noch viel einfacher geworden. Suchen k&#246;nnen einfach auf die eigenen Daten aufgesetzt werden. Und noch viel mehr... </description>
        <persons>
          <person id="65">Astrid Emde</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="811" guid="none">
        <date>2015-03-12T17:00:00+01:00</date>
        <start>17:00</start>
        <duration>00:30</duration>
        <room>S2</room>
        <slug></slug>
        <title>Erfahrungen mit Sensor Web-Anwendungen</title>
        <subtitle>Erfahrungen mit Sensor Web-Anwendungen f&#252;r mobile Ger&#228;te und Desktop-Anwendungen</subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract>Dieser Vortrag stellt einen freien, auf JavaScript basierenden Sensor Web-Client vor, der auf allen Arten von Endger&#228;ten von Mobiltelefonen bis hin zu Desktop-PCs einsetzbar ist. Er geht auf die Entwicklung des Clients und auf seine Nutzung als eigenst&#228;ndige Software und als Basis eigener Projekte ein.</abstract>
        <description>Die meisten zurzeit verf&#252;gbaren Sensor Web-Anwendungen sind auf die Analyse und Visualisierung von Messdaten in Desktop-Anwendungen (Web Browser oder GIS) ausgerichtet. Allerdings hat sich durch die immer weiter fortschreitende Technik ein zus&#228;tzliches Spektrum an Endger&#228;ten, von Smart Phones bis hin zu Tablet-Computern, entwickelt. Insbesondere mobile Anwendungen, sowohl innerhalb von Organisationen zur Unterst&#252;tzung der Mitarbeiter als auch extern zur Kommunikation mit der &#214;ffentlichkeit, profitieren von der Verf&#252;gbarkeit von Messdaten. Allerdings ist die Pflege von unterschiedlichen Anwendungen f&#252;r verschiedene Plattformen aufwendig und unwirtschaftlich.

Daher wurde in einem Kooperationsprojekt des Wupperverbands, der belgische interregionalen Umweltagentur und der 52&#176;North GmbH ein neuer Sensor Web-Client entwickelt, welcher auf JavaScript und verschiedenen JavaScript-Frameworks bzw. -Bibliotheken (z.B. jQuery, Leaflet, Flot) beruht. Ziel dieses Open Source Clients ist es, eine Anwendung zu entwickeln, welche einerseits flexibel an die unterschiedlichen Bed&#252;rfnisse verschiedener Nutzer angepasst werden kann und gleichzeitig auf der gesamten Bandbreite von Mobiltelefonen bis hin zu einem Desktop-Browser genutzt werden kann (Responsive Design).

Ziel dieses Vortrags ist es, die Erfahrungen mit der Entwicklung vorzustellen und gleichzeitig anderen Nutzern sowie Entwicklern einen Einblick zu geben, wie Sie den Client selbst nutzen bzw. f&#252;r eigene Zwecke anpassen k&#246;nnen.</description>
        <persons>
          <person id="39">Simon Jirka</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="824" guid="none">
        <date>2015-03-12T17:30:00+01:00</date>
        <start>17:30</start>
        <duration>01:00</duration>
        <room>S2</room>
        <slug></slug>
        <title>SHOGun BoF / Anwender- und Entwicklertreffen</title>
        <subtitle></subtitle>
        <track></track>
        <type></type>
        <language></language>
        <abstract>offenes Anwender- und Nutzertreffen. Vorgestellt wird der aktuelle Entwicklungsstand von SHOgun, neue Ideen und auch neue Entwicklungen, die seit der FOSSGIS 2014 dazu gekommen sind. So u.a. auch der WPS-Client.</abstract>
        <description>Wie auch im letzten Jahr, wollen wir auch auf der FOSSGIS 2015 eine BoF zum Thema "SHOgun" veranstalten. Wir laden interessierte zur Teilnahme ein. Vorgestellt wird der aktuelle Entwicklungsstand von SHOgun, neue Ideen und auch neue Entwicklungen, die seit der FOSSGIS 2014 dazu gekommen sind. So u.a. auch der WPS-Client.</description>
        <persons>
        </persons>
        <links>
        </links>
      </event>
    </room>
    <room name="S1">
      <event id="783" guid="none">
        <date>2015-03-12T09:00:00+01:00</date>
        <start>09:00</start>
        <duration>00:30</duration>
        <room>S1</room>
        <slug></slug>
        <title>OSM und die Kunst die Welt zu ordnen</title>
        <subtitle>Sprachliche und logische Aspekte des Taggingschemas in OpenStreetMap</subtitle>
        <track>Vorträge (OSM)</track>
        <type>lecture</type>
        <language></language>
        <abstract>Auseinandersetzung mit der Frage des &#8222;richtigen&#8220; taggings, also der &#8222;richtigen&#8220; Wiedergabe der Wirklichkeit mittels Tags, aus Sicht der Logik und sprachwissenschaftlicher Erkenntnisse.</abstract>
        <description>Einer der gro&#223;en Unterschiede von OpenStreetMap zur klassischen Geodatenerfassung ist es, dass kein hierarchisches gegliedertes System zur Kennzeichnung der erfassten Daten existiert. Bei OpenStreetMap d&#252;rfen im Prinzip alle Mapper ihre Daten so erfassen, wie sie es f&#252;r richtig halten. 

&#220;ber die Frage des &#8222;richtigen&#8220; taggings, wird sehr h&#228;ufig gestritten. Oft verlaufen die Diskussionen ohne Ergebnis im Sande.

Dabei zeigt sich, dass h&#228;ufig schon bei der Diskussion eines Problems aneinander vorbeigeredet wird, da der Kontext des Diskussionspartners nicht ber&#252;cksichtigt wird. Dies zeigt sich h&#228;u&#64257;g auch in einer mangelnden Auseinandersetzung mit Grundprinzipien der Logik. Zudem bleibt unber&#252;cksichtigt, dass sich die Tag&#64257;ndung aufgrund der &#8222;on the ground rule&#8220; an der Alltagsbedeutung von Begriffen orientiert, in den anschlie&#223;enden Diskussionen aber eine feste Bedeutung im Sinne wissenschaftlicher De&#64257;nitionen unterstellt wird.</description>
        <persons>
          <person id="147">Falk Zscheile</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="894" guid="none">
        <date>2015-03-12T09:30:00+01:00</date>
        <start>09:30</start>
        <duration>00:30</duration>
        <room>S1</room>
        <slug></slug>
        <title>OSM auf R&#228;der</title>
        <subtitle></subtitle>
        <track>Vorträge (OSM)</track>
        <type>lecture</type>
        <language></language>
        <abstract>Sind die OSM Karten soweit, um den Wettbewerb mit kommerziellen Karten im Autonavigationsbereich aufzunehmen?</abstract>
        <description>Die OSM Karten basieren auf dem direkten User Feedback und verbessern kontinuierlich die Kartenqualit&#228;t. Die Software-Unternehmen aus dem automotiven Bereich verfolgen die OSM Entwicklung mit gr&#246;&#223;er Aufmerksamkeit und stehen  auf der Spitze der Implementierung  dieser neuen Technologie.
Elektrobit Automotive ist ein globaler Automobil Software-Unternehmen und bringt folgende Themen in die Diskussion:   
- Die heutige Beurteilung der OSM Karten aus Sicht der professionellen Fahrzeugnavigationssysteme
- Potenzial von OSM Karten in der Automobilindustrie und m&#246;gliche Auswirkungen von dem Projekt auf die Navigationsindustrie
- Langfristigen Aussichten f&#252;r die OSM in dem automotiven-Kontext

Au&#223;erhalb der Abstract Ver&#246;ffentlichung im Web, f&#252;r die FOSSGIS Komission:
Elektrobit wird w&#228;hrend des Vortrages zum ersten Mal eine praktische Implementierung von OSM Karten in einer neuen, kostenlosen Navigation App mit dem professionellen automotive- Kernel pr&#228;sentieren.</description>
        <persons>
          <person id="485">Nicole Beringer</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="771" guid="none">
        <date>2015-03-12T10:00:00+01:00</date>
        <start>10:00</start>
        <duration>00:30</duration>
        <room>S1</room>
        <slug></slug>
        <title>Automatisierte OSM Aufbereitung &amp; Analyse von LKW-Mautstrecken in Deutschland</title>
        <subtitle></subtitle>
        <track>Vorträge (OSM)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Das beschriebene Tool und die damit erzeugten Mautdaten erleichtern den OSM-Mappern die Arbeit. F&#252;r ihn validiert das Tool durch Routinganalyse die OSM-Daten, basierend auf dem Tagging-Schema mit mautbezogenen Routingparametern, wie Fahrzeug-, Achs-, Gewichtsklasse und Betreiber. Es l&#228;sst sich beispielsweise die schnellste und g&#252;nstigste Strecke, bezogen auf die zu entrichtende Stra&#223;enmaut, ermitteln und grafisch anzeigen.</abstract>
        <description>Die vorliegende Arbeit beschreibt eine Methode zur Erzeugung von mautpflichtigen Strecken anhand von Mautpunkten der Bundesanstalt f&#252;r Stra&#223;enwesen (BASt). Die Daten der BASt bez&#252;glich der Strecken werden so umgewandelt, dass sie in OpenStreetMap (OSM) abgelegt werden k&#246;nnen. Dazu wird eine einheitliche Kartierungsvorschrift vorgeschlagen und das OSM-Tagging-Schema des Datenmodells bez&#252;glich Routing und Mauterfassung angepasst.

Das in dieser Arbeit beschriebene Tool und die damit erzeugten Mautdaten erleichtern dem Nutzer die Arbeit, der h&#228;ufig den OSM-Datenbestand pr&#252;fen und erweitern m&#246;chte - dem OSM-Mapper. F&#252;r ihn validiert das Tool durch Routinganalyse die OSM-Daten basierend auf dem Tagging-Schema mit mautbezogenen Routingparametern, wie Fahrzeug-, Achs-, Gewichtsklasse und Betreiber. Die erzeugten Mautdaten helfen aber auch Nutzern, die mit Hilfe von OSM die mautbezogenen Routingparametern nur lesen wollen. Auf diese Weise l&#228;sst sich beispielsweise die schnellste und g&#252;nstigste Strecke, bezogen auf die zu entrichtende Stra&#223;enmaut, ermitteln und grafisch anzeigen.</description>
        <persons>
          <person id="447">Robert Klemm</person>
        </persons>
        <links>
          <link href="http://maut.mapwebbing.eu">Maut-Informationsportal</link>
        </links>
      </event>
      <event id="775" guid="none">
        <date>2015-03-12T11:15:00+01:00</date>
        <start>11:15</start>
        <duration>00:30</duration>
        <room>S1</room>
        <slug></slug>
        <title>Daten aus OSM extrahieren und in QGIS weiterverarbeiten </title>
        <subtitle>Am Beispiel der Verteilung von Windanlagen in Deutschland</subtitle>
        <track>Vorträge (OSM)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Die OSM-Daten enthalten viele umweltrelevante Informationen, die auf den ver&#246;ffentlichten Webkarten nicht offensichtlich erkennbar sind. Mit Hilfe von QGIS lassen sich diese Informationen auswerten und in neue aussagekr&#228;ftigen Karten umsetzen.</abstract>
        <description>Der Vortrag erl&#228;utert die Fragestellung am Beispiel der Verteilung von Windkraftanlagen in Deutschland. Angefangen vom Import der deutschlandweiten OSM-Daten in eine PostGis-Datenbank, &#252;ber die Abfrage der WKA-Standorte bis hin zur Pr&#228;sentation der Verteilung in einer farbigen Fl&#228;chendichtekarte, die aus einer interpolierten Rasteroberfl&#228;che erzeugt worden ist, welche die Anzahl der Windanlagen im Umkreis von 20km darstellt. Dabei kamen Abfrage- und Geoverarbeitungswerkzeuge aus QGIS sowie das GRASS-Modul zur Spline-Interpolation (v.surf.rst) zur Anwendung.</description>
        <persons>
          <person id="12">Claas Leiner</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="884" guid="none">
        <date>2015-03-12T11:45:00+01:00</date>
        <start>11:45</start>
        <duration>00:30</duration>
        <room>S1</room>
        <slug></slug>
        <title>taginfo und wie es die Welt sah</title>
        <subtitle></subtitle>
        <track>Vorträge (OSM)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract></abstract>
        <description>Das OpenStreetMap-Projekt organisiert seine Daten &#252;ber ein offenes Tagging-Schema. Jeder kann neue Objekte und Tags erfinden und in der OSM-Datenbank speichern. Damit man dabei nicht die &#220;bersicht verliert, gibt es taginfo, ein Webdienst, der Informationen zu Tags aus verschiedenen Quellen sammelt und darstellt. Taginfo ist f&#252;r viele Mapper inzwischen zu einem unverzichtbaren Tool geworden. Dieser Vortrag st&#246;bert in einige Ecken des Dienstes, die nicht jeder kennt und zeigt, wie taginfo bei der t&#228;glichen Arbeit helfen kann. Daneben wollen wir mit taginfo einen Blick darauf werfen, was in OpenStreetMap so alles zu finden ist.</description>
        <persons>
          <person id="2">Jochen Topf</person>
        </persons>
        <links>
          <link href="http://taginfo.openstreetmap.org/">taginfo</link>
        </links>
      </event>
      <event id="815" guid="none">
        <date>2015-03-12T12:15:00+01:00</date>
        <start>12:15</start>
        <duration>00:30</duration>
        <room>S1</room>
        <slug></slug>
        <title>Crowd-Sourced Elevation</title>
        <subtitle>DIY DEM</subtitle>
        <track>Vorträge (OSM)</track>
        <type>lecture</type>
        <language></language>
        <abstract>Dieser Vortrag zeigt einen neuen Ansatz auf, wie mit handels&#252;blichen Smartphones ein hochgenaues digitales H&#246;henmodell mit Hilfe von Crowd-Sourcing erzeugt werden kann, das sowohl hinsichtlich Aufl&#246;sung als auch Genauigkeit SRTM weit &#252;berlegen ist. Ebenso gibt es einen &#220;berblick zum Thema H&#246;henmodelle sowie Umfang, Aufl&#246;sung und Genauigkeit verschiedener Datenquellen.</abstract>
        <description>Digitale H&#246;henmodelle k&#246;nnen f&#252;r eine Vielzahl von Anwendungen im OpenStreetMap-Umfeld verwendet werden. In Renderstilen werden sie z.B. f&#252;r Schummerungen oder H&#246;henlinien verwendet. Aber auch bei
Routinganwendungen gibt es verschiedenste Gr&#252;nde, das Gel&#228;ndemodell mit zu beachten: Fahrradfahrer, Rollstuhlfahrer aber z.B. auch Energiesparen bei Elektromobilit&#228;t.

Mit SRTM steht ein genaues H&#246;henmodell mit nahezu globaler Abdeckung gemeinfrei zur Verf&#252;gung und erst k&#252;rzlich wurde auch die Version mit einer Aufl&#246;sung von einer Bogensekunde freigegeben. Aber reicht das?

Dieser Vortrag beginnt mit einem &#220;berblick zum Thema H&#246;henmodelle und beschreibt den Umfang, Aufl&#246;sung und Genauigkeit verschiedener Datenquellen. Er zeigt anhand von Experimenten und deren Auswertung, wie man mit einem handels&#252;blichen Smartphone selbst ein H&#246;henmodell erstellen kann. Kann man mit diesen Methoden mit Hilfe von Crowd-Sourcing ein umfangreiches digitales H&#246;henmodell erzeugen? Ist die zu erwartende Aufl&#246;sung als auch Genauigkeit SRTM wirklich weit &#252;berlegen? Dieser Vortrag wird es euch anhand von Experimenten und Auswertungen beantworten.</description>
        <persons>
          <person id="334">Peter Barth</person>
        </persons>
        <links>
          <link href="http://wiki.openstreetmap.org/wiki/ASTER">http://wiki.openstreetmap.org/wiki/ASTER</link>
          <link href="http://wiki.openstreetmap.org/wiki/SRTM">http://wiki.openstreetmap.org/wiki/SRTM</link>
          <link href="http://www.opendem.info/">http://www.opendem.info/</link>
        </links>
      </event>
      <event id="852" guid="none">
        <date>2015-03-12T14:30:00+01:00</date>
        <start>14:30</start>
        <duration>00:30</duration>
        <room>S1</room>
        <slug></slug>
        <title>MTSatellite</title>
        <subtitle>Echtzeit Webmapping f&#252;r Minetest-Welten oder Spiel-Spass mit GIS</subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Der Vortrag stellt die Freie Software MTSatellite vor, ein Live-Webmapping System f&#252;r das Open World/Sandbox-Spiel Minetest. Der Vortrag f&#252;hrt das System vor und gibt eine teils vertiefende &#220;bersicht &#252;ber die eingesetzen Technologien sowohl aus GIS- als auch aus Sicht eines passionierten Minetest-Spielers.</abstract>
        <description>Der Vortrag stellt die Freie Software MTSatellite [1] vor,
ein Live-Webmapping System f&#252;r das Open World/Sandbox-Spiel Minetest [2].

Minetest ist eine Freie Software Alternative zum bekannten
Spiel Minecraft. Es simuliert gro&#223;e interaktive 3D-Welten aus
Kl&#246;tzchen, in denen man seiner Kreativit&#228;t auch kooperativ mit vielen
Spielern gleichzeitig freien Lauf lassen kann.

Um einen zeitnahen &#220;berblick &#252;ber die Ver&#228;nderung in diesen Welten zu bekommen, wurde die Kartenanwendung MTSatellite geschaffen:
Man kann &#252;ber das Spiel in der simulierten Welt etwas ver&#228;ndern und hat quasi zeitgleich eine Karte im Web, die diese &#196;nderung dokumentiert.

Basierend auf einer eigens implementierten fraktal r&#228;umlich indizierten Redis/LevelDB [5] 3D-Datenbank, die als Backend an den Spiel-Server angeschlossen wird, wurde mit Hilfe einer in serverseitigen Rendering-Komponente und einem browser-seitigen Leaflet-Client [6] eine L&#246;sung erstellt, die diese Anforderung erf&#252;llt.

Zur effizienten Verarbeitung der zu analysierenden Datenmengen wurde das System in der Programmiersprache Go [7] geschrieben. Diese erleichtert die Entwicklung von skalierenden, verteilten und performanten Anwendungen sehr.

Einen Einblick in die Funktionsweise aus Anwendungssicht verschafft das Video [3].
Eine Live-Welt l&#228;sst sich unter anderen unter [4] betrachten.

Der Vortrag f&#252;hrt das System vor und gibt eine teils vertiefende &#220;bersicht &#252;ber die eingesetzen Technologien sowohl aus GIS- als auch aus Sicht eines passionierten Minetest-Spielers.</description>
        <persons>
          <person id="471">Sascha L. Teichmann</person>
        </persons>
        <links>
          <link href="https://www.youtube.com/watch?v=iYEROGPj7RI">[3]</link>
          <link href="https://github.com/google/leveldb ">[5]</link>
          <link href="https://bitbucket.org/slteichmann/mtsatellite">[1]</link>
          <link href="http://leafletjs.com/  ">[6] </link>
          <link href="http://golang.org/">[7]</link>
          <link href="http://minetest.net">[2]</link>
          <link href="http://redis.io">[5]</link>
          <link href=" http://maps.mt.sha-bang.de/">[4]</link>
        </links>
      </event>
      <event id="829" guid="none">
        <date>2015-03-12T15:00:00+01:00</date>
        <start>15:00</start>
        <duration>00:30</duration>
        <room>S1</room>
        <slug></slug>
        <title>Stra&#223;enrennen in der Innenstadt</title>
        <subtitle>SuperTuxKart-Strecken bauen mit OSM2World</subtitle>
        <track>Vorträge (OSM)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Der Gr&#252;nder des Open-Source-Projekts OSM2World erz&#228;hlt von einer weiteren spannenden Anwendungsm&#246;glichkeit des 3D-Renderers: Die Erstellung von Rennstrecken f&#252;r das Computerspiel SuperTuxKart.</abstract>
        <description>Seit es die M&#246;glichkeit gibt, 3D-Daten in OpenStreetMap zu erfassen, wird gerne auch die Verwendung in Computerspielen als Anwendungsfall genannt. Einige kommerzielle Beispiele dazu gibt es schon l&#228;nger; dass dies aber auch mit Open-Source-Tools m&#246;glich ist, wird hier mit der Erstellung von Rennstrecken f&#252;r das freie Spiel SuperTuxKart unter Beweis gestellt.

Der Vortrag beschreibt die Vorgehensweise, um die OSM-Daten einer Stadt in eine Rennstrecke zu verwandeln. Voraussetzung ist eine ausreichend gute Abdeckung der jeweiligen Region mit 3D-Attributen in OpenStreetMap. Solche Daten, insbesondere zu Geb&#228;uden und Stra&#223;en, werden von der Community zunehmend erfasst. Aus diesen Daten wird mit dem 3D-Renderer OSM2World ein realit&#228;tsnahes 3D-Modell erstellt, das optional auch mit einem Gel&#228;ndemodell erg&#228;nzt werden kann. In diesem 3D-Modell werden mit dem 3D-Modelling-Tool Blender noch einige Verbesserungen vorgenommen und der gew&#252;nschte Streckenverlauf eingezeichnet. Ein Blender-Plugin erlaubt schlie&#223;lich den Export einer fertigen Strecke f&#252;r SuperTuxKart.

Stolperfallen sind dabei unter anderem subtile Unterschiede bei der Interpretation der Daten zwischen den beteiligten Anwendungen. Auf solche technischen H&#252;rden wird dabei ebenso eingegangen wie auf neue Features in OSM2World, die diesen Anwendungsfall m&#246;glich gemacht haben.</description>
        <persons>
          <person id="144">Tobias Knerr</person>
        </persons>
        <links>
          <link href="http://osm2world.org/">http://osm2world.org/</link>
          <link href="http://supertuxkart.sourceforge.net/">http://supertuxkart.sourceforge.net/</link>
        </links>
      </event>
      <event id="864" guid="none">
        <date>2015-03-12T16:00:00+01:00</date>
        <start>16:00</start>
        <duration>00:30</duration>
        <room>S1</room>
        <slug></slug>
        <title>Prokitektura: prozedurale realistische 3D Geb&#228;ude und St&#228;dte</title>
        <subtitle></subtitle>
        <track>Vorträge (OSM)</track>
        <type>lecture</type>
        <language></language>
        <abstract>Prokitektura is ein prozedurales und iteratives Verfahren f&#252;r Schaffung architektonischer 3D Modelle. Ein Satz kleiner Funktionen auf Python wird verwendet um 3D Geb&#228;ude zu generieren. Der Vortrag zeigt wie man ein einfaches Geb&#228;ude mit Prokitektura schafft und wie man bestimmte Bebauungstypen in einer Stadt simuliert.</abstract>
        <description>Man nutzt 3D Elemente oft in heutigen GIS-Anwendugen. Aber manuelle Schaffung der 3D Geb&#228;ude ist anstrengend. Prokitektura bietet eine Alternative daf&#252;r. Prokitektura is ein prozedurales und iteratives Verfahren f&#252;r Schaffung architektonischer 3D Modelle.

Ein Satz kleiner Funktionen auf Python wird verwendet um 3D Geb&#228;ude zu generieren. Eine solche Funktion nennt man Regel. Jede nachfolgende Regel verfeinert das Modell und erg&#228;nzt es mit zus&#228;tzlichen Details. Zur Zeit ist Prokitektura als ein Add-on f&#252;r Open Source 3D Plattform Blender realisiert.

Hier ist eine kurze Beschreibung wie man ein einfaches 3D Geb&#228;ude mit Prokitektura schafft. Man startet mit einem Geb&#228;udeumriss den man aus einem &#252;blichen GIS-Format wie OSM, GeoJSON importieren kann. Eine Extrusion mit passender H&#246;he wird erzeugt. Das extrudierte 3D Objekt wird in eine Anzahl der senkrechten Rechtecke und das obere Vieleck dekomposiert. Jedes senkrechte Rechteck entspricht einer Geb&#228;udefassade die in Stockwerke aufgeteilt wird. Aus dem oberen Vieleck wird ein Dach erstellt. Jede Etage wird in Sektionen mit Fenstern aufgeteilt. Jede Sektion kann weiter verfeinert werden. Am Ende wird das 3D Modell ins gew&#252;nschte Format exportiert.

Um einen bestimmten Bebauungstyp in einer Stadt zu simulieren, &#228;ndert man gewisse Gr&#246;&#223;en in jedem Geb&#228;ude zuf&#228;llig und verwendet stochastische Verfahren um eine Variante aus mehreren Geb&#228;udeteilen auszuw&#228;hlen.</description>
        <persons>
          <person id="249">Vladimir Elistratov</person>
        </persons>
        <links>
          <link href="https://github.com/vvoovv/prokitektura-blender">Source Code und Tutorial f&#252;r Prokitektura</link>
          <link href="https://github.com/vvoovv/prokitektura-blender">Webseite des Projekts</link>
        </links>
      </event>
      <event id="889" guid="none">
        <date>2015-03-12T16:30:00+01:00</date>
        <start>16:30</start>
        <duration>00:30</duration>
        <room>S1</room>
        <slug></slug>
        <title>Die neue WebGL-basierte Plattform f&#252;r OSM-3D</title>
        <subtitle></subtitle>
        <track>Vorträge (OSM)</track>
        <type>lecture</type>
        <language></language>
        <abstract>In diesem Vortrag wird die technische Archtektur, das Funktiondesign und die Implementierung der neue WebGL-basierte Plattform von OSM-3D pr&#228;sentiert. Der Detailreichtum im OpenStreetMap (OSM) Projekt w&#228;chst stetig. Besonders in urbanen R&#228;umen werden zunehmend Geb&#228;ude und weitere Objekte wie Stra&#223;enm&#246;bel aufgenommen. Daraus k&#246;nnen interaktive Visualisierungen der 3D Stadtmodelle und 3D Gel&#228;ndemodelle erstellt werden. Das neue Interface f&#252;r interaktive Erfassungen von Dach- und Fassadenstrukturen wird vorgestellt und mit Beispielen demonstriert. Diskussion von Vorschl&#228;gen zur Verbesserungen der neuen Plattform sind erw&#252;nscht. </abstract>
        <description>In den letzten Jahren hat sich &#8222;Volunteered Geographic Information&#8220; (VGI) rasch entwickelt. Der Detailreichtum im OpenStreetMap (OSM) Projekt w&#228;chst stetig. Besonders in urbanen R&#228;umen werden zunehmend Geb&#228;ude und weitere Objekte wie Stra&#223;enm&#246;bel aufgenommen. Die neueste Statistik zeigt, dass es bis zum 25.11.2014 &#252;ber 200 Millionen Geb&#228;udegrundrisse in OSM gab. Davon ist Deutschland mit 18107565 Geb&#228;udegrundrissen weltweit das meisten gezeichnet Land hinsichtlich des Geb&#228;udes. Seit einigen Jahren, entstehen einige Projekte wie z.B. OSM2World, Kendzi3D, F4map, OSM-3D, die 3D-Stadt- und Landschaftsmodelle aus OSM-Daten erstellen. Daf&#252;r werden haupts&#228;chlich die Geb&#228;udegrundrisse extrudiert. Des Weiteren werden vereinzelte 3D-bezogene Informationen genutzt, die in OSM bereits vorliegen, z. B. Geb&#228;udeh&#246;hen, Dachtypen, usw. 
OSM-3D stellt die kreierten Modelle standardisiert als Web 3D Service zur Verf&#252;gung. Eine Client-Software wie z. B. der XNavigator setzt die einzelnen W3DS-Szenen zu einem vollst&#228;ndigen 3D-Globus zusammen. Die Visualisierung und Interoperabilit&#228;t mit 3D Stadtmodellen in Web Browser ist leider nur mit Hilfe ein Java PlugIn erst realisierbar. Dies muss st&#228;ndig Fortf&#252;hrungen wegen Update von Java gefordert werden. Dar&#252;ber hinaus ist PlugIn Technology aus vielen Gr&#252;nden nicht mehr die Tendenz der Zukunft. 
Aus dem oben genannten Grund, wird eine neue WebGL-basierte Plattform  f&#252;r OSM-3D an der Universit&#228;t Heidelberg entwickelt. Die neue Plattform verwendet JavaScript-Bibliothek &#8222;Cesium&#8220;, die WebGL nutzt und so plattformunabh&#228;ngige Visualisierungen mit Hardwarebeschleunigung erlaubt. Die s&#228;mtliche Funktionen von Xnavigator werden nach der neuen Plattform &#8222;&#252;bertragen und umgesetzt&#8220;. D.h. f&#252;r die neue WebGL-basierte Plattform werden gleiche Funktionen wie beim Xnavigator entwickelt. Diese passieren an die Client-seite. An die Server-Seite werden die vorhandenen Ans&#228;tze zur Geb&#228;udengenerierung, Datenbankstrukturen, sowie W3DS weiter verwendet. Allerdings werden diese Ans&#228;tze nach Anf&#246;rderungen der neuen Plattform zur effiziente interaktive Visualisierung und Editierung ver&#228;ndert. Au&#223;erdem werden auch neue Ans&#228;tze entwickelt. 
In dieser Arbeit wird die technische Archtekturen, Funktiondesign, und Implementierung der neue WebGL-basierte Plattform von OSM-3D vorgestellt. Zweitens werden die interaktive Visualisierungen der 3D Stadtmodelle und 3D Gel&#228;ndemodelle demonstriert. Neue Interface f&#252;r interaktive Erfassungen von Dach- und Fassadenstrukturen wird vorgestellt und mit Beispielen demonstriert. Schlie&#223;lich werden einige Vorschl&#228;ge zur Verbesserungen der neue Plattform diskutiert. </description>
        <persons>
          <person id="481">Hongchao</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="896" guid="none">
        <date>2015-03-12T17:00:00+01:00</date>
        <start>17:00</start>
        <duration>00:30</duration>
        <room>S1</room>
        <slug></slug>
        <title>OSM Lightning Talks</title>
        <subtitle></subtitle>
        <track>Lightning Talks (OSM)</track>
        <type>lightning</type>
        <language></language>
        <abstract></abstract>
        <description></description>
        <persons>
        </persons>
        <links>
        </links>
      </event>
      <event id="790" guid="none">
        <date>2015-03-12T17:30:00+01:00</date>
        <start>17:30</start>
        <duration>01:00</duration>
        <room>S1</room>
        <slug></slug>
        <title>PostNAS Anwendertreffen</title>
        <subtitle>Projekt rund um den Import von ALKIS Daten &#252;ber OGR</subtitle>
        <track></track>
        <type>user_meeting</type>
        <language></language>
        <abstract>Auf der FOSSGIS 2015 wird es ein PostNAS Anwendertreffen geben, auf dem aktuelle Entwicklungen im PostNAS-Projekt vorgestellt werden sollen.
</abstract>
        <description></description>
        <persons>
          <person id="65">Astrid Emde</person>
          <person id="70">Olaf Knopp</person>
        </persons>
        <links>
          <link href="http://postnas.org/">http://postnas.org/</link>
          <link href="http://trac.wheregroup.com/PostNAS/wiki/PostNASAnwendertreffen2015-03-12">Protokoll PostNAS Anwendertreffen</link>
        </links>
      </event>
    </room>
    <room name="StudLab 1">
      <event id="893" guid="none">
        <date>2015-03-12T09:00:00+01:00</date>
        <start>09:00</start>
        <duration>01:30</duration>
        <room>StudLab 1</room>
        <slug></slug>
        <title>Workshop: Metadaten Bereitstellung in INSPIRE konformen GDI</title>
        <subtitle></subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language></language>
        <abstract>Metadatenerfassungstool mit M&#246;glichkeiten der Anpassung an den Anwender (INSPIRE, GDI oder eigene Anforderungen an Metadaten).</abstract>
        <description>Mit Metador bietet die WhereGroup eine OpenSource L&#246;sung zur Erfassung von
Metadaten an. Ein Ziel des Editors ist es, sich an die Metadatenprofile der
Anwender anzupassen, sei es aus Vorgaben von INSPIRE und GDI-DE oder aus
eigenen Anforderungen. Dabei m&#252;ssen nicht alle aufgenommenen Informationen
auch in das resultierende XML &#252;berf&#252;hrt werden, sondern k&#246;nnen auch f&#252;r
interne Zwecke genutzt werden. Der Editor soll damit die m&#246;glichst einfache
Aufnahme von Metadaten erm&#246;glichen.

Metador kann um einen CSW Broker wie Geonetwork erweitert werden, der die
Daten aus Metador &#252;ber eine CSW Schnittstelle nach au&#223;en anbietet.

Dieser Workshop behandelt die M&#246;glichkeiten der Anpassung an der Oberfl&#228;che,
die Aufnahme und den Export von Metadaten und die Einbindung in Geonetwork
und den Bezug zu INSPIRE konformen GDI. Dies geschieht an exemplarischen
Beispielen.

Eine Beispielanwendung ist unter http://metador.wheregroup.com/ verf&#252;gbar.</description>
        <persons>
          <person id="468">Axel Schaefer</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="791" guid="none">
        <date>2015-03-12T11:15:00+01:00</date>
        <start>11:15</start>
        <duration>01:30</duration>
        <room>StudLab 1</room>
        <slug></slug>
        <title>Mapbender3 Workshop</title>
        <subtitle>Aufbau und Konfiguration einer WebGIS Anwendung mit Mapbender3</subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language>de</language>
        <abstract>Der Workshop soll den Teilnehmern einen ersten Einstieg in die Erstellung von Kartenanwendungen auf Basis von Mapbender3 geben. Neben einem &#220;berblick &#252;ber die Architektur auf Basis von Symfony2 und OpenLayers und der Vorstellung des Frontends mit seinen Komponenten wird die Verwendung des Backends zur Verwaltung von Anwendungen im Mittelpunkt stehen.</abstract>
        <description>Der Workshop soll den Teilnehmern einen ersten Einstieg in die Erstellung von Kartenanwendungen auf Basis von Mapbender3 geben. Neben einem &#220;berblick &#252;ber die Architektur auf Basis von Symfony2 und OpenLayers und der Vorstellung des Frontends mit seinen Komponenten wird die Verwendung des Backends zur Verwaltung von Anwendungen im Mittelpunkt stehen.

Dabei werden die M&#246;glichkeiten des Aufbaus von eigenen Anwendungen &#252;ber das Administrations-Backend erl&#228;utert. Der Aufbau eines Dienste-Repositories wird vorgestellt. Es werden Benutzer und Gruppen angelegt. Au&#223;erdem erfolgt ein Einstieg in die Rechteverwaltung.

Inhalt des Workshops:

* Vorstellung der Anwendung 
* Vorstellung des Administration-Backends
* Erstellung einer Applikation (Kartenanwendung) inkl. Berechtigungen
* Aufbau eines Dienste-Repositories
* Einrichten von Benutzern und Gruppen sowie Rechteverwaltung

</description>
        <persons>
          <person id="119">Toni Pignataro</person>
        </persons>
        <links>
          <link href="http://mapbender3.org">http://mapbender3.org</link>
          <link href="http://www.wheregroup.com/de/fossgis_2015">Mapbender3 Workshop - Folien und WMS Liste</link>
        </links>
      </event>
      <event id="823" guid="none">
        <date>2015-03-12T14:00:00+01:00</date>
        <start>14:00</start>
        <duration>01:30</duration>
        <room>StudLab 1</room>
        <slug></slug>
        <title>MapServer Pro-Tipps</title>
        <subtitle>Das 'Do what I want' Know How f&#252;r den UMN MapServer</subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language></language>
        <abstract>Der Workshop ist die Erg&#228;nzung zum gleichnamigen Vortrag. &#220;ber das Basiswissen hinaus gehende Funktionen des MapServers, wie PHP-Fassaden, JOINs mit Datei basierten Datenquellen, ColorRanges, Buildt-In Openlayers-Client, Cluster von Punktobjekten werden im Workshop behandelt.</abstract>
        <description>Dieser Workshop bietet die M&#246;glichkeit die Tipps des gleichnamigen Vortrags direkt in die Tat umzusetzen.

MapServer ist bekannt f&#252;r seine Zuverl&#228;ssigkeit, Performance und Stabilit&#228;t. Gerne wird aber auch &#252;ber die Konfiguration mit den Mapfiles gest&#246;hnt. Dabei bietet gerade diese Art der Konfiguration M&#246;glichkeiten, die tief in der Dokumentation versteckt sind und die bei kniffligen Augaben wirklich hilfreich sein k&#246;nnen. Die meisten Anwender kennen nur die Basis-Konfigurationen, aber wer wei&#223; schon dass es einen eingebauten OpenLayers-Client gibt, der es erm&#246;gicht nur mit einem Mapfile eine interakive Karte zu ver&#246;ffentlichen, wie man Linien mit Pfeilspitzen versieht, Geometrien gl&#228;ttet oder den Zugriff auf MapServer-WMS direkt im Mapfile auf bestimmte IP-Adressen beschr&#228;nken kann? Mit einfachen PHP (oder anderen) Scripten er&#246;ffnen sich dar&#252;ber hinaus vielf&#228;ltige M&#246;glichkeiten, den MapServer um weitere Funktionen zu erweiteren oder sogar auszutricksen.

Themen:
* zwischen cgi und MapScript: PHP-Fassaden
* JOINs mit Datei basierten Datenquellen
* Schnelle Klassifizierung mit Color Ranges
* Cluster von Punktobjekten bilden
* Sch&#246;nere Karten Dank Geomtransform (Richtungssymbole, shapesmothing,..)
* Buildt-In Openlayers-Client
* Zugriffsbeschr&#228;nkung &#252;ber Client-IPs
</description>
        <persons>
          <person id="378">J&#246;rg Thomsen</person>
          <person id="119">Toni Pignataro</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="875" guid="none">
        <date>2015-03-12T16:00:00+01:00</date>
        <start>16:00</start>
        <duration>01:30</duration>
        <room>StudLab 1</room>
        <slug></slug>
        <title>pgRouting Workshop</title>
        <subtitle>FOSS4G Routing mit pgRouting, OSM Daten und OL3 </subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language>de</language>
        <abstract>pgRouting erweitert eine PostGIS/PostgreSQL Geo-Datenbank um Funktionen f&#252;r &#8220;K&#252;rzeste-Wege&#8221; Berechnung und andere netzorientierte Algorithmen. Dieser Workshop gibt eine Einfuehrung in pgRouting, im Zusammenspiel mit OSM Daten und OpenLayers 3.</abstract>
        <description>pgRouting erweitert eine PostGIS/PostgreSQL Geo-Datenbank um Routing-Funktionen, und dieser Einf&#252;hrungs-Workshop zeigt Ihnen, wie. Anhand eines praktischen Beispiels lernen Sie, wie man pgRouting zusammen mit OpenStreetMap Stra&#223;ennetzdaten verwenden kann. Der Workshop erkl&#228;rt die Schritte, um die Daten vorzubereiten, Routing-Anfragen zu erstellen und geeignete Kosten zuzuweisen. Sie schreiben eine benutzerdefinierte Funktion in 'plpgsql', die die Verwendung von pgRouting in Kombination mit Geoserver und Openlayers 3 erlaubt, um die k&#252;rzeste Route in einer Web-Mapping-Anwendung anzuzeigen.

Voraussetzungen:

* Workshop Niveau: Fortgeschritten
* N&#252;tzliches Vorwissen: SQL (PostgreSQL, PostGIS), Javascript, HTML
* Infrastruktur: Dieser Workshop nutzt OSGeo Live</description>
        <persons>
          <person id="466">Daniel Kastl</person>
        </persons>
        <links>
          <link href="http://pgrouting.org">http://pgrouting.org</link>
          <link href="http://workshop.pgrouting.org">http://workshop.pgrouting.org</link>
        </links>
      </event>
    </room>
    <room name="StudLab 2">
      <event id="872" guid="none">
        <date>2015-03-12T09:00:00+01:00</date>
        <start>09:00</start>
        <duration>01:30</duration>
        <room>StudLab 2</room>
        <slug></slug>
        <title>PostGIS f&#252;r Einsteiger</title>
        <subtitle>Einf&#252;hrung in die Verwaltung von Geodaten in der PostgreSQL Datenbank mit PostGIS</subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language>de</language>
        <abstract>Dieser Workshop erm&#246;glicht Einsteigern den Zugang zu PostgreSQL/PostGIS und hilft bei den ersten Schritten im Umgang mit r&#228;umlichen Daten in der Datenbank. Datenarten, Datenmodell, Visualisierung, Datenimport, Schnittstellen und SQL werden behandelt.   </abstract>
        <description>Dieser Workshop soll Einsteigern den Zugang zu PostgreSQL/PostGIS erm&#246;glichen und bei den ersten Schritten im Umgang mit r&#228;umlichen Daten in der Datenbank helfen.

* Einf&#252;hrung PostgreSQL / PostGIS - Vorstellung der M&#246;glichkeiten (Vektordaten, Rasterdaten)
* Erkl&#228;rung des Datenmodells
* Visualisierung von Daten mit QGIS
* Datenimport &#252;ber QGIS DB Manager und shp2pgsql
* Aufzeigen der M&#246;glichkeiten anhand von einfachen SQLs
* Schnittstellen</description>
        <persons>
          <person id="65">Astrid Emde</person>
          <person id="31">Harald Schwenk</person>
        </persons>
        <links>
          <link href="https://github.com/astroidex/presentations/tree/master/FOSSGIS2015/PostGIS_fuer_Einsteiger">PostGIS Pr&#228;sentation und SQLs</link>
          <link href="http://download.geofabrik.de/europe/germany/nordrhein-westfalen/muenster-regbez-latest.shp.zip">OSM Daten Regierungsbezirk M&#252;nster</link>
        </links>
      </event>
      <event id="782" guid="none">
        <date>2015-03-12T11:15:00+01:00</date>
        <start>11:15</start>
        <duration>01:30</duration>
        <room>StudLab 2</room>
        <slug></slug>
        <title>QGIS Workshop</title>
        <subtitle>Eine Einf&#252;hrung in die Software</subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language>de</language>
        <abstract>Der Workshop gibt einen &#220;berblick &#252;ber die Funktionalit&#228;ten von QGIS und vermittelt anhand eines praktischen Workflows, wie man auf einfache Art und Weise ein Projekt aufbaut, Analysen durchf&#252;hrt und eine ansprechende Karte erzeugt. Es geht um Funktionalit&#228;ten, Projektaufbau, Projektionen, Plugins, Datenanalyse, Visualisierung und Layout. </abstract>
        <description>Der Workshop gibt einen &#220;berblick &#252;ber die Funktionalit&#228;ten von QGIS und vermittelt anhand eines praktischen Workflows, wie man auf einfache Art und Weise ein Projekt aufbaut, Analysen durchf&#252;hrt und eine ansprechende Karte erzeugt.

- Einf&#252;hrung in QGIS Funktionalit&#228;t und GUI
- Aufbau eines Projektes
- Umgang mit dem Thema Projektionen
- Visualisieren und Analysieren von Vektor- und Rasterdaten
- Attributmanagement und Digitalisierfunktionen
- Arbeiten mit Plugins
- Layouten einer druckfertigen Karte

</description>
        <persons>
          <person id="9">Otto Dassau</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="776" guid="none">
        <date>2015-03-12T14:00:00+01:00</date>
        <start>14:00</start>
        <duration>01:30</duration>
        <room>StudLab 2</room>
        <slug></slug>
        <title>Projektionsmanagement mit QGIS</title>
        <subtitle>Pr&#228;zises umprojizieren auch ganzer Verzeichnisse mit QGIS</subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language>de</language>
        <abstract>Im Workshop lernen die Teilnehmer/innen, wie Sie ihre Geodaten auch unter Anwendung landesspezifischer Transformationsans&#228;tze mit QGIS pr&#228;zise von einen Koordinatenbezugssystems ins andere &#252;berf&#252;hren. M&#246;glichkeiten der Stapelverarveitung ganzer Verzeichnisse von Raster- und Vektordaten sowie Schritte zum &#228;ndern verschiedener Konfigurationsdateien, um landessepzifische Transformationsans&#228;tze einzubinden, werden behandelt.</abstract>
        <description>Das Umprojizieren einzelner Datens&#228;tze mit QGIS ist einfach umzusetzen. Wenn ganze Verzeichnisse zu transformieren sind und eine Genauigkeit im cm-Bereich erforderlich, ist intensivere Auseinandersetzung mit der Materie n&#246;tig. NtV2-Grids sind an die richtigen Verzeichnisse zu kopieren und verschiedene Konnfigurationsdateien und SQlite-Datenbanken m&#252;ssen editiert werden.
Im Workshop lernen die Teilnehmer/innen, wie Sie ihre Geodaten auch unter Anwendung landesspezifischer Transformationsans&#228;tze mit QGIS, cm-genau von einen Koordinatenbezugssystems ins andere &#252;berf&#252;hren. Auch die Stapelverarveitung ganzer Verzeichnisse von Raster- und Vektordaten wird behandelt. Die Teilnehmer/innen erfahren, wie sie verschiedene Konfigurationsdateien &#228;ndern m&#252;ssen, um landessepzifische Transformationsans&#228;tze einzubinden.
Der Kurs wendet sich an Leute, die mit der grundlegenden Bedienung von QGIS oder zumindestens von vergleichbaren GIS-Programmen vertraut sind.
Der Workshop sollte in einem Computerpool stattfinden, damit eine einheitliche Softwareumgebung zur Verf&#252;gung steht.</description>
        <persons>
          <person id="12">Claas Leiner</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="844" guid="none">
        <date>2015-03-12T16:00:00+01:00</date>
        <start>16:00</start>
        <duration>01:30</duration>
        <room>StudLab 2</room>
        <slug></slug>
        <title>QGIS-Server</title>
        <subtitle>Einf&#252;hrung in die Installation und Konfiguration</subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language>de</language>
        <abstract>QGIS-Server ist ein leistungsf&#228;higer WMS und WFS-Server, der keine aufw&#228;ndige Konfiguration der Karten ben&#246;tigt. Ein QGIS-Desktop-Projekt wird auf den Server kopiert und damit kann jeder Layer des Projektes als WMS/WFS-Layer angesprochen werden.
</abstract>
        <description>Der Workshop f&#252;hrt in die Installation und Konfiguration von QGIS Server ein und stellt die QGIS-Server-Erweiterungen des WMS-Standards vor.
Ziel ist die Herstellung eines lauff&#228;higen WMS/WFS-Servers auf den Rechnern der Teilnehmer.
Voraussetzung: Grundkenntnisse QGIS (Desktop), Verst&#228;ndnis der OGC-Standards WMS/WFS
Ort: PC-Pool mit OSEO live</description>
        <persons>
          <person id="79">Andreas Neumann</person>
          <person id="299">Bernhard Str&#246;bl</person>
        </persons>
        <links>
        </links>
      </event>
    </room>
    <room name="StudLab 3">
      <event id="870" guid="none">
        <date>2015-03-12T09:00:00+01:00</date>
        <start>09:00</start>
        <duration>01:30</duration>
        <room>StudLab 3</room>
        <slug></slug>
        <title>Einf&#252;hrung in die Geodatenverarbeitung mit Python</title>
        <subtitle></subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language></language>
        <abstract>Ziel dieses Kurses ist es einen &#220;berblick &#252;ber die vorhandenen Geo-Bibliotheken f&#252;r Python zu geben und an einfachen Beispielen erste kleine Skripte f&#252;r allt&#228;gliche Aufgaben aus dem Bereich der Geodatenverarbeitung zu erstellen. </abstract>
        <description>Python wird immer beliebter als Programmiersprache im GIS-Umfeld. Dies liegt zum einem an der geringen Lernkurve f&#252;r Python v.a. f&#252;r Programmieranf&#228;nger, zum anderen an der inzwischen kaum mehr zu &#252;berschauenden Vielfalt an Bibliotheken f&#252;r den Bereich der Geodatenverarbeitung. Neben APIs f&#252;r Grass GIS, QGIS, ArcGIS und vielen anderen Desktop GIS Systemen, gibt es eine Vielzahl von Standalone Bibliotheken, mit denen sich vielf&#228;ltige Aufgaben aus der Geodatenverarbeitung mit Python auf einfache Weise automatisieren lassen.
Ziel dieses Kurses ist es einen &#220;berblick &#252;ber die vorhandenen Geo-Bibliotheken f&#252;r Python (z.B. GDAL/OGR, shapely, fiona, rasterio, geojson, pyproj, pyshp, basemap, cartopy, ...) zu geben und an einfachen Beispielen erste kleine Skripte f&#252;r allt&#228;gliche Aufgaben aus dem Bereich der Geodatenverarbeitung zu erstellen. Die Beispiele sollen &#252;berwiegend der Einf&#252;hrung in die vorgestellten Bibliotheken dienen und k&#246;nnen mit wenigen Zeilen in iPython / iPython Notebook ausgef&#252;hrt werden. Der Kurs behandelt sowohl eine Einf&#252;hrung in die Verarbeitung von Vektordaten als auch die Verarbeitung von Rasterdaten. Die Teilnehmer werden am Ende des Kurses grundlegende Funktionen kennen, um z.B. Shapedateien und Rasterdateien in Python einzulesen, zu verarbeiten und wieder abzuspeichern. Sie bekommen einen &#220;berblick &#252;ber verschiedene Bibliotheken und wissen wie sie diese verwenden k&#246;nnen.

Vorkenntnisse: Grundlegende Kenntnisse in Python w&#228;ren von Vorteil, sind nicht zwingend notwendig

Austragung des Workshops: OSGeo Live DVD: Computerpool oder mitgebrachte Laptops</description>
        <persons>
          <person id="238">Christian Strobl</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="787" guid="none">
        <date>2015-03-12T11:15:00+01:00</date>
        <start>11:15</start>
        <duration>01:30</duration>
        <room>StudLab 3</room>
        <slug></slug>
        <title>Datenmodellierung mit PostgreSQL/PostGIS f&#252;r QGIS</title>
        <subtitle>Einf&#252;hrung in die Datenmodellierung in einer relationalen Datenbank</subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language>de</language>
        <abstract>Der Workshop soll die Teilnehmer in die Lage versetzen, ihre Datenhaltung nach PostgreSQL/PostGIS zu &#252;bertragen und daf&#252;r Datenmodelle zu entwerfen. Besonderes Augenmerk wird auf geeignete Datentypen und das Verst&#228;ndnis von Relationen gelegt. Das QGIS-Plugin DataDrivenInputMask erzeugt Eingabemasken f&#252;r deratige PostgreSQL-Layer zur Laufzeit.
</abstract>
        <description>In relationalen Datenbanken k&#246;nnen komplexe Sachverhalte konsistent und redundanzfrei gespeichert werden. Da sie auch Geometrien speichern k&#246;nnen, bieten sie sich als zentrale Datenspeicher f&#252;r Geodateninfrastrukturen an. Wird in PostgreSQL ein entsprechendes Datenmodell definiert, kann das QGIS-Plugin DataDrivenInputMask daraus Eingabemasken f&#252;r PostgreSQL-Layer zur Laufzeit erzeugen.
Der Workshop soll die Teilnehmer in die Lage versetzen, ihre bisherige Datenhaltung aus Dateien in eine relationale Datenbank zu &#252;bertragen und daf&#252;r Datenmodelle zu entwerfen. Besonderes Augenmerk wird auf geeignete Datentypen und das Verst&#228;ndnis von Relationen gelegt. Es wird gezeigt, wie Constraints sinnvoll definiert werden. Anhand eines Beispiels werden alle n&#246;tigen Schritte vorgef&#252;hrt und das Ergebnis laufend in QGIS visualisiert. Die Teilnehmer vollziehen die gezeigten Schritte am Rechner nach, es sind aber keine &#220;bungen enthalten. Im Vordergrund steht vielmehr das Verst&#228;ndnis f&#252;r die Datenmodellierung. Fragen der Teilnehmer werden jederzeit beantwortet, wobei keine individuelle Beratung angeboten werden kann. Das Abfragen der Datenbank ist NICHT Bestandteil dieses Workshops.
Inhalte: Normalisierung, Tabellen, Indizes, Fremdschl&#252;ssel, QGIS-Plugin DataDrivenInputMask
Lernziele: Nutzung unterschiedlicher Datentypen, Verst&#228;ndnis von Relationen, Definition von Fremdschl&#252;sseln
Vorkenntnisse: Grundkenntnisse QGIS, Grundkenntnisse relationaler Datenbanken
Ort: Computerpool mit OSGeoLive</description>
        <persons>
          <person id="299">Bernhard Str&#246;bl</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="837" guid="none">
        <date>2015-03-12T14:00:00+01:00</date>
        <start>14:00</start>
        <duration>01:30</duration>
        <room>StudLab 3</room>
        <slug></slug>
        <title>Einf&#252;hrungsworkshop OpenLayers 3</title>
        <subtitle>Erste Schritte mit OpenLayers 3</subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language>de</language>
        <abstract>Zielgruppe sind alle an Webkartographie interessierten, die OpenLayers 3 kennen lernen wollen. Auch Teilnehmer, die OpenLayers bereits einsetzen, k&#246;nnen von einem Besuch profitieren. Wenn Sie absch&#228;tzen m&#246;chten, ob OpenLayers Ihnen bei Ihrer Fragestellung helfen kann, kann der Workshop sicherlich erste Antworten liefern.</abstract>
        <description>OpenLayers 3 (der Nachfolger des weitverbreiteten OpenLayers 2) liegt seit Ende August 2014 in der Version 3.0.0 vor und der Workshop soll den Teilnehmern die neue Version n&#228;her bringen.

Im Workshop, der von zwei Kernentwicklern des Projektes gehalten wird, werden die Teilnehmer selbst mit OpenLayers 3 entwickeln. Im Einzelnen werden wir uns folgende Aspekte erarbeiten:

  * Download der Bibliothek
  * Meine erste ol3-Karte
  * Map, View, Source und Layer
  * Layer aus unterschiedlichen Datenquellen
  * Controls und Interaktionen
  * Integration mit JavaScript UI Libraries

Zielgruppe sind alle an Webkartographie interessierten, die OpenLayers 3 kennen lernen wollen. Auch Teilnehmer, die OpenLayers bereits einsetzen, k&#246;nnen von einem Besuch profitieren. Wenn Sie absch&#228;tzen m&#246;chten, ob OpenLayers Ihnen bei Ihrer Fragestellung helfen kann, kann der Workshop sicherlich erste Antworten liefern.
Vorwissen: Grunds&#228;tzliche Kenntnisse von JavaScript sind n&#252;tzlich, werden aber nicht zwingend vorausgesetzt.</description>
        <persons>
          <person id="34">Marc Jansen</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="891" guid="none">
        <date>2015-03-12T16:00:00+01:00</date>
        <start>16:00</start>
        <duration>01:30</duration>
        <room>StudLab 3</room>
        <slug></slug>
        <title>Analyse r&#228;umlicher Daten mit GRASS GIS 7</title>
        <subtitle></subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language></language>
        <abstract>Workshop zu den neuen Funktionen in GRASS GIS 7, ein freies und open source Geographisches Informationssystem (GIS) f&#252;r Geodatenmanagement und -analyse, r&#228;umliche Modellierung und Visualisierung, Bildverarbeitung, und Kartenerstellung. Inhalt des Workshops ist, die analytischen F&#228;higkeiten von GRASS GIS anhand der neuen grafischen Benutzeroberfl&#228;che (Raster- und topologische Vektordatenanalyse, LiDAR-Datenverarbeitung) in einfachen, praktischen Schritten zu lernen.</abstract>
        <description>In diesem Workshop zeigen wir die neuen Funktionen in GRASS GIS 7 (http://grass.osgeo.org/grass7/). In einfachen, praktischen Schritten erlernen die Teilnehmer die analytischen F&#228;higkeiten von GRASS GIS anhand der neuen grafischen Benutzeroberfl&#228;che. Es werden Raster- und topologische Vektordatenanalyse gezeigt und auch einfache LiDAR-Datenverarbeitung erl&#228;utert. Am Schluss der Sitzung gibt es eine Kurz&#252;bersicht zu den Neuigkeiten der Version 7 (http://trac.osgeo.org/grass/wiki/Grass7/NewFeatures).

GRASS GIS 7 ist ein freies und open source Geographisches Informationssystem (GIS) f&#252;r Geodatenmanagement und -analyse, r&#228;umliche Modellierung und Visualisierung, Bildverarbeitung, und Kartenerstellung, das auf MS-Windows, Mac OSX, Linux und auch Supercomputern l&#228;uft.
</description>
        <persons>
          <person id="262">Markus Neteler</person>
          <person id="9">Otto Dassau</person>
        </persons>
        <links>
          <link href="http://grass.osgeo.org/">GRASS GIS Website</link>
          <link href="http://trac.osgeo.org/grass/wiki/Grass7/NewFeatures">Neue Features</link>
        </links>
      </event>
    </room>
  </day>
  <day index="3" start="3" end="3" date="2015-03-13">
    <room name="Aula">
      <event id="900" guid="none">
        <date>2015-03-13T12:30:00+01:00</date>
        <start>12:30</start>
        <duration>01:00</duration>
        <room>Aula</room>
        <slug></slug>
        <title>Abschlu&#223;veranstaltung</title>
        <subtitle></subtitle>
        <track>Vorträge (GIS)</track>
        <type>other</type>
        <language>de</language>
        <abstract>Die Abschlussveranstaltung der FOSSGIS-Konferenz 2015 blickt auf die gelaufene Konferenz und auf die n&#228;chste. Wir d&#252;rfen alle gespannt sein. In diesem Rahmen findet auch die Verlosung statt, an der alle teilnehmen, die den Teilnehmerfeedbackbogen ausgef&#252;llt haben.</abstract>
        <description></description>
        <persons>
          <person id="487">Gilberto Camara</person>
          <person id="135">Marco Lechner</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="907" guid="none">
        <date>2015-03-13T13:30:00+01:00</date>
        <start>13:30</start>
        <duration>01:00</duration>
        <room>Aula</room>
        <slug></slug>
        <title>Sektempfang</title>
        <subtitle></subtitle>
        <track></track>
        <type>other</type>
        <language>de</language>
        <abstract>Sektempfang am FOSSGIS-Stand zum Ausklang der Konferenz. Der FOSSGIS e.V. - Veranstalter der Konferenz - gibt einen Sektempfang. Mitglieder des Vereins, Freunde und Interessierte sind herzlich eingeladen.</abstract>
        <description></description>
        <persons>
          <person id="65">Astrid Emde</person>
          <person id="445">Katja Haferkorn</person>
        </persons>
        <links>
        </links>
      </event>
    </room>
    <room name="S10">
      <event id="800" guid="none">
        <date>2015-03-13T08:45:00+01:00</date>
        <start>08:45</start>
        <duration>00:30</duration>
        <room>S10</room>
        <slug></slug>
        <title>&#214;ffentliche Projekte und Open Source</title>
        <subtitle>Open Source Software in der &#246;ffentlichen Verwaltung am Beispiel der GDI-DE Testsuite</subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract>Anhand der GDI-DE Testsuite wird dargestellt, wie die GDI-DE die Strukturen von Open Source Projekten, wie sie u.a. durch die OSGeo beschrieben werden, in Ihren Komponenten verwendet. Betriebsstelle GDI-DE im Bundesamt f&#252;r Kartographie und Geod&#228;sie (BKG) wurde als Schnittstelle zwischen der fachlichen und der technischen Umsetzung geschaffen. Der Vortrag bietet einen Einblick in die t&#228;gliche Arbeit der Betriebsstelle. Die Ziele sowie die H&#252;rden im t&#228;glichen Betrieb werden vorgestellt.</abstract>
        <description>Im Rahmen der europ&#228;ischen Richtlinie INSPIRE betreibt die Geodateninfrastruktur Deutschland (GDI-DE) vier zentrale Komponenten, die verschiedene Servicefunktionen, wie die Geodatenrecherche, die &#220;berpr&#252;fung der Konformit&#228;t von Geodaten und Geodatendiensten anbieten. Bei der Entwicklung dieser Komponenten wurden explizit auf den Einsatz von Open Source Software sowie die Lizensierung der entstehenden Produkte als Open Source Software gesetzt. Doch was bedeutet das genau? Welche Ziele werden damit verfolgt? Sollen nur Kosten eingespart werden oder steckt noch mehr dahinter? Und welche Auswirkungen hat diese Entscheidung auf den t&#228;glichen Betrieb?
Anhand der Komponente GDI-DE Testsuite soll verdeutlicht werden, wie die GDI-DE die Strukturen von Open Source Projekten, wie sie z.B. durch die Open Source Geospatial Foundation (OSGeo) beschrieben werden, nutzt, um die &#214;ffentlichkeit &#252;ber den aktuellen Stand der Entwicklungen zu informieren, dem Fachpublikum einen Plattform zum Wissensaustausch zu bieten und gleichzeitig international Ma&#223;st&#228;be zu setzen.
Mit der Einrichtung der Betriebsstelle GDI-DE im Bundesamt f&#252;r Kartographie und Geod&#228;sie (BKG) wurde eine Schnittstelle zwischen der fachlichen und der technischen Umsetzung geschaffen, die neben dem technischen Betrieb der Komponenten auch die Einrichtung und Wartung zus&#228;tzlicher Produkte zur Kommunikation, wie Mailing-Listen, Bugtracker etc. gew&#228;hrleistet. Der Vortrag bietet einen Einblick in die t&#228;gliche Arbeit der Betriebsstelle.</description>
        <persons>
          <person id="456">Sven B&#246;hme</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="796" guid="none">
        <date>2015-03-13T09:15:00+01:00</date>
        <start>09:15</start>
        <duration>00:30</duration>
        <room>S10</room>
        <slug></slug>
        <title>Das audiovisuelle Erbe der OSGeo-Projekte </title>
        <subtitle>Referenzfall GRASS GIS - und Star Trek</subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Dieser Vortrag diskutiert die Problematik der Archivierung aller Aspekte von Open Source-Projekten und stellt das AV-Portal der Technischen Informationsbibliothek (TIB) vor. Das Portal ist eine zukunftssichere Alternative zum h&#228;ufig praktizierten eher fl&#252;chtigen Datenaustausch &#252;ber Plattformen wie Youtube oder Slideshare und kann nicht nur Metadaten eines Videos indexieren, sondern auch die gesprochene Sprache, Texteinblendungen oder Bildinformationen.</abstract>
        <description>Die Menge der audiovisuellen Inhalte hat in den letzten Jahren stark zugenommen und w&#228;chst weiterhin stark. Dies betrifft auch die Free and Open Source GIS Softwareprojekte der OSGeo Foundation:
Die thematische Palette erstreckt sich dabei von Anleitungsvideos f&#252;r Softwarekomponenten, &#252;ber Ergebnis- und Datenvisualisierungen bis hin zur abstrahierten Darstellung der Evolution einzelner Softwareprojekte. Die F&#252;lle dieser Fachinformationen wird noch haupts&#228;chlich in Web2.0 Portalen wie Youtube oder Slideshare ausgetauscht. Daraus ergeben sich Probleme sowohl bez&#252;glich der langfristigen Verf&#252;gbarkeit, der Zitierf&#228;higkeit  und der Auffindbarkeit anhand geeigneter Metadaten f&#252;r die Nutzer.. Eine zukunftssichere Alternative bietet die Nutzung von innovativen Bibliotheksdiensten, wie dem AV-Portal der Technischen Informationsbibliothek (TIB). Hier werden nicht nur die Metadaten eines Videos indexiert sondern ebenso die gesprochene Sprache, Texteinblendungen und Bildinformationen. Dies f&#252;hrt zu einer erheblich verbesserten Suche nach und in audiovisuellen Ressourcen. Durch die Verbindung eines DOI mit einem Media Fragment Identifier wird die sekundengenaue Zitierf&#228;higkeit der Materialien gew&#228;hrleistet.
Der Nutzen wird am Beispiel der erfolgreichen digitalen Erschlie&#223;ung des GRASS GIS Videos des U.S. Army Corps of Engineers Research Laboratory (CERL) aus dem Jahr 1987 demonstriert. Der Inhalt dieses historischen Videos bietet einen Einblick in die Fr&#252;hphase der GIS Entwicklung. Die Erschlie&#223;ungsgeschichte des Videos seit 2004 ist ein Referenzfall f&#252;r den aktuellen Stand und das sich abzeichnende Potential audiovisueller Information f&#252;r die Geoinformatik und speziell den wissenschaftlichen Anwendern und Entwicklern in den OSGeo Projekten.
</description>
        <persons>
          <person id="270">Peter L&#246;we</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="849" guid="none">
        <date>2015-03-13T09:45:00+01:00</date>
        <start>09:45</start>
        <duration>00:30</duration>
        <room>S10</room>
        <slug></slug>
        <title>Der schwere Werdegang zu einem FOSSGIS-Open Source Projekt</title>
        <subtitle></subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract>OpenSource machen ist einfach. Ein bisschen Code geschrieben, einen schicken Lizenz-Header oben dr&#252;ber gepastet und ab damit auf Git oder eine andere hippe Plattform. Aber damit ist es dann meistens doch nicht getan. Der Vortrag beschreibt warum.</abstract>
        <description>OpenSource-Projekte, nat&#252;rlich nicht nur im FOSSGIS Umfeld, leben von Ihrer aktiven Community, sie leben davon, dass sie m&#246;glichst wenig &#8222;Stallgeruch&#8220; einer Firma haben, dass sie an vielen Stellen zum Einsatz kommen und in aller Munde sind. Dies alles sind Schritte, die ein Projekt durchlaufen muss. Dazu kommt die Co-Existenz und eine Art von positivem Wettstreit mit anderen Projekten, die vielleicht sehr &#228;hnliches tun. Weiterhin zu nennen w&#228;ren auch unbezahlte Aufw&#228;nde f&#252;r Homepage, Dokumentation, &#220;bersetzungen, PSC und und und&#8230;

Der Vortrag widmet sich dem Prozess hin zu einem &#8222;echten&#8220; OpenSource-Projekt. Aufgezeigt wird dies an verschiedenen Beispielen. Oft fangen Open Source Projekte auf Basis von mehreren Entwicklungen an und werden langsam zu einem OpenSource-Projekt entwickelt. Warum das schwierig ist, wird im Vortrag erl&#228;utert. Dazu wird das Dilemma dargestellt, in das eine Firma zwangsl&#228;ufig hineinl&#228;uft, n&#228;mlich die Balance zwischen Projektarbeit und OpenSource-Projekt zu finden. In diesem Zusammenhang werden auch strategische Entscheidungen, die in den vorgestellten Beispiel-Projekten gelaufen sind, vorgestellt und Ihre Wirkung auf das OpenSource-Projekt projiziert. </description>
        <persons>
          <person id="153">Oliver Tonnhofer</person>
          <person id="23">Till Adams</person>
        </persons>
        <links>
          <link href="http://talks.omniscale.de/2015/fossgis/open-source/#1">Online-Folien</link>
        </links>
      </event>
      <event id="868" guid="none">
        <date>2015-03-13T11:00:00+01:00</date>
        <start>11:00</start>
        <duration>00:30</duration>
        <room>S10</room>
        <slug></slug>
        <title>3D GIS Stack aus OpenSource Komponenten</title>
        <subtitle></subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>In den letzten Jahren hat die dritte Dimension auch Einzug in den g&#228;ngigen FOSSGIS L&#246;sungen (PostGIS, QGIS, OpenLayers etc.) gehalten, so dass mittlerweile ein kompletter 3D-GIS-Stack aus OpenSource L&#246;sungen realisiert werden kann. Das wichtigste Ziel der hier vorgestellten Projekte ist die Interaktion mit 3D-Webkarten. Der Anwender soll in der Lage sein, mit den 3D-Modellen &#252;ber das Web arbeiten zu k&#246;nnen und sie nicht nur zu betrachten.</abstract>
        <description>Derzeit gibt es einen kleinen Hype um 3D Web-Viewer mit WebGL-Unterst&#252;tzung. Immer mehr Softwarefimen bieten eigene L&#246;sungen an, die h&#228;ufig auf offen verf&#252;gbaren Engines wie etwa Cesium [1] oder OpenWebGlobe [2] basieren. WebGL-Viewer ben&#246;tigen keine clientseitigen Plugins und funktionieren auf vielen Endger&#228;ten. Sie laufen auch ohne High-End-Ausstattung sehr schnell und erlauben ein fl&#252;ssiges interaktives Bewegen durch eine 3D Szene. 

Plattformen mit vielen detaillierten volltexturierten Objekten, wie etwa 3D-Stadtmodelle (damit sind keine texturierten Oberfl&#228;chenmodelle von St&#228;dten gemeint), m&#252;ssen zwar derzeit noch mit st&#228;rkeren Performanceeinschr&#228;nkungen leben, durch die rasant steigende Anzahl an Entwicklern und Anwendern von WebGL sollte dieser Engpass aber bald der Vergangenheit angeh&#246;ren. Aus demselben Grund d&#252;rften zunehmend auch freie Viewer in den derzeit von proriet&#228;ren Angeboten dominierten Markt dr&#228;ngen. 

Einen Anfang macht Cuardo [3] &#8211; eine OpenSource JavaScript-Bibliothek basierend auf THREE.js und WebGL. Cuardo wird von der franz&#246;sischen Firma Oslandia entwickelt, die sich auch verantwortlich zeigt f&#252;r den 3D-Support in PostGIS und ein 3D-Plugin f&#252;r QGIS namens Horao [4]. Oslandia hat das Ziel einen kompletten 3D-GIS-Stack von der Datenbank bis zur Webvisualisierung zu realisieren. Datenbank-seitig wird u.a. die 3D City Database [5] eingesetzt, eine OpenSource-L&#246;sung zum Speichern von CityGML-basierten 3D Stadt- und Landschaftsmodellen in PostGIS. 

Seit der neusten Version der 3D City Database steht eine WFS-Schnittstelle (Simple) zur Verf&#252;gung, die Viewern wie Cuardo die M&#246;glichkeit bietet, Inhalte der Datenbank abzurufen, ohne das spezifische Abfragen gegen das zugrunde liegende Datenbankschema notwendig sind. Der Client muss nur den WFS 2.0-Standard des OGC unterst&#252;tzen. F&#252;r die Zukunft ist geplant, das neben einer vollen Unterst&#252;tzung des OGC Filter Encoding auch Transaktionen mit dem WFS m&#246;glich sein werden. 

Das wichtigste Ziel der hier vorgestellten Projekte ist die Interaktion mit 3D-Webkarten. Der Anwender soll in der Lage sein, mit den 3D-Modellen &#252;ber das Web arbeiten zu k&#246;nnen und sie nicht nur zu betrachten. Der momentane Wirbel um WebGL erh&#246;ht nicht nur die Aufmerksamkeit f&#252;r 3D-Webmapping, er sch&#252;rt auch Erwartungen an ein 3D-WebGIS, das seinem 2D-Pendant in nichts nach steht.</description>
        <persons>
          <person id="306">Felix Kunde</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="857" guid="none">
        <date>2015-03-13T11:30:00+01:00</date>
        <start>11:30</start>
        <duration>00:30</duration>
        <room>S10</room>
        <slug></slug>
        <title>Cesium - der 3D-Globus im Web</title>
        <subtitle>Open Source Technologie in drei Dimensionen</subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Cesium ist ein performantes und interoperables Tool f&#252;r die Visualisierung von Daten im dreidimensionalen Kontext. Stichworte zum Vortrag: 3D - JavaScript - Open Source - WebGL - Zeitabh&#228;ngige Darstellung - OGC Standards - Openlayers 3 API - Demos und Beispiele.</abstract>
        <description>Mit der JavaScript Programmbibliothek Cesium kann ein 3D-Globus f&#252;r das Web erstellt werden, ohne dass f&#252;r die Visualisierung Plugins gebraucht werden. Cesium benutzt WebGL und unterst&#252;tzt ausserdem OGC-Standards wie WMS oder WMTS. Dies macht es zu einem performanten und interoperablen Tool f&#252;r die Visualisierung von Daten im dreidimensionalen Kontext.

Die Pr&#228;sentation stellt das Cesium.js Projekt vor und m&#246;chte folgende Fragen beantworten:
- Ein Opensource 3D Globus - was kann Cesium?
- Performante mehrdimensionale Visualisierung im Web - was steckt dahinter?
- 3D ist &#252;berall - wo wird Cesium eingesetzt?

Ausserdem wird die Kombination von Openlayers3 mit Cesium vorgestellt und ein Ausblick &#252;ber die n&#228;chsten Entwicklungen gegeben.</description>
        <persons>
          <person id="336">Elisabeth Leu</person>
        </persons>
        <links>
          <link href="http://cesiumjs.org/">cesiumjs.org</link>
          <link href="http://www.camptocamp.com/de/actualite/ol3-cesium-open-source-release/">OL3-Cesium Open Source release</link>
        </links>
      </event>
    </room>
    <room name="S2">
      <event id="866" guid="none">
        <date>2015-03-13T08:45:00+01:00</date>
        <start>08:45</start>
        <duration>00:30</duration>
        <room>S2</room>
        <slug></slug>
        <title>Projekt Umweltzone</title>
        <subtitle>zwischen Open Data und OpenStreetMap</subtitle>
        <track>Vorträge (OSM)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>In diesem Vortrag wird das Projekt "Umweltzone" vorgestellt. Dabei handelt es sich um eine kostenlose Open-Source-Anwendung f&#252;r Android-Ger&#228;te, mit der sich Benutzer &#252;ber die Lage der Umweltzonen verschiedener deutscher St&#228;dte informieren k&#246;nnen. Die Herausforderung bestand in der Recherche, Beschaffung, Digitalisierung bzw. Umwandlung und Integration der Geoinformation zu den Umweltzonen. </abstract>
        <description>Das Projekt "Umweltzone" startete im Oktober 2013 als direkte Reaktion auf das Fehlen eines zeitgem&#228;&#223;en Informationsangebots f&#252;r mobile Ger&#228;te. Zu diesem Zeitpunkt boten deutsche St&#228;dte Informationen zu ihren Umweltzonen lediglich in Form schlecht aufl&#246;sender Bilder, als PDFs mit eingescannten Stadtpl&#228;nen oder in Geoportalen an. Eine Anwendung f&#252;r Android-Ger&#228;te, die den mobilen Nutzer ansprach, war nicht vorhanden. Diese L&#252;cke sollte die "Umweltzone"-Anwendung schliessen.
Der Vortrag dokumentiert, dass schnell klar wurde, dass die eigentliche Programmierung der Anwendung nicht die gr&#246;&#223;te H&#252;rde darstellte. Die Herausforderung bestand in der Recherche, Beschaffung, Digitalisierung bzw. Umwandlung und Integration der Geoinformation zu den Umweltzonen. Die ersten Tage des Projekts waren von Euphorie gepr&#228;gt: einige Umweltzonen wurden manuell abgezeichnet, um die Geokoordinaten von einem Bild in digitale Verlaufspunkte zu &#252;bertragen. Bald darauf versuchte das Projekt mit Open-Data-Anfragen, Daten in den Beh&#246;rden deutscher St&#228;dte zu befreien. &#220;ber die Resultate dieser Bem&#252;hungen wird in diesem Vortrag berichtet.
Nach der Ver&#246;ffentlichung der ersten Version der Anwendung kam eine neue Datenquelle hinzu: OpenStreetMap. Das Verzeichnis freier Geodaten offenbarte sich als vielversprechende Alternative zu den offiziellen Publikationen deutscher St&#228;dte. Der Vortrag berichtet &#252;ber die Herausforderungen bei der Datenextraktion, Umwandlung und Pr&#252;fung. Zudem soll der Zwiespalt zwischen per Crowdsourcing gesammelten Daten und Ver&#246;ffentlichungen von Beh&#246;rden diskutiert werden.
Weiterhin berichtet der Vortrag &#252;ber den Verlauf und Erfolg der "Umweltzonen"-Wochenaufgabe im August 2014 in der deutschen OpenStreetMap-Nutzergemeinde. Es werden die Ergebnisse des Hack Weekends zur Umweltzone vorgestellt. Nicht zuletzt sollen die zuk&#252;nftigen Schritte des Projekts dargestellt werden.</description>
        <persons>
          <person id="475">Tobias Preu&#223;</person>
        </persons>
        <links>
          <link href="https://bitbucket.org/tbsprs/umweltzone">Umweltzone Quellcode</link>
          <link href="https://play.google.com/store/apps/details?id=de.avpptr.umweltzone">Umweltzone im Google PlayStore</link>
          <link href="http://blog.openstreetmap.de/blog/2014/08/wochenaufgabe-umweltzonen-kw-3536-25-08-7-09-2014/">Umweltzonen-Wochenaufgabe 08/2014</link>
          <link href="http://wiki.openstreetmap.org/wiki/Berlin_Hack_Weekend_October_2014">Hack Weekend Berlin 10/2014</link>
          <link href="http://slides.com/tbsprs/umweltzone-fossgis-2015">Folien zum Vortrag: Projekt Umweltzone</link>
        </links>
      </event>
      <event id="910" guid="none">
        <date>2015-03-13T09:15:00+01:00</date>
        <start>09:15</start>
        <duration>00:30</duration>
        <room>S2</room>
        <slug></slug>
        <title>con4gis - spontanes vom GIS Baukasten</title>
        <subtitle></subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract></abstract>
        <description></description>
        <persons>
          <person id="489">Tobias Dobbrunz</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="802" guid="none">
        <date>2015-03-13T09:45:00+01:00</date>
        <start>09:45</start>
        <duration>00:30</duration>
        <room>S2</room>
        <slug></slug>
        <title>Linked Data basierter Explorer</title>
        <subtitle>Ein Assistenzsystem zur Erforschung von Umweltdaten f&#252;r krebsrelevante Ursache-Wirkungs-Beziehungen im raum-zeitlichen Kontext</subtitle>
        <track>Vorträge (GIS)</track>
        <type>student_project</type>
        <language>de</language>
        <abstract>Die Webapplikation, basierend auf Linked Data, erm&#246;glicht als Assistenzsystem die Erforschung von Ursache-Wirkungs-Beziehungen zwischen Krebstypen und Umweltstoffen innerhalb einer vordefinierten Region durch dynamische Geovisualisierungen.</abstract>
        <description>Aktuell ist eine Vielzahl krebsbezogener Informationen als Open Data online verf&#252;gbar. Allerdings sind diese Informationen oftmals nicht aggregiert, besitzen unterschiedliche Formate oder sind teilweise nur unter erh&#246;htem Arbeitsaufwand zug&#228;nglich. Die hiermit pr&#228;sentierte Webanwendung vereinfacht, auf Basis von Linked Data und weiteren semantischen Technologien, die Erreichbarkeit krebsrelevanter Informationen. Neben der M&#246;glichkeit sich &#252;ber die krebsbezogenen Ursache-Wirkungs-Beziehungen zu informieren, ist der Hauptnutzen der Applikation die erm&#246;glichte Erforschung von Umweltdaten (z. B. Luftqualit&#228;t, Altlasten) im Zusammenhang mit epidemiologischen Datens&#228;tzen (z. B. statistische Vergleichswerte von Krebsinzidenzen) u. a. per Geovisualisierungen f&#252;r die Beispielregion Westfalen-Lippe. Der Fokus liegt hierbei auf der Verkettung:  
Krebstyp (z. B. Lungenkrebs) - Karzinogen (z. B. CO2) - Emissionsprozess (z. B. Verkehr) - Transportwege (z. B. Luft) - Emissionsquelle (z. B. Auto) - Exponent (z. B. M&#228;nnlich/Weiblich).  
Der Workflow, beginnend mit den Rohdaten &#252;ber die semantische Modellierung bis hin zur Webanwendung, ist komplett auf Open Source Software (z. B. Proteg&#233;, Apache Jena, R, OSM &amp; Leaflet) basierend. Produkte des Projektes (z. B. Domain Ontologie) sind neben dem Code der Applikation zur Wiederverwendung auf Github zug&#228;nglich.</description>
        <persons>
          <person id="449">Friedrich M&#252;ller</person>
        </persons>
        <links>
          <link href="https://github.com/lodum/CancerExplorer">Github</link>
        </links>
      </event>
      <event id="880" guid="none">
        <date>2015-03-13T11:00:00+01:00</date>
        <start>11:00</start>
        <duration>00:30</duration>
        <room>S2</room>
        <slug></slug>
        <title>Location-based Task Management</title>
        <subtitle>Standortbezogene Aufgabenverwaltung f&#252;r mobile Arbeitspl&#228;tze</subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>FOSS4G Software kann bei vielerlei Aufgaben mit Raumbezug helfen, Arbeitsabl&#228;ufe zu verbessern und zu optimieren, und die Mitarbeiter bei Ihrer t&#228;glichen Arbeit zu entlasten. Dieser Vortrag stellt ein Konzept vor f&#252;r "Location-based Task Management".</abstract>
        <description>Gesch&#228;ftsleute m&#252;ssen ihre Kunden besuchen, ambulantes Pflegepersonal Ihre Patienten. St&#228;dtische Mitarbeiter m&#252;ssen in regelm&#228;&#223;igen Intervallen die &#246;ffentlichen Verm&#246;genswerte und Infrastruktur &#252;berpr&#252;fen, usw.. Es gibt viele Beispiele aus dem Arbeitsalltag, bei denen Aufgaben einen besonderen Raumbezug haben.

FOSS4G Software kann dabei helfen, diese Aufgaben zu organisieren und zu optimieren. Denn GIS Technologie bedeutet weit mehr, als ein paar farbige Marker auf einer Online-Karte darzustellen. Ortsbasierte Aufgaben durchlaufen in der Regel verschiedene Zust&#228;nde, haben unterschiedlich hohe Priorit&#228;ten, k&#246;nnen w&#228;hrend der Bearbeitung an unterschiedliche Personen &#252;bertragen werden und folgen fast immer einem vordefinierten Ablauf.

Mit der Optimierung von Arbeitsabl&#228;ufen und Tourenplanung im Hinterkopf, und auf Grundlage verf&#252;gbarer Open-Source-Software und offenen Standards haben wir begonnen, eine Task-Management-Software zu entwickeln. In dieser Pr&#228;sentation werden Sie Details zu unserem Konzept zu erfahren, und wie dies dazu beitragen kann, Dienstleistungen vor Ort zu erleichtern, die Servicequalit&#228;t zu verbessern und die Effizienz zu steigern.</description>
        <persons>
          <person id="466">Daniel Kastl</person>
        </persons>
        <links>
          <link href="http://talks.dkastl.georepublic.info/2015/gtt.html#/">http://talks.dkastl.georepublic.info/2015/gtt.html#/</link>
        </links>
      </event>
      <event id="784" guid="none">
        <date>2015-03-13T11:30:00+01:00</date>
        <start>11:30</start>
        <duration>00:30</duration>
        <room>S2</room>
        <slug></slug>
        <title>MapFish Print V3: Printing maps like a boss</title>
        <subtitle>The next generation of printed maps</subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Dieser Vortrag stellt die neue Version von MapFish Print vor und spricht Themen an wie die neuen Features und deren Nutzung, die Erstellung von Templates mit dem Report-Designer von JasperReports, Upgrade von der vorherigen Version, Skalierbarkeit und Erweiterung durch eigene Module.</abstract>
        <description>Das Projekt MapFish Print besteht aus einer Bibliothek und einer Web-Anwendung zum Druck von Reports mit Karten, wobei eine Vielfalt von Quellen unterst&#252;tzt wird, zum Beispiel WMS, WMTS, OpenStreetMap-Kacheln, WFS oder GeoJSON.

Mittlerweile besteht das Projekt seit fast einem Jahrzehnt und wird in einer Vielzahl von Websites erfolgreich eingesetzt. Allerdings ist es etwas in die Jahre gekommen, so dass die urspr&#252;ngliche Architektur zum Hindernis wurde. Beispielsweise ist die Formatierung der Reports &#252;ber eine Konfigurationsdatei nicht sehr flexibel, das Ausgabeformat ist prinzipiell auf PDF beschr&#228;nkt, es ist nicht m&#246;glich mehr als eine Karte auf einer Seite anzuzeigen und andere Limitationen.

MapFish Print V3 ist das Ergebnis eines kompletten Rewrites der Implementierung. Dank der Integration mit der weit verbreiteten Reporting-Engine JasperReports und der neuen, erweiterbaren Architektur ist MapFish Print flexibler, m&#228;chtiger und einfacher zu Skalieren als je zuvor.

Diese Pr&#228;sentation richtet sich an Web-Entwickler und Projektleiter, und spricht folgende Themen an:

 * Die neuen Features der neuen Version
 * Wie k&#246;nnen diese Features genutzt werden?
 * Die Verwendung des Report-Designers
 * Beispiele f&#252;r komplexe Reports
 * Upgrade von der vorherigen Version
 * Die Architektur, wie sie die Skalierbarkeit erleichtert und wie sie es erm&#246;glicht MapFish Print durch eigene Module zu erweitern</description>
        <persons>
          <person id="448">Tobias Sauerwein</person>
        </persons>
        <links>
          <link href="https://github.com/mapfish/mapfish-print">MapFish Print on Github</link>
          <link href="http://tsauerwein.github.io/talks_fossgis2015/mfp.html">Slides Online</link>
        </links>
      </event>
    </room>
    <room name="S1">
      <event id="804" guid="none">
        <date>2015-03-13T08:45:00+01:00</date>
        <start>08:45</start>
        <duration>00:30</duration>
        <room>S1</room>
        <slug></slug>
        <title>Indoor Routing in Geb&#228;uden des &#246;ffentlichen Verkehrs auf Basis von OpenStreetMap Daten</title>
        <subtitle></subtitle>
        <track>Vorträge (OSM)</track>
        <type>lecture</type>
        <language></language>
        <abstract>In unserem Vortrag m&#246;chten wir unser Konzept der Indoor Navigation vorstellen und Erfahrungen und &#8222;Best Practices&#8220; pr&#228;sentieren die wir bei der Indoor Erfassung von Geb&#228;uden des &#246;ffentlichen Verkehrs gemacht haben.
</abstract>
        <description> In den letzten Jahren sind immer mehr Bestrebungen zu sehen, das Innenleben von &#246;ffentlichen Geb&#228;uden kartografisch darzustellen. Gleichzeitig wird es nat&#252;rlich auch immer interessanter diese zus&#228;tzlichen Informationen weiter zu verarbeiten. Ein f&#252;r die Anwendbarkeit dieser Daten pr&#228;destiniertes Feld ist die Navigation innerhalb von Geb&#228;uden des &#246;ffentlichen Verkehrs. Der Bedarf an genauer schneller und vor allem individueller Orientierungshilfe ist in solchen Geb&#228;uden besonders hoch.
Wir, die Mentz Datenverarbeitung GmbH (mdv), sind ein Dienstleister f&#252;r Informationstechnologie im Bereich &#246;ffentlicher Verkehr. Die Verwendung von OSM Daten erlaubt es uns auch bei den r&#228;umlichen Daten in den kompletten Prozess von der Datenerfassung &#252;ber die Datenverarbeitung bis zur Ausgabe involviert zu sein. Unser Ziel ist hier die bestm&#246;gliche Integration der r&#228;umlichen Daten und der Datenmodelle des &#246;ffentlichen Verkehrs zu erreichen , auf deren Basis die Navigation erfolgen soll.
Die Navigation innerhalb von komplexen Umsteigebauwerken hat gro&#223;es Potential die Nutzung von &#246;ffentlichen Verkehrsmitteln, gerade auch f&#252;r Personen mit speziellen Mobilit&#228;tsanforderungen zu vereinfachen. Bisher sind viele der relevanten Geb&#228;ude in OSM nur teilweise als Indoor Bauwerk erfasst. 
In unserem Vortrag m&#246;chten wir unser Konzept der Indoor Navigation vorstellen und Erfahrungen und &#8222;Best Practices&#8220; pr&#228;sentieren die wir bei der Indoor Erfassung von Geb&#228;uden des &#246;ffentlichen Verkehrs gemacht haben.
</description>
        <persons>
          <person id="458">Thomas Jakubicka</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="772" guid="none">
        <date>2015-03-13T09:15:00+01:00</date>
        <start>09:15</start>
        <duration>00:30</duration>
        <room>S1</room>
        <slug></slug>
        <title>Neues zu BRouter</title>
        <subtitle>- mehr als nur Outdoor-Navigation -</subtitle>
        <track>Vorträge (OSM)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Dieser Vortrag stellt einige der Neuerungen aus dem letzten Jahr beim Projekt BRouter vor, mit einem besonderen Augenmerk auf den neuen M&#246;glichkeiten im Hinblick auf Spezialanwendungen durch das neue, flexiblere Datenmodell.</abstract>
        <description>Das Open-Source Projekt BRouter hat fast 3 Jahre Entwicklung hinter sich und sich im Bereich der Outdoor-Navigation auf  Android Smartphones einen festen Platz erobert. Aber die Entwicklung geht weiter, und so will dieser Vortrag denn auch nur eine ganz kurze Einf&#252;hrung in das Projekt geben um dann einige der Neuerungen des letzten Jahres vorzustellen, die selbst die regelm&#228;ssigen Nutzer noch kaum kennen. Beispiele sind steigungsabh&#228;ngige Weg-Pr&#228;ferenzen, schnellere Neuberechnungen und die Integration der 30m-SRTM H&#246;hendaten. Die wichtigste Neuerung aber ist ein neues, flexibleres internes Datenmodell, mit dem ein viel gr&#246;sserer Teil der Prim&#228;r-Information  aus der OSM Datenbank in den vorverarbeiteten Datenfiles dargestellt werden kann. Dadurch werden sowohl Spezialanwendungen im Wegenetz m&#246;glich, etwa im  Hinblick auf Barrierefreiheit, Einsatzfahrzeuge oder Schwerlastverkehr, aber auch Anwendungen in ganz anderen Netzen wie dem Schienen, Fluss- oder Stromnetz.</description>
        <persons>
          <person id="397">Arndt Brenschede</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="897" guid="none">
        <date>2015-03-13T09:45:00+01:00</date>
        <start>09:45</start>
        <duration>00:30</duration>
        <room>S1</room>
        <slug></slug>
        <title>OSM Lightning Talks II</title>
        <subtitle></subtitle>
        <track>Lightning Talks (OSM)</track>
        <type>lightning</type>
        <language></language>
        <abstract></abstract>
        <description></description>
        <persons>
        </persons>
        <links>
        </links>
      </event>
      <event id="779" guid="none">
        <date>2015-03-13T11:00:00+01:00</date>
        <start>11:00</start>
        <duration>00:30</duration>
        <room>S1</room>
        <slug></slug>
        <title>Schatzsuche in OpenStreetMap</title>
        <subtitle></subtitle>
        <track>Vorträge (OSM)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Mit der Overpass API lassen sich auch ungew&#246;hnliche Daten in OpenStreetMap finden - und bewundern, ihnen nachsp&#252;ren oder sie korrigieren. Neben einer Pr&#228;sentation der Ergebnisse des Vergleiches von Bonn und M&#252;nster werden dabei auch ausf&#252;hrlich die verwendeten Overpass-API-Abfragen vorgestellt, so dass jeder die Abfragen leicht f&#252;r seine Stadt wiederholen oder inhaltlich auf seine Bed&#252;rfnisse anpassen kann.</abstract>
        <description>Mit der Overpass API lassen sich auch ungew&#246;hnliche Daten in OpenStreetMap finden - und bewundern, ihnen nachsp&#252;ren oder sie korrigieren.

Wir untersuchen zwei Gro&#223;st&#228;dte, Bonn und M&#252;nster, mit verschiedenen Ans&#228;tzen auf ungew&#246;hnliche Daten, z.B.:
Was bleibt, wenn man alle Objekte wegl&#228;sst, die sich anhand ihrer Tags einer klaren Kategorie zuordnen lassen?
Wo fehlen wahrscheinlich noch Briefk&#228;sten?
Welche Br&#252;cken haben keine H&#246;henangabe?
Wo steht in den Tags eines Elements vermutlich Spam?
Welche Restaurants (und sonstige Points-of-Interest) sind verd&#228;chtig alt?

Neben einer Pr&#228;sentation der Ergebnisse f&#252;r die beiden benannten St&#228;dte werden dabei auch ausf&#252;hrlich die verwendeten Overpass-API-Abfragen vorgestellt, so dass jeder die Abfragen leicht f&#252;r seine Stadt wiederholen oder inhaltlich auf seine Bed&#252;rfnisse anpassen kann.
</description>
        <persons>
          <person id="280">Roland Olbricht</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="812" guid="none">
        <date>2015-03-13T11:30:00+01:00</date>
        <start>11:30</start>
        <duration>00:30</duration>
        <room>S1</room>
        <slug></slug>
        <title>FlatMatch: Online-Wohnungssuche mit OSM-Daten</title>
        <subtitle>K&#246;nnen wir tausende deutsche Vermieter zu OSM-Mitwirkenden machen?</subtitle>
        <track>Vorträge (OSM)</track>
        <type>lecture</type>
        <language></language>
        <abstract>Interaktive 3D-Wohnungsbesichtigung im Browser auf Basis von OSM-Daten erm&#246;glicht ein besseres Bewerten freier Wohnungen und deren Umfeld. Und sie macht Vermieter zu OSM-Stakeholdern. Die Mitarbeit kommerzieller Nutzer an OSM h&#228;ngt jedoch allein davon ab, ob sie dadurch einen wirtschaftlichen Mehrwert erhalten. Diese Vortrag stellt ein Projekt vor, dass potentiell zehntausende kleine und mittlere Unternehmen in Deutschland diesen Mehrwert bietet.</abstract>
        <description>Kontinuierliche Beitr&#228;ge zu OSM erfolgen vor allem durch die Community und kommerzielle Nutzer. Letztere leisten durch ihr strukturiertes Vorgehen und umfangreiches Zeitbudget einen wichtigen Beitrag zu Datenqualit&#228;t, und -umfang von OSM. Die Mitarbeit kommerzieller Nutzer an OSM h&#228;ngt jedoch allein davon ab, ob sie dadurch einen wirtschaftlichen Mehrwert erhalten. Diese Vortrag stellt ein Projekt vor, dass potentiell zehntausende kleine und mittlere Unternehmen in Deutschland diesen Mehrwert bietet:
FlatMatch ist eine Web-Anwendung, um Mietwohnungen direkt im Webbrowser virtuell zu besichtigen und so eine geeignete neue Wohnung zu finden. Hierzu wird nicht nur die Wohnung interaktiv dreidimensional dargestellt. Auch die Aussicht aus der Wohnung wird - auf Basis von OSM-3D-Geb&#228;uden und TileMaps - dargestellt, um einen besseren Einblick in das Wohnumfeld zu geben. Dies erlaubt Mietern, sicherer und auch ohne langwierige Vor-Ort-Besichtigungen eine f&#252;r sie passende Wohnung zu finden. Und es erlaubt Vermietern, den Personalaufwand f&#252;r Besichtigungen zu reduzieren, und ihre Wohnungen auch auf Basis deren Umfelds zu vermarkten.
Damit haben erstmals zehntausende Vermieter einen Mehrwert davon, OSM-Daten in der Umgebung ihrer Wohnungen mit m&#246;glichst gro&#223;en Detailgrad beizutragen, zu aktualisieren und Fehler zu korrigieren. Dies kann einen wichtigen Beitrag zu OSM leisten, und &#8211; gerade bei gr&#246;&#223;eren Vemietern &#8211; OSM-Community-Mappern eine Verdienstm&#246;glichkeit f&#252;r das Mappen dieser Regionen er&#246;ffnen. </description>
        <persons>
          <person id="463">Robert Buchholz</person>
        </persons>
        <links>
          <link href="http://rbuch703.de/flat3">Demo von FlatMatch</link>
          <link href="http://github.com/rbuch703/osmstreetview">GitHub-Seite f&#252;r den Quellcode der StreetView-Komponente</link>
          <link href="http://rbuch703.de/osmsv">Demo allein der StreetView-Komponente</link>
        </links>
      </event>
    </room>
    <room name="StudLab 1">
      <event id="853" guid="none">
        <date>2015-03-13T08:45:00+01:00</date>
        <start>08:45</start>
        <duration>01:30</duration>
        <room>StudLab 1</room>
        <slug></slug>
        <title>Einf&#252;hrung in GeoKettle</title>
        <subtitle></subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language>de</language>
        <abstract></abstract>
        <description>GeoKettle
GeoKettle ist ein ETL-Programm f&#252;r r&#228;umliche Daten. ETL steht f&#252;r Extract, Load und Transform. GeoKettle basiert auf der OpenSource Software Pentaho Data Integration (Kettle) und ist mit der LPGL lizensiert. GeoKettle unterst&#252;tzt dabei u.a. die OpenSource Bibliotheken GeoTools, Degree und gdal/ogr und sextante. 

Der Workshop richtet sich an Teilnehmer, die &#252;ber bisher keine Erfahrungen mit GeoKettle verf&#252;gen. Neben den ersten Schritten mit GeoKettle wie "Kennenlernen der Benutzeroberfl&#228;che und Terminolgie" sollen im Workshop folgende Inhalte vermittelt werden:

-Import von Shapedateien in eine Datenbank
-Koordinatentrasnformation w&#228;hred des Importvorgangs
-Zusammenf&#252;hren von zwei Shapefiles in eine Datenbanktabelle
-Aufsplitten von Shapefiles in mehrere Datenbanktabellen
-Ver&#228;nderung von Sachdaten   
    
</description>
        <persons>
          <person id="347">Jens Schaefermeyer</person>
        </persons>
        <links>
          <link href="http://live.osgeo.org/de/overview/geokettle_overview.html">http://live.osgeo.org/de/overview/geokettle_overview.html</link>
          <link href="http://www.spatialytics.org/projects/geokettle/">http://www.spatialytics.org/projects/geokettle/</link>
        </links>
      </event>
    </room>
    <room name="StudLab 2">
      <event id="839" guid="none">
        <date>2015-03-13T08:45:00+01:00</date>
        <start>08:45</start>
        <duration>01:30</duration>
        <room>StudLab 2</room>
        <slug></slug>
        <title>GeoServer in action</title>
        <subtitle>Einrichtung und Tuning des GeoServers f&#252;r den Produktiveinsatz</subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language></language>
        <abstract>GeoServer in action - Einrichtung und Tuning des GeoServers f&#252;r den Produktiveinsatz</abstract>
        <description>Der GeoServer ist ein weithin bekannter und m&#228;chtiger OpenSource Kartenserver. Sofern man die Umgebung eingerichtet hat, ist sowohl die Installation als auch die Konfiguration von ersten WMS- und WFS-Layern sehr einfach. In diesem Workshop wird auf die typischen Anforderungen eines "GeoServers in action" eingegangen. Der Fokus liegt dabei auf einer schnellen und auf die konkrete Systemumgebung ma&#223;geschneiderten Einrichtung. Dabei soll auch die Konfiguration f&#252;r einen Produktiveinsatz ber&#252;cksichtigt werden.

Im Rahmen des Workshops werden u.a. folgende Themen behandelt:
  * Geoserver auf Basis des Source-Codes (inkl. eigener Anpassungen) selber kompilieren
  * Einrichtung von Workspaces, Stores, Layern und Styles &#252;ber die REST-Schnittstelle
  * Einsatz des GeoWebCache (GWC)
  * Performance-Tuning f&#252;r den Produktiveinsatz auf verschiedenen Ebenen
  * Typische Stolperfallen und Troubleshooting

Vorkenntnisse in einer Programmiersprache sind f&#252;r diesen Workshop nicht notwendig. Praktische Erfahrungen mit dem Geoserver sind von Vorteil, aber nicht zwingend erforderlich.</description>
        <persons>
          <person id="363">Daniel Koch</person>
          <person id="412">Nils B&#252;hner</person>
        </persons>
        <links>
        </links>
      </event>
    </room>
    <room name="StudLab 3">
      <event id="807" guid="none">
        <date>2015-03-13T08:45:00+01:00</date>
        <start>08:45</start>
        <duration>01:30</duration>
        <room>StudLab 3</room>
        <slug></slug>
        <title>Entwicklung von QGIS Plugins auf der Basis von PyQt und PyQGIS</title>
        <subtitle></subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language></language>
        <abstract></abstract>
        <description>Mit dem Schreiben von Python-Plugins oder Python-Applikationen er&#246;ffnen sich m&#228;chtige M&#246;glichkeiten, um QGIS zur L&#246;sung eigener Fragestellungen zu erweitern oder Komponenten von QGIS in eigenen Applikationen zu verwenden. Die Teilnehmer kennen nach dem Workshop den Einstieg in die QGIS Plugin-Entwicklung mit Python und PyQGIS</description>
        <persons>
          <person id="13">Horst D&#252;ster</person>
        </persons>
        <links>
        </links>
      </event>
    </room>
  </day>
</schedule>
