<?xml version="1.0" encoding="UTF-8"?>
<schedule>
  <conference>
    <title>FOSSGIS 2013</title>
    <subtitle>Konferenz f&#252;r freie und Open Source-Software im GIS-Bereich und f&#252;r freie Geodaten</subtitle>
    <venue>HSR Hochschule f&#252;r Technik</venue>
    <city>Rapperswil</city>
    <start>2013-06-12</start>
    <end>2013-06-14</end>
    <days>3</days>
    <release>#&lt;Conference_release::Row:0x2b821ac5dda8&gt;</release>
    <day_change>07:00</day_change>
    <timeslot_duration>00:15</timeslot_duration>
  </conference>
  <day date="2013-06-12" index="1">
    <room name="Aula / 4.1000">
      <event id="618">
        <start>13:15</start>
        <duration>01:45</duration>
        <room>Aula / 4.1000</room>
        <slug></slug>
        <title>Er&#246;ffnungsveranstaltung</title>
        <subtitle></subtitle>
        <track>Allgemeines</track>
        <type></type>
        <language></language>
        <abstract>Willkommen auf der FOSSGIS 2013!</abstract>
        <description>* Stefan Keller, HSR: Moderation
* Hermann Mettler, HSR: Begr&#252;ssung des Rektor
* Erich Zoller, Stadtpr&#228;sident von Rapperswil-Jona: Gru&#223;worte 
* Emmanuel Belo, CampToCamp: Neue Webmapping-Trends (Keynote Goldsponsor)
* Marc Wick, GeoNames.org: Freie Geonamen (Keynote)
* Simon Poole, OSMF+SOSM: OpenStreetMap (Keynote)

Lightning Talks:
* Petr Pridal: WebGL - Future of online mapping (english)
* Oliver Tonnhofer: Die GeoBox-Infrastruktur
* Peter K&#246;rner: OpenStreetMap History
* Peter Lanz: Beobachtung der Schneeauflastung auf Flachd&#228;chern in Echtzeit
* Ralph Straumann: Sonnenblendungsanalyse von Verkehrsunf&#228;llen mit Python
* Julius Chrobak: Extracting valuable data from OpenStreetMap (english)
</description>
        <persons>
          <person id="263">Emmanuel Belo</person>
          <person id="370">Erich Zoller</person>
          <person id="345">Hanno Rahn</person>
          <person id="371">Hermann Mettler</person>
          <person id="375">Julius Chrobak</person>
          <person id="369">Marc Wick</person>
          <person id="153">Oliver Tonnhofer</person>
          <person id="109">Peter K&#246;rner</person>
          <person id="342">Peter Lanz</person>
          <person id="327">Petr Pridal</person>
          <person id="308">Ralph Straumann</person>
          <person id="368">Simon Poole</person>
        </persons>
        <links>
        </links>
      </event>
    </room>
    <room name="5.001">
      <event id="547">
        <start>15:30</start>
        <duration>00:30</duration>
        <room>5.001</room>
        <slug>http://metaspatial.net/conferences/fossgis2013_open.html</slug>
        <title>Open Standards, Open Source, Open Data: Zuviel des Guten?</title>
        <subtitle>Wie die verschiedenen Aspekte von Offenheit zusammenpassen.</subtitle>
        <track>Vortr&#228;ge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Der Foliensatz ist Online erreichbar:
http://metaspatial.net/conferences/fossgis2013_open.html

= Open Standards, Open Source, Open Data: Zuviel des Guten? = 

Der Vortrag beleuchtet ausnahmsweise mal die Schattenseiten dieser drei Gesellen, denn: Ja, es gibt sie, z.B. 
* behindern Standards Innovation,
* zerst&#246;rt Open Source bew&#228;hrte Gesch&#228;ftsmodelle und
* Open Data f&#246;rdert das Chaos. 

Eine konstruktive Herangehensweise zeigt, dass es lediglich gilt diese Schattenseiten auzuleuchten, um das volle Potential expliziter Offenheit aussch&#246;pfen zu k&#246;nnen. 

== Open Standards ==
Ein Blick auf das Alter einiger Standards und deren Praktibilit&#228;t in der heutigen IT-Landschaft zeigt, wie schwer es ist Innovation einzuf&#252;hren. Und das ist auch gut so, denn nicht jede Innovation ist auch gleich gut. Oft sind Innovationen auch einfach nur neu und vollkommen &#252;berfl&#252;ssig oder m&#252;ssen Bew&#228;hrtes gar nicht zwingend ersetzen, sondern k&#246;nnen es erg&#228;nzen. Der Beitrag stellt M&#246;glichkeiten vor, Innovation in geregelter Form einzubringen.

== Open Source ==
Open Source zerst&#246;rt propriet&#228;re Gesch&#228;ftsmodelle und ist deshalb ein Verlust f&#252;r herk&#246;mmliche Softwarehersteller die sich weigern ihr Gesch&#228;ftsmodell an ver&#228;nderte Bedingungen anzupassen. Open Source f&#252;hrt aber auch zu Innovation, belebt den Markt und f&#246;rdert den Wettbewerb. Lediglich 10% des Umsatzes in IT Projekten basiert auf propriet&#228;ren Gesch&#228;ftsmodellen. 

== Open Data ==
Der Begriff Open Data ist noch nicht klar definiert und bedarf zus&#228;tzlicher Erkl&#228;uterungen. Die wachsende Verf&#252;gbarkeit von Open Data wirft eine ganze Reihe neuer und alter Fragen auf, die hier vorgestellt werden. Es gilt transparente Antworten auf diese Fragen zu finden um die Daten und den Umgang damit kontinuierlich verbessern zu k&#246;nnen. 

Innovation fordert kontinuierliche Investition. Das geht besser, wenn alle Aktuere (Stakeholder) an den Prozessen teilnehmen k&#246;nnen und nicht, wie es bisher oft der Fall war, alles geheim und hinter verschlossenen T&#252;ren entschieden wird. 

Im Grunde stimmt es also doch: Alles offen, alles gut. Man muss nur wissen wie.</abstract>
        <description></description>
        <persons>
          <person id="51">Arnulf Christl</person>
        </persons>
        <links>
          <link href="http://metaspatial.net/conferences/fossgis2013_open.html">Online Foliensatz</link>
        </links>
      </event>
      <event id="598">
        <start>16:00</start>
        <duration>00:30</duration>
        <room>5.001</room>
        <slug></slug>
        <title>Offene Standards und Freie Software &#8211; Zusammenspiel, Entwicklungen, Unterschiede</title>
        <subtitle></subtitle>
        <track>Vortr&#228;ge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>&#196;hnlich wie die immer wiederkehrenden Fragen nach &#8222;Was ist Freie Software?&#8220;, &#8222;Was ist Open Source Software?&#8220;, &#8222;Was ist die OSGeo?&#8220; gibt es immer wieder Fragen wie &#8222;Was ist das OGC?&#8220;, &#8222;Wie entsteht ein Standard?&#8220;, &#8222;Wie kann ich mich beim OGC einbringen?&#8220;. Daher ist der Vortrag als Grundlagenvortrag gedacht, der aber auch Ausblick auf aktuelle Entwicklungen im OGC gibt.</abstract>
        <description>Offene Standards bilden die Grundlage f&#252;r viele Anwendungen in einer immer komplexer werdenden IT-Welt. Geodaten und daraus resultierende Geoinformationen finden immer mehr Anwendung und werden von immer mehr Nicht-Fachleuten genutzt. Ein standardisierter Zugriff und Interoperabilit&#228;t zwischen verschiedenen Systemen und Plattformen ist eine wichtige Voraussetzung, um die gro&#223;e Menge Daten und Informationen sinnvoll zu nutzen und miteinander verkn&#252;pfen zu k&#246;nnen. 
In der Geo-Branche sind die Standards des Open Geospatial Consortium (OGC) in Bereichen wie 3D-Anwendungen, dem &#8222;Internet der Dinge&#8220;, aber auch bei &#8222;klassische&#8220; Geoportal-Anwendungen nicht mehr wegzudenken. 

Die zentrale Aufgabe des OGC ist die globale Entwicklung, F&#246;rderung und Harmonisierung von offenen Standards und Architekturen, die die Integration von raumbezogenen Daten und Diensten f&#252;r Benutzeranwendungen erm&#246;glichen und entsprechendes Marktpotenzial schaffen.

&#196;hnlich wie die immer wiederkehrenden Fragen nach &#8222;Was ist Freie Software?&#8220;, &#8222;Was ist Open Source Software?&#8220;, &#8222;Was ist die OSGeo?&#8220; gibt es immer wieder Fragen wie &#8222;Was ist das OGC?&#8220;, &#8222;Wie entsteht ein Standard?&#8220;, &#8222;Wie kann ich mich beim OGC einbringen?&#8220;. 

Daher beleuchtet dieser (als Grundlagenvortrag gedachte) Vortrag u.a. folgende Aspekte:

+ Grundlagen des OGC: Was arbeitet das OGC und wie ist sie aufgebaut? Wer sind die Mitglieder? Was sind aktuelle Themen?
+ Wie entsteht ein Standard? Vom Interoperability Program zum Standards Program (z.B. 3D Portrayal Interoperability Experiment) [1, 2, 3]
+ Welche Rolle spielt Freie Software im OGC (Beispiele: OGC Referenzimplementationen, das OGC Compliance Program)
+ Neuigkeiten aus den einzelnen Arbeitsgruppen, wie z.B. welche aktuellen Entwicklungen gibt es im Bereich Linked Data? Welche Arbeitsgruppen wurden in den vergangenen 12 Monaten in Leben gerufen?, Wie ist der Standard der Dinge der OGC Web Services Testbeds (OWS-9 und OWS-10).
+ Ausblick auf Aktivit&#228;ten / Meetings in 2013/2014

Links:
[1] Interoperability Program: http://www.opengeospatial.org/ogc/programs/ip
[2] Standards Program: http://www.opengeospatial.org/ogc/programs/spec
[3] 3D Portrayal Interoperability Experiment: http://www.opengeospatial.org/projects/initiatives/3dpie</description>
        <persons>
          <person id="208">Athina Trakas</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="576">
        <start>16:30</start>
        <duration>00:30</duration>
        <room>5.001</room>
        <slug></slug>
        <title>OSGeo-Live rocks!</title>
        <subtitle>Einblick in ein erfolgreiches Community-Projekt</subtitle>
        <track>Vortr&#228;ge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract>Das Projekt OSGeo-Live gew&#228;hrt einen umfassenden &#220;berblick &#252;ber freie und offene GIS-Software und GeoDaten

OSGeo-Live ist ein OpenSource-Projekt, das mehr als 50 Softwareprojekte aus dem Bereich FOSS+GIS b&#252;ndelt. Sie finden Projekte aus den Bereichen Web Mapping Clients und Server, DesktopGIS, Datenbanken, Krisenmanagement, Navigation und Karten sowie r&#228;umliche Tools. 

Die OSGeo-Live ist somit ein sehr gutes Beispiel f&#252;r ein erfolgreiches OpenSource-Projekt. Dabei handelt es sich nicht um ein klassisches Software-Projekt, sondern um eine Zusammenstellung verschiedenster Anwendungen und Informationen, die dem interessierten Publikum als gut sortierte Werkzeugkiste angeboten wird.

Projekt&#252;bergreifend wurden viele Freiwillige gefunden, die regelm&#228;&#223;ig die Inhalte aktualisieren. Damit ist ein Produkt entstanden, was als globale Visitenkarte nicht nur der OSGeo-Projekte dient. OSGe-Live kann in Workshops und eigenen Veranstaltungen verwendet werden. Alle FOSS- und GIS-relevante Software wird mehrsprachig und mit Dokumentation zur Verf&#252;gung gestellt. So ligen beispielsweise &#220;bersetzungen ins Deutsche, Italienische, Polnische, Griechische, Japanische, Franz&#246;siche, Catalanische, Chinesiche, Koreanische vor.

Dieser Vortrag liefert Einblicke in die Entstehung und den Aufbau dieses Projektes. Die ehrgeizigen Ziele wie mehrsprachige Dokumentation, Benutzung von Beispieldatens&#228;tzen und Support in der Community stellen ganz unterschiedliche Anforderungen. Es gilt nicht nur technische Probleme zu l&#246;sen. Hinzu kommen terminliche Absprachen, damit zu bestimmten Anl&#228;ssen wie wichtigen Konferenzen und Workshops aktuelle Versionen bereit stehen.

=FOSSGIS=
Auch auf der **FOSSGIS Konferenz 2013** kommt die OSGeo-Live in den Workshops zum Einsatz und wird als DVD an die Teilnehmer der Konferenz verteilt.</abstract>
        <description></description>
        <persons>
          <person id="65">Astrid Emde</person>
        </persons>
        <links>
          <link href="http://live.osgeo.org">http://live.osgeo.org</link>
          <link href="http://http://wiki.osgeo.org/wiki/Live_GIS_Disc">http://http://wiki.osgeo.org/wiki/Live_GIS_Disc</link>
          <link href="http://www.fossgis.de/w/images/a/a4/FOSSGIS_2013_OSGeo-Live_rocks_AEmde.pdf">FOSSGIS_2013_OSGeo-Live_rocks_AEmde.pdf (Vortragsfolien OSGeo-Live rocks! Astrid Emde)</link>
        </links>
      </event>
      <event id="528">
        <start>17:00</start>
        <duration>00:30</duration>
        <room>5.001</room>
        <slug></slug>
        <title>Kollaboration um ein Open-Source generisches Mapping System</title>
        <subtitle></subtitle>
        <track>Vortr&#228;ge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Seit zwei Jahren sind mehrere Projekte um Open-Source Mapping in der Westschweiz entstanden. Anstatt einzelne Projekte zu entwickeln, wurde schnell klar, dass diese Kosten und Entwicklungen geteilt werden mussten, wodurch ein generisches und h&#246;chst konfigurierbares System gemeinsam entwickelt wurde. Sei es Kantonen, St&#228;dte, &#246;ffentliche Vereinigungen oder sogar private Unternehmen, die Partner m&#252;ssen die F&#228;higkeit haben dieses System an ihre Bed&#252;rfnisse zu adaptieren. Seit zwei Jahren haben die verschiedenen Partner zwei Entwicklungzyklen in Auftrag gegeben. Die Server-Seite des Systems wird durch Pyramid (Python Webframework), MapFish, MapFish-print und MapServer angetrieben. Die Konfiguration der Layer und Themen des Geoportals ist in einer PostGIS Datenbank abgelegt und mit einem Administrationsystem konfigurierbar. Auf der Clientseite werden nur Javascript und HTML-Komponenten verwendet. Eine High-Level-Bibliothek wurde entwickelt namens CGXP. Die gr&#246;&#223;te Herausforderung und einmalige Erfahrung ist die Gruppierung der verschiedenen Teilnehmer mit sehr unterschiedlichen Bed&#252;rfnissen.

Dieser Vortrag wird erl&#228;utern, wie diese User Gruppe zu Stande gekommen ist, wie die Zusammenarbeit innerhalb einer flexiblen Private-Public Partnerschaft organisiert ist, welche Vorteile einer solchen Organisation im Bereich Open Source Software Entwicklung bringen und welche Ergebnisse (WebGIS Projekt) erreicht wurden.</abstract>
        <description></description>
        <persons>
          <person id="317">Michael Kalbermatten</person>
        </persons>
        <links>
        </links>
      </event>
    </room>
    <room name="5.003">
    </room>
    <room name="3.008">
      <event id="538">
        <start>15:30</start>
        <duration>00:30</duration>
        <room>3.008</room>
        <slug></slug>
        <title>OpenTopoMap</title>
        <subtitle>topographische Karten aus OpenStreetMap</subtitle>
        <track>Vortr&#228;ge (OSM)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Das Projekt OpenTopoMap stellt eine Karte aus den Daten der OpenStreetMap zur Verf&#252;gung, welche sich am Stil der amtlichen topographischen Karten der deutschen Landesvermessung orientiert. Eine Verf&#252;gbarkeit f&#252;r ganz Europa ist angestrebt.
OSM-Daten werden gefiltert und in eine PostgreSQL-Datenbank eingespeist. Mit Mapnik 2.1 werden drei Ebenen einzeln gerendert und mittels ImageMagick zu einer Kachel vereinigt &#8211; der zweite Layer, die H&#246;henlinien, werden dabei einmalig vorgerendert, wodurch der Renderdurchsatz verzehnfacht wird.
Ziel des Projektes ist es, eine Karte hervorzubringen, welche wie das amtliche Kartenmaterial f&#252;r universelle Zwecke eingesetzt werden kann, beispielsweise sowohl zur Orientierung im Innenstadtbereich wie auch als Wanderkarte. Hierzu wird zwischen Detailreichtum und Lesbarkeit f&#252;r jede Zoomstufe in aufw&#228;ndiger Kleinarbeit die passendste L&#246;sung gesucht und umgesetzt. Zugleich sind erste Ans&#228;tze zur Generalisierung enthalten.
OpenTopoMap arbeitet eng mit der Universit&#228;t Erlangen-N&#252;rnberg zusammen: ein Gro&#223;rechner ist am Rechenzentrum der Universit&#228;t angesiedelt und steht auch f&#252;r mit dem Projekt verkn&#252;pften Forschungsarbeiten zur Verf&#252;gung, welche sich aus der Kooperation zwischen den Instituten f&#252;r Geographie und Informatik ergeben. Das Projekt ist &#252;ber Github ver&#246;ffentlicht, und die freiwilligen Entwickler freuen sich weiterhin auf Verbesserungsvorschl&#228;ge anderer Nutzer. Im Vortrag wird das Projekt selbst vorgestellt sowie auf die technische Umsetzung kartographischer Details eingegangen.</abstract>
        <description></description>
        <persons>
          <person id="325">Philipp Hochreuther</person>
        </persons>
        <links>
          <link href="http://opentopomap.org">http://opentopomap.org</link>
        </links>
      </event>
      <event id="597">
        <start>16:00</start>
        <duration>00:30</duration>
        <room>3.008</room>
        <slug></slug>
        <title>Datenqualit&#228;t von OSM in der Schweiz</title>
        <subtitle></subtitle>
        <track>Vortr&#228;ge (OSM)</track>
        <type></type>
        <language>de</language>
        <abstract> Eine immer wiederkehrende Frage ist, wie gut sind die OSM Daten? Dieser Vortrag soll einige Aspekte der Qualit&#228;t und Vollst&#228;ndigkeit der OSM Daten in der Schweiz beleuchten. Die Schweiz ist kein grosses Land, und trotzdem zeigt sich die f&#252;r OSM typische grosse Bandbreite: Es gibt sehr detailliert gemappten Gebiete, aber auch solche, wo erst das Hauptstrassennetz und ein paar von Luftbildern mit schlechter Aufl&#246;sung abgezeichnete W&#228;lder verf&#252;gbar sind.

OSM bietet vielen geographischen Features Platz. Wichtig ist sicherlich das Strassennetz, welches Routing erm&#246;glicht und h&#228;ufig auch den Hintergrund f&#252;r Spezialkarten darstellt. F&#252;r die Adresssuche braucht es Strassennamen, aber auch die Administrativen Einheiten. Dann gibt es noch eine breite Palette von Points of Interest: Bushaltestellen, Restaurants, Hotels. Aber auch Brunnen (mit oder ohne Trinkwasser) oder markante B&#228;ume. Dazu kommen noch Informationen die f&#252;r Spezialkarten Verwendung finden wie Wanderwege, Skipisten oder Skatingrouten.

Im Vortrag wird f&#252;r einige ausgew&#228;hlte Aspekte versucht eine quantitative Bewertung der Qualit&#228;t des OSM-Datenbestandes in der Schweiz darzulegen und deren Entwicklung aufzuzeigen. Als Vergleichsgrundlage dazu werden wo m&#246;glich offizielle Daten verwendet wie zum Beispiel das Eidgen&#246;ssische Geb&#228;ude- und Wohnungsregister f&#252;r die Strassennamen. </abstract>
        <description></description>
        <persons>
          <person id="352">Michael Spreng</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="589">
        <start>16:30</start>
        <duration>00:30</duration>
        <room>3.008</room>
        <slug></slug>
        <title>Das OpenStreetMap-Datenmodell</title>
        <subtitle></subtitle>
        <track>Vortr&#228;ge (OSM)</track>
        <type>lecture</type>
        <language></language>
        <abstract>Auf den ersten Blick scheint OpenStreetMap ein sehr einfaches Datenmodell zu benutzen. Es gibt Nodes, Ways und Relations mit freien Tags. Das war es schon.  Aber wenn man etwas genauer schaut, dann findet man hinter diesem einfachen Grundmodell ein komplexes Gebilde von Konventionen, die manchmal dokumentiert sind, vielfach aber nur in den K&#246;pfen der Mapper existieren. Daneben f&#252;hrt die Interpretation der Daten durch vorhandene Software vielfach zu weiteren Regeln, die man eigentlich dem Datenmodell zuordnen muss.  All dies f&#252;hrt zu einem ziemlich komplexen Datenmodell, dass jeder verstanden haben muss, der intensiver mit OSM-Daten arbeitet. Die simple Welt der OSM-Grundobjekte mit ein paar Tags ist eine Illusion.

Der Vortrag zeigt anhand der existierenden OSM-Daten, welche Einfl&#252;sse unser Datenmodell gepr&#228;gt haben, was damit ausgedr&#252;ckt werden kann und wo seine Beschr&#228;nkungen liegen. Er versucht aus den einzelnen Aspekten von Tagging-Konventionen, &#252;ber komplexe Relations bis zu implizierten, aber nicht wirklich modellierten Zusammenh&#228;ngen einen Eindruck davon zu geben, wie unser Datenmodell eigentlich aussieht und wie es sich weiterentwickeln kann. Der Vortag richtet sich an alle "Mapper" und alle, die OSM-Daten nutzen oder nutzen wollen und die sich schonmal gefragt haben, warum das eigentlich oft so schwierig ist.

</abstract>
        <description></description>
        <persons>
          <person id="2">Jochen Topf</person>
        </persons>
        <links>
          <link href="http://ftp5.gwdg.de/pub/misc/openstreetmap/FOSSGIS2013/FOSSGIS13-589-de-osm-datenmodell.mp4">Aufzeichnung des Vortragres</link>
        </links>
      </event>
      <event id="609">
        <start>17:00</start>
        <duration>00:30</duration>
        <room>3.008</room>
        <slug></slug>
        <title>Wer ist der Boss bei OpenStreetMap?</title>
        <subtitle>Meinungsbildung und Entscheidungsfindung in einem offenen Projekt</subtitle>
        <track>Vortr&#228;ge (OSM)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>F&#252;r Aussenstehende - und selbst f&#252;r viele aktive Mapper - ist es nicht immer ganz klar, wohin sich das Schiff OpenStreetMap bewegt und wie man vielliecht ein kleines bisschen Einfluss auf den Kurs nehmen kann. Es gibt eine OpenStreetMap Foundation, Working Groups, Local Chapters, und eine riesige Community, die von Organisation relativ wenig wissen will. Es gibt Entwickler, die tun was sie wollen, und andere Entwickler, die im Auftrag von kommerziellen oder nichtkommerziellen Organisationen an OSM mitarbeiten. 

Dieser Vortrag soll einen &#220;berblick &#252;ber die vorhandenen und fehlenden Entscheidungs- und Machtstrukturen im Projekt geben und wird auch ein paar Prognosen f&#252;r die Zukunft wagen.
</abstract>
        <description></description>
        <persons>
          <person id="95">Frederik Ramm</person>
        </persons>
        <links>
        </links>
      </event>
    </room>
    <room name="3.010">
      <event id="505">
        <start>15:30</start>
        <duration>00:30</duration>
        <room>3.010</room>
        <slug></slug>
        <title>Atlas der Schweiz &#8211; online</title>
        <subtitle>3D Visualisierung von Geodaten in Echtzeit</subtitle>
        <track>Vortr&#228;ge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Digitale Atlanten und damit auch der ATLAS DER SCHWEIZ m&#252;ssen neue Wege einschlagen, um gegen&#252;ber frei verf&#252;gbaren, kostenlosen Kartendiensten, Geo&#172;portalen und Virtuellen Globen konkurrenzf&#228;hig zu bleiben. Eine Analyse dieser Geovisualisierungsprodukte hat gezeigt, dass die Mehrzahl der Anwendungen prim&#228;r f&#252;r den Einsatz im Web konzipiert ist. Die Attraktivit&#228;t solcher Produkte basiert auf dem unmittelbaren Nutzen im Alltag, der Aktualit&#228;t der Daten und den integrativen M&#246;glichkeiten. Anwen&#172;dungen auf der Basis von Virtuellen Globen bestechen zudem durch die intuitiv navigierbare Drei-dimensionalit&#228;t. Die inhaltliche und kartografische Qualit&#228;t dieser Appli&#172;ka&#172;tionen ist hingegen sehr heterogen; oft fehlt auch eine atlasspezifische Funktionalit&#228;t.
Die grosse Herausforderung und das Ziel des ATLAS DER SCHWEIZ ist es, einen Webatlas zu entwickeln und bereitzustellen, welcher hochqualitative 2D- und 3D-Visualisierungen und Interaktionen in Echtzeit unterst&#252;tzt. Als Visualisierungs-Engine wird dabei die OpenSource-Software osgEarth eingesetzt. Dieser auf OpenSceneGraph basierende Virtuelle Globus bietet u.a. eine breite Palette an Visualisierungs- und Navigations-techniken, die Kombination von H&#246;henmodellen, die Einbindung diverser Datenformate und Webservices, sowie verschiedene geografische Referenzsysteme an.
Der Vortrag zeigt anhand von Beispielen und einer Life-Demo unseres online 3D-Atlas-Prototyps auf, wie kartografisch aufbereitete Geoinformationen mit osgEarth visualisiert werden k&#246;nnen und welche Chancen und Herausforderungen sich dadurch ergeben.</abstract>
        <description></description>
        <persons>
          <person id="310">Ren&#233; Sieber</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="577">
        <start>16:00</start>
        <duration>00:30</duration>
        <room>3.010</room>
        <slug></slug>
        <title>Rendering und Bereitstellung massiver Geodaten unter Verwendung von OpenWebGlobe und MapCache in der Cloud</title>
        <subtitle></subtitle>
        <track>Vortr&#228;ge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract>Dieser Beitrag befasst sich mit der Aufbereitung, Speicherung, Bereitstellung und Nutzung von globalen Geodaten. Unter Verwendung der Technologien OpenWebGlobe und MapCache wird eine Architektur und eine Implementierung eines Dienstes zum Betrieb eines Geobrowsers mit globalen Daten in einer Web-Cloud Umgebung vorgestellt.</abstract>
        <description>Generierung und Nutzung von interaktiven geographischen 3D Daten &#252;ber das World Wide Web (WWW) ist seit der Entstehung des WWW vor 20 Jahren eine Bestrebung. Abgesehen von diversen fr&#252;hentwickelten Formaten wie VRML (Bell 1995) und GeoVRML (Reddy et al. 2000) waren die meisten Ans&#228;tze auf den Einsatz von propriet&#228;rer Software sowie sehr speicheraufw&#228;ndige Hardware angewiesen, so dass der Betrieb eines solchen Systems mit erheblichem Aufwand und Kosten verbunden war. Vor allem die Speicherung und Bereitstellung von grossen prozessierten Datens&#228;tzen globaler Ausdehnung ist auch heute noch eine Herausforderung, da nebst der kontinuierlich wachsenden Speicherangeboten auch die Genauigkeit der Daten und somit der Speicherverbrauch steigt.
Mit der Entstehung des WebGL Standards (Marrin 2011) bietet sich nun ein universeller Mechanismus zur Nutzung von riesigen virtuellen 3D Welten mit unz&#228;hligen 3D Modellen und Bilddaten direkt in einem herk&#246;mmlichen Webbrowser an. Anbetracht der Prozessierung solcher Datenmengen entstanden in den letzten Jahren on-demand-processing Architekturen zur selektiven Aufbereitung von Geodaten auf sogenannten Webcloud Services (Wang et al., 2009).
WebGL ist ein plattformunabh&#228;ngiger, offener Webstandard f&#252;r eine low-level 3D Programmierschnittstelle (API) basierend auf OpenGL ES 2.0. Ein HTML5 Canvas Element dient dabei als Schnittstelle zum HTML Document Object Model (DOM). WebGL nutzt dabei die OpenGL Shading Language (GLSL) in &#228;hnlicher Form wie dies bei der OpenGL ES 2.0 API der Fall ist. Dabei wird den Eigenschaften von Javascript als Programmiersprache mit automatischer Speicherverwaltung Rechnung getragen (Khronos 2012). Mit WebGL ist es nun m&#246;glich out-of-core Rendering in einem g&#228;ngigen Webbrowser zu realisieren. Dies erlaubt es, massive 3D Geometrie &#252;berlagert mit globalen Bilddaten als virtuellen Globus darzustellen.  Das Projekt OpenWebGlobe (www.openwebglobe.org), initiiert vom Institut Vermessung und Geoinformation (IVGI) der Fachhochschule Nordwestschweiz (FHNW)  in Muttenz, ist eine quelloffene virtuelle Globus Technologie basierend auf WebGL, die aus der langj&#228;hrigen Erfahrung mit 3D Geobrowsern des Instituts entstanden ist.
Eine speichereffiziente cloud-basierte Datenaufbereitung und Bereitstellung der Daten ist seit einiger Zeit im Fokus von webbasierten Geobrowsern. Dieses Dokument pr&#228;sentiert einen on-demand Ansatz zur Bereitstellung von globalen Datens&#228;tzen wie OpenStreetMap, SRTM und Landsat. Unter anderem kommt dabei eine modifizierte Version der quelloffenen Technologie MapCache (MapCache, 2013) in der Amazon Cloud zum Einsatz.</description>
        <persons>
          <person id="322">Robert W&#252;est</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="545">
        <start>16:30</start>
        <duration>00:30</duration>
        <room>3.010</room>
        <slug></slug>
        <title>3D-SlippyMap</title>
        <subtitle>Rendering einer 3D-Deutschland-Karte mit Hilfe von OSM2World</subtitle>
        <track>Vortr&#228;ge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Die Darstellung von OpenStreetMap-Daten in Webseiten geschieht in den sogenannten Slippymaps. Diese Javascript-Anzeige holt sich dabei dynamisch die anzuzeigenden Kacheln von einem Server. Je nach Kartenart und Stil sind dies unterschiedliche Dienste. So auch die OSM2World-Karte, eine 3D-Darstellung von Deutschland.

Das Ausliefern der Kacheln geschieht dabei oft mit renderd oder tirex. Beiden gemein ist das effektive Caching und on-the-fly Rendern der ben&#246;tigten Kacheln. Auf diese Art muss nur ein sehr kleiner Teil der Kacheln (unter 2%) auf der Platte vorgehalten werden.

Was aber, wenn das verwendete Renderprogramm zu langsam f&#252;r einen Livebetrieb ist? Dieser Vortrag bietet interessante Einblicke in die Herausforderungen, Probleme und L&#246;sungsans&#228;tze im Falle der OSM2World-Slippymap. So wird zum einen die Toolchain von Datenaufbereitung bis zur fertigen Kachel vorgestellt und auch einige interessante Ans&#228;tze gezeigt, die in der Vergangenheit immer wieder die Performance verbesserten. Zum anderen werden identifizierte Hardwaregrenzen besprochen und M&#246;glichkeiten, diese auszureizen bzw. zu &#252;berwinden erkl&#228;rt. Im Ausblick werden Ideen zur Performancesteigerung genannt, die in weiteren Entwicklungen angedacht sind.</abstract>
        <description></description>
        <persons>
          <person id="334">Peter Barth</person>
        </persons>
        <links>
          <link href="http://maps.osm2world.org">OSM2World-SlippyMap</link>
        </links>
      </event>
      <event id="601">
        <start>17:00</start>
        <duration>00:30</duration>
        <room>3.010</room>
        <slug></slug>
        <title>Flexibles System zur geostatistischen Visualisierung</title>
        <subtitle>am Beispiel von &#8222;Personalized&#160;Pollen&#160;Profiling&#8220; Daten</subtitle>
        <track>Vortr&#228;ge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>In diesem Beitrag soll ein System vorstellt werden, welches eine einfache und flexible Visualisierung von geostatistischen Analysen erm&#246;glicht.&#160;Beispielhaft soll die Anwendung &#160;anhand von &#8222;Personalized&#160;Pollen&#160;Profiling&#8220; Daten dargestellt werden. Die Daten repr&#228;sentieren Informationen zu Pollen,&#160;welche durch ein Ger&#228;t,&#160;welches der Patient am K&#246;rper tr&#228;gt,&#160;aufgenommen werden. Diese werden&#160;anschlie&#223;end&#160;automatisch klassifiziert und k&#246;nnen anhand der Metainformation&#160;des Ger&#228;tes r&#228;umlich zugeordnet werden. Die so gewonnenen Messwerte sollen dann geostatistisch visualisiert werden.

F&#252;r das Bereitstellen der&#160;unterschiedlichen&#160;digitalen&#160;Kartenlayer&#160;wird&#160;ein Web Mapping Service (WMS) verwendet. Die geostatistischen Analysen&#160;werden&#160;allerdings &#252;ber Web Processing Services&#160;zur Verf&#252;gung gestellt.&#160;Daf&#252;r&#160;wird ein System vorgestellt, welches eine hohe Flexibilit&#228;t hinsichtlich&#160;seiner bereitstehenden Services (Cascading/Nested&#160;WPS) bietet und in einen WMS-Request Workflow&#160;integriert werden kann.&#160;Zudem wird der WPS nicht vom Client direkt angefragt, sondern das Ergebnis &#252;ber den WMS zur Verf&#252;gung gestellt.&#160;Somit l&#228;sst sich&#160;das Ergebnis auch &#252;ber eine&#160;Style-Definition manipulieren.&#160;Auch&#160;vereinfachen die klassischen WMS-Requests&#160;die Client-Entwicklung und verlagern die komplexere WPS-Request-Logik auf den Server.

Das System wird im Zuge eines Forschungsprojektes am i3mainz &#8211; Institut f&#252;r Raumbezogene Informations- und Messtechnik entwickelt und baut vollst&#228;ndig auf freier Software auf.</abstract>
        <description></description>
        <persons>
          <person id="330">Nikolai Bock</person>
        </persons>
        <links>
        </links>
      </event>
    </room>
    <room name="1.269 (WS)">
    </room>
    <room name="1.271 (WS)">
    </room>
    <room name="1.208 (WS)">
      <event id="490">
        <start>15:30</start>
        <duration>01:30</duration>
        <room>1.208 (WS)</room>
        <slug></slug>
        <title>GRASS GIS Workshop</title>
        <subtitle>Ein praktischer Einstieg </subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language></language>
        <abstract>Der Workshop gibt einen &#220;berblick &#252;ber die umfangreichen Funktionalit&#228;ten von GRASS GIS und vermittelt anhand eines praktischen Workflows, wie man auf einfache Art und Weise eine Arbeitsumgebung erstellt, Analysen durchf&#252;hrt und eine ansprechende Karte erzeugt.
</abstract>
        <description>Das Programm:

* &#220;berblick zu den GRASS Funktionalit&#228;ten
* Wie arbeitet man am effektivsten mit der Software
* Wie erstellt man eine Arbeitsumgebung
* Einfache Analysebeispiele f&#252;r Raster- und Vektordaten
* Erstellen einer druckfertigen Karte
</description>
        <persons>
          <person id="9">Otto Dassau</person>
        </persons>
        <links>
        </links>
      </event>
    </room>
    <room name="1.208a (WS)">
      <event id="489">
        <start>15:30</start>
        <duration>01:30</duration>
        <room>1.208a (WS)</room>
        <slug></slug>
        <title>Geodaten aus dem Netz in QGIS nutzen</title>
        <subtitle>OSM-Daten, Google-Luftbilder und andere Online-Daten in QGIS verarbeiten</subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language>de</language>
        <abstract>Geodaten gibt es jede Menge im Netz. Nur wie bekommt man Sie zur Weiterverarbeitung ins GIS. In einem Workshop mit der Software QGIS k&#246;nnen die Teilnehmer lernen, wie Sie
- aus dem Google-Satelite-Angebot hochaufl&#246;sende Luftbilder zusammenbauen: Abspeichern von Einzelst&#252;cken, zusammenf&#252;gen und umprojizieren
- OSM-Daten importieren und f&#252;r die Visusaliserung und Weiterverarbeitung im GIS aufbereiten, insbesondere Extraktion einzelner Themen (Geb&#228;ude, Waldfl&#228;chen etc.)sowie Visualisierung im QGIS mit Hilfe der regelbasierten Darstellung,
- Nutzung von SRTM-H&#246;hendaten
- Einbindung von WMS- und WFS-Diensten</abstract>
        <description>Es sind jede Menge Geodaten &#252;ber das Netz verf&#252;gbar. Quantum-GIS verf&#252;gt &#252;ber verschiedenste Werkzeuge, diese Daten einzubinden und zu visualisieren. Dazu geh&#246;ren WMS- und WFS-Dienste sowie die Einbindung der Angebote von Google und OpenStreetmap &#252;ber die OpenLayers-Erweiterung. Der Workshop beginnt mit &#220;bungen zur Einbindung von WMS- und WFS-Diensten sowie zur Nutzung des OpenLayers-Plugin.

F&#252;r den Nutzer besonders spannend ist es jedoch, Daten dieser Dienste auf der eigenen Festplatte weiterzuverarbeiten. Quantum-GIS erm&#246;glicht es nicht nur, die &#252;ber OpenLayers eingebundenen Daten hochaufl&#246;send zu visualisieren - sondern auch den hochaufl&#246;senden Bildschirminhalt als georefrenziertes Bild abzuspeichern. Ein Mosaik einzeln abgespeicherter Ansichten l&#228;sst sich anschlie&#223;end mit Hilfe der GDAL-Tools zu einem neuen "Orthophoto" zusammensetzen und in ein beliebiges Koordinatensytem umprojizieren. Dies funktioniert ebenso f&#252;r Google-Satellitenbilder wie f&#252;r OSM-Karten. Den Arbeitsablauf zur Erstellung hochaufl&#246;sender lokaler Rasterdaten aus OpenLayers-Ansichten im QGIS k&#246;nnen die Teilnehmer/innen des Workshops Schritt f&#252;r Schritt erlernen.

OSm bietet nicht nur fertige Karten, sondern auch die Rohdaten zum herunterladen an. Im Quantum-GIS lassen sich diese Daten f&#252;r eigene Projekte weiterverarbeiten. Im Workshop lernen die Teilnehmer/innen, wie Sie die OSM-Daten in gisg&#228;ngige Formate (SpatiaLite, Shapefile; PosGis) konvertieren sowie anschlie&#223;end visualisieren und weiterverarbeiten k&#246;nnen. Mit Hilfe von SQL-Abfragen werden Themen (Gemeindegrenzen,Geb&#228;ude, Waldfl&#228;che etc.) extrahiert. Die Visualiserug der OSM-Daten in eigene thematische Karten unter Auswertung der tags bei Verwendung der "regelbasierten Darstellung" nimmt einen gro&#223;en Teil des Workshops ein.

Im dritten Teil des Workshops lernen die Teilnehmer sich H&#246;hendaten des SRTM-Projektes aus dem Netz beschaffen und zu H&#246;henlinien, Schattenreliefs etc. zu verarbeiten.
Ein Script des Workshops folgt im Januar</description>
        <persons>
          <person id="12">Claas Leiner</person>
        </persons>
        <links>
          <link href="http://cms.uni-kassel.de/asl/fb/einrichtungen/geo-info/allgemein.html">Serviceportal GIS- und Geodaten am FB 06 der Uni Kassel</link>
        </links>
      </event>
    </room>
    <room name="1.212 (WS)">
      <event id="620">
        <start>15:30</start>
        <duration>01:30</duration>
        <room>1.212 (WS)</room>
        <slug></slug>
        <title>Geo-Visualisierung im Web mit D3 und TopoJSON</title>
        <subtitle></subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language>de</language>
        <abstract>D3.js ist eine JavaScript-Bibliothek, mit der Dokumente durch Daten manipuliert
werden k&#246;nnen. D3 erm&#246;glicht es uns, mittels Web-Standards wie HTML, SVG und CSS
unsere Daten dynamisch zu visualisieren.

TopoJSON ist ein Format f&#252;r Geodaten, welches optimiert ist f&#252;r die Darstellung im
Web. Als Weiterentwicklung von GeoJSON erlaubt es, Topologien zu encodieren,
geometrische Redundanzen zu eliminieren und bietet somit komprimiertere
Geometrie-Repr&#228;sentationen. Die Speicherplatzersparnis gegen&#252;ber GeoJSON ist
&#252;blicherweise bei etwa 80%.

Wir werden in diesem Workshop diese beiden Tools an der Vorfront der
Web-Standard-basierten (Geo-)Visualisierung kennen lernen. Dazu erstellen wir eine
kleine Anwendung und betrachten weiterf&#252;hrende M&#246;glichkeiten.

Ein Grundlegendes Verst&#228;ndnis von JavaScript, HTML und CSS wird vorausgesetzt. Wer
selbst TopoJSON-Dateien erstellen will, ben&#246;tigt eine laufende Installation von
Node.js.</abstract>
        <description></description>
        <persons>
          <person id="367">Jeremy Stucki</person>
        </persons>
        <links>
        </links>
      </event>
    </room>
  </day>
  <day date="2013-06-13" index="2">
    <room name="Aula / 4.1000">
    </room>
    <room name="5.001">
      <event id="559">
        <start>09:00</start>
        <duration>00:30</duration>
        <room>5.001</room>
        <slug></slug>
        <title>Neuentwicklungen in Quantum-GIS</title>
        <subtitle></subtitle>
        <track>Vortr&#228;ge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract>Das QGIS Projekt hat letzten Sommer die Version 1.8 ver&#246;ffentlicht. Da QGIS eine &#228;usserst aktive Entwicklergemeinschaft hat, hat sich seit 1.8 bereits viel getan. Dieser Vortrag zeigt die wichtigsten Neuerungen und gibt einen Ausblick auf die zuk&#252;nftige Version 2.0.</abstract>
        <description></description>
        <persons>
          <person id="319">Marco Hugentobler</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="493">
        <start>09:30</start>
        <duration>00:30</duration>
        <room>5.001</room>
        <slug></slug>
        <title>QGIS-Eingabemasken f&#252;r PostGIS-Layer leicht gemacht</title>
        <subtitle>Das QGIS-Plugin DataDrivenInputMask</subtitle>
        <track>Vortr&#228;ge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>In relationalen Datenbanken k&#246;nnen komplexe Sachverhalte konsistent und redundanzfrei gespeichert werden. Da sie auch Geometrien speichern k&#246;nnen, bieten sie sich als zentrale Datenspeicher f&#252;r Geodateninfrastrukturen an. Sie erm&#246;glichen es auch, komplexere Sachverhalte und Abl&#228;ufe zu modellieren, weshalb zu einzelnen Geometrieobjekten h&#228;ufig eine Vielzahl von Sachdaten gespeichert wird. Selbst bei an sich einfachen Sachverhalten sind als Folge der Normalisierung meistens mehrere Tabellen mit Beziehungen unterschiedlicher Kardinalit&#228;t beteiligt. 
PostgreSQL/PostGIS ist als relationale Datenbank im FOSSGIS-Bereich weit verbreitet. Damit Nutzer Daten eingeben und pflegen k&#246;nnen, sind entsprechende Eingabemasken im Front-End n&#246;tig. QGIS 2.0 bietet bereits viele M&#246;glichkeiten der Anpassung eines Layers an die Datenmodellierung an.
Das QGIS-Plugin DataDrivenInputMask erzeugt Eingabemasken f&#252;r PostgreSQL-Layer zur Laufzeit. Mit ihnen k&#246;nnen die Daten des Layers selbst, aber auch die aller verbundenen Relationen &#8211; egal welcher Kardinalit&#228;t &#8211; bearbeitet werden. Das Plugin fragt dazu Systemkataloge der Datenbank ab und setzt Informationen &#252;ber Datentypen und Constraints automatisch in entsprechende Bearbeitungselemente um. Es entsteht kein Aufwand durch die Einrichtung des Layers oder die Programmierung eines Plugins. Insbesondere entspricht die Datenmaske stets dem Stand der Datenmodellierung in der Datenbank.
Die Funktionalit&#228;t steht als eigenes Plugin zur Verf&#252;gung, kann aber auch in andere Plugins importiert werden, um dort wiederum Datenmasken bereitzustellen und bietet sich f&#252;r alle QGIS-Nutzer an, die komplexere Datenmodelle in PostgreSQL/PostGIS realisieren und daf&#252;r keine eigenen Eingabemasken programmieren k&#246;nnen oder wollen.</abstract>
        <description></description>
        <persons>
          <person id="299">Bernhard Str&#246;bl</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="532">
        <start>10:00</start>
        <duration>00:30</duration>
        <room>5.001</room>
        <slug></slug>
        <title>Das QGEP Abwasser Projekt</title>
        <subtitle></subtitle>
        <track>Vortr&#228;ge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Das QGEP-Projekt hat das Ziel auf Basis von QGIS eine Fachschale f&#252;r die Bereiche Abwasser und GEP (Genereller Entw&#228;sserungsplan) zu erstellen. Die Pr&#228;sentation berichtet &#252;ber den Projektstand, die Probleme und L&#246;sungsans&#228;tze. Da QGEP vermutlich eine der ersten gr&#246;sseren Fachschalen auf Basis von QGIS ist, m&#252;ssen einige Probleme im QGIS-Kern gel&#246;st werden. Diese Entwicklungen kommen dann der generellen Fachschalenentwicklung unter QGIS zugute.</abstract>
        <description>Das QGIS-Projekt [1] erfreut sich zunehmender Beliebtheit bei Beh&#246;rden und Firmen. Allerdings gibt es noch kaum gr&#246;ssere Fachschalen (z.b. f&#252;r die Leitungsdokumentation, Vermessung, oder Raumplanung). Gegen Ende des Jahres 2011 formierte sich eine Gruppe von QGIS Anwendern und Abwasserfachpersonen (Fischer Ingenieure, Arbon; Holinger, Oberhofen/Thun; SJiB Software, Informations-Management Beratung Z&#252;rich) um gemeinsam mit der Firma Sourcepole und einigen Gemeinden (Morges, Uster, Vevey) eine Fachschale auf QGIS-Basis f&#252;r die Bereiche Werkinformation und Leitungskataster Abwasser und GEP (Generelle Entw&#228;sserungsplanung) zu entwickeln. Ziel der Gruppe ist es eine bestehende und gut funktionierende Fachapplikation auf der technologischen Basis von Arcview 3.x abzul&#246;sen. Ein weiteres Ziel ist es die Vorgaben des Verbandes der Schweizer Abwasserfachleute (VSA) m&#246;glichst getreu und vollst&#228;ndig abzubilden. Viele GIS-Hersteller, die auch international t&#228;tig sind, setzen diese Richtlinien nur mangelhaft um.

Das QGEP Projekt [2] (der Name leitet sich von QGIS und GEP ab) nimmt insofern auch eine Pionierrolle ein, da wie eingangs erw&#228;hnt noch wenige komplexe Fachschalen auf Basis von QGIS entwickelt wurden. So m&#252;ssen im Zuge der QGEP-Entwicklung einige technologische H&#252;rden genommen werden, welche sp&#228;ter auch anderen Fachschalen zugute kommen, wie Datenbankrelationen (1:n, n:m), verschachtelte Formulare, effizientes Editieren von Attributdaten &#252;ber selektierte oder gefilterte Objekte, komplexe datendefinierte Symbolisierung, Netzverfolgung, DXF Export und Import und einiges mehr.

Das Datenmodell wurde vom VSA-DSS Modell [3] &#252;bernommen und in die englische Sprache &#252;bersetzt. S&#228;mtliche Tabellen- und Spaltennamen werden in englisch gef&#252;hrt, es gibt Lokalisierungen der Attributwerte und der Benutzeroberfl&#228;che (GUI) nach deutsch und franz&#246;sisch. Weitere Sprachen k&#246;nnten hinzugef&#252;gt werden. Technologisch gesehen wird auf eine Postgis-Datenbank gesetzt, auf QGIS Desktop, Server und Webclient, sowie auf Python f&#252;r die Programmierung von Plugins und die gezielte Anpassung von Formularen. Umgesetzt wurde auch bereits eine modellbasierte Netzverfolgung (im Gegensatz zu vielfach &#252;blichen grafischen Netzverfolgungen) auf Basis von NetworkX [4] (Python) und eine dynamische Profilgenerierung (interaktiv) um Gef&#228;lle und Dimensionen der Abwasserbauwerke im Kontext der Gel&#228;ndeoberfl&#228;che darzustellen. F&#252;r die Darstellung des interaktiven Kanalprofils kommt d3.js [5] innerhalb eines Browser-Bereichs (Webkit) zum Einsatz.

Ziel ist es bis im Juni 2013 produktiv den Werkplan Abwasser editieren und nachf&#252;hren zu k&#246;nnen. Danach soll die Fachschale laufend erg&#228;nzt werden durch Werkzeuge f&#252;r Erfassung, Bearbeitung, Darstellung, Analysen und Auswertungen aus dem GEP-Bereich wie Einzugsgebiete, Sonderbauwerke, Versickerung, Gew&#228;sser, Export in Simulationssoftware, Interlis- und DXF Export, etc.

Die Pr&#228;sentation zeigt den aktuellen Stand, sowie die Baustellen und Probleme bei der Umsetzung der Fachschale.

Als Open Source Projekt steht die Mitbeteiligung und Entwicklung weiteren Firmen, Gemeinden / Kommunen, St&#228;dten oder Kantonen offen.


Links
[1] http://www.qgis.org/ - QuantumGIS (QGIS) Projekthomepage
[2] https://github.com/qgep/QGEP &#8211; Projekthomepage mit Code, Wiki und Issues
[3] http://dss.vsa.ch/  - Datenstruktur Siedlungsentw&#228;sserung des VSA (Verband Schweizer Abwasser- und Gew&#228;sserschutzfachleute)
[4] http://networkx.github.com/ - High-productivity software for complex networks
[5] http://d3js.org/ - Data-Driven Documents.</description>
        <persons>
          <person id="79">Andreas Neumann</person>
          <person id="373">Matthias Kuhn</person>
        </persons>
        <links>
          <link href="http://www.vsa.ch/fachbereiche-cc/siedlungsentwaesserung/vsa-dss/">VSA-DSS Abwasser/GEP Datenstruktur</link>
          <link href="https://github.com/qgep/QGEP">QGEP Github Projekthomepage</link>
          <link href="http://networkx.github.com/">NetworkX Projekt</link>
          <link href="http://d3js.org/">D3.js - Data-driven documents</link>
          <link href="http://">http://</link>
        </links>
      </event>
      <event id="574">
        <start>11:00</start>
        <duration>00:30</duration>
        <room>5.001</room>
        <slug></slug>
        <title>Geoprozessierung mit Open-Source Desktop GIS </title>
        <subtitle>gvSIG CE, SEXTANTE und GRASS GIS</subtitle>
        <track>Vortr&#228;ge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Mit mehreren hundert Modulen zur Geoprozessierung geh&#246;rt gvSIG CE zu den leistungsf&#228;higsten Desktop-GIS auf dem Gebiet der Geodatenverarbeitung und -analyse. Diese umfassende Funktionalit&#228;t ist zum Teil in gvSIG CE selbst implementiert, wird aber zum gr&#246;&#223;ten Teil &#252;ber die Erweiterung SEXTANTE zur Verf&#252;gung gestellt, welche ihrerseits wiederum Konnektoren f&#252;r externe Prozessoren wie GRASS GIS und SAGA GIS zur Verf&#252;gung stellt. Diese mehrschichtige Architektur f&#252;hrt einerseits zu enormer Vielseitigkeit und Flexibilit&#228;t bei der Datenprozessierung, andererseits aber auch zu einer gewissen &#220;berlappung zwischen Modulen, deren einzelne Vor- und Nachteile sich dem Benutzer nicht immer unmittelbar erschlie&#223;en.
Zwar werden die Besonderheiten der Datenhaltung von Systemen wie GRASS GIS so gut wie m&#246;glich vor dem Benutzer von gvSIG CE verborgen, doch sind Bruchstellen zwischen den beteiligten Komponenten nicht g&#228;nzlich vermeidbar. Der Vortrag widmet sich den unterschiedlichen Schichten der Geodatenprozessierung in gvSIG CE und zeigt auf, welche Komponenten sich f&#252;r welche Anforderungen eignen, wobei besonderes Augenmerk auf die (semi-)automatisierte Prozessierung gro&#223;er Datenmengen gerichtet wird. Ein weiterer Schwerpunkt der Ausf&#252;hrungen liegt auf besonderen Anforderungen bei der Qualit&#228;tssicherung, z.B. im wissenschaftlichen und unternehmenskritischen Bereich. Au&#223;erdem werden die wichtigsten Entwicklungslinien der Geoprozessierung unter gvSIG CE diskutiert und die Ziele, sowohl f&#252;r die momentan in Vorbereitung befindliche, als auch f&#252;r zuk&#252;nftige Versionen von gvSIG CE, skizziert.</abstract>
        <description></description>
        <persons>
          <person id="289">Benjamin Ducke</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="596">
        <start>11:30</start>
        <duration>00:30</duration>
        <room>5.001</room>
        <slug></slug>
        <title>Im- und Export von dxf-Daten mit OGR</title>
        <subtitle></subtitle>
        <track>Vortr&#228;ge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract>Eines der gebr&#228;uchlichsten Formate f&#252;r den Austausch von r&#228;umlichen Inhalten ist das &#8220;drawing interchange format&#8221; kurz dxf.Format. Insbesondere wenn f&#252;r die weitere Verwendung der Geodaten ein CAD vorgesehen ist, ist dxf das Format der Wahl.
Der Beitrag behandelt die M&#246;glichkeit, mittels der OGR Simple Feature Library, Geodaten aus einem PostgreSQL/PostGIS Datenbankmanagementsystem in ein dxf-Format zu exportieren. 

In einem geringeren Umfang wird auch das gegenl&#228;ufige Verfahren (Import von dxf-Daten in ein PostgreSQL/PostGIS Datenbankmanagementsystem) behandelt. Der geringere Umfang ist hier weniger einer fehlenden Relevanz geschuldet, sondern auf die Tatsache zur&#252;ck zu f&#252;hren, dass dxf-Daten mitunter deutlich &#252;berladen sind und in diesen F&#228;llen kein befriedigendes Ergebnis zu erzielen ist. Hinzu kommt, dass dxf-Daten ganz erheblich &#252;ber das Styling definiert und komponiert werden. Diese Kombination (r&#228;umliche Definition und Darstellung) wird in der klassischen Geodatenwelt &#252;ber den attributiven Anhang abgebildet und die Darstellung erst im Rahmen der Visualisierung an die jeweilige Applikationen abgetreten.
Die Strukturierung von Geodaten orientiert sich regelm&#228;&#223;ig an den Simpel Feature (Punkt, Linie, Fl&#228;che). Entsprechend werden die Daten dann modelliert. Das dxf-Format kann diese und viele andere Geometrietypen Verarbeiten. Eine strenge Modellierung der Daten nach den Geometrietypen ist dem dxf-Format allerdings fremd. Eine thematisch gebotene Verkn&#252;pfung erfolgt allerdings in beiden Kulturen &#252;ber die Tabelle (GIS) bzw. den Layer (dxf). 

Die Konvertierung dxf&gt;PostgreSQL&gt;dxf wird hier beispielhaft beschrieben. Grunds&#228;tzlich ist die OGR-Bibliothek eine Datendrehscheibe in die verschiedensten Formate und die Verfahrensweise ist abh&#228;ngig vom Ausgangs- und Zielformat sehr &#228;hnlich.

Der Beitrag zeigt die Konfiguration eines Ausgangsdatenbestandes mit einem PostGIS-View. Hierbei wird auf die Besonderheiten des Stylings von Symbolen, Texten und Linien eingegangen. Im Anschluss wird die Steuerung der OGR-Bibliothek dargestellt. 

Das hier beschriebene Verfahren wird &#252;ber Befehlszeilenkommandos gesteuert. Somit richtet sich der Beitrag an erfahrene Anwender und Menschen die Applikationsentwicklungen machen.
</abstract>
        <description></description>
        <persons>
          <person id="31">Harald Schwenk</person>
        </persons>
        <links>
          <link href="http://agentur-geoinfo.de/referenz/Vortrag/FOSSGIS_2013_Vortrag_Import_Export_dxf_ogr.pdf">http://agentur-geoinfo.de/referenz/Vortrag/FOSSGIS_2013_Vortrag_Import_Export_dxf_ogr.pdf</link>
        </links>
      </event>
      <event id="562">
        <start>12:00</start>
        <duration>00:30</duration>
        <room>5.001</room>
        <slug></slug>
        <title>Netzwerkanalysen mit GRASS GIS</title>
        <subtitle>Ein praktischer &#220;berblick</subtitle>
        <track>Vortr&#228;ge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Nahezu jede GIS-Anwendung bietet mittlerweile M&#246;glichkeiten der Netzwerkanalyse auf Basis von Vektordaten.

In GRASS GIS ist das Thema Netzwerkanalyse bereits seit 2006 auf der Agenda und wird seitdem st&#228;ndig weiterentwickelt. Mittlerweile sind es mehr als 10 Algorithmen, um Basisdaten aufzubereiten und unterschiedlichste Fragestellungen zu l&#246;sen. Beispiele k&#246;nnen Laufzeit-/Kostenanalysen durch die Berechnung von Isodistanzen in Kanalsystemen sein, Berechnungen von Zust&#228;ndigkeitsbereiche von Feuerwehren oder Polizeistationen innerhalb einer Region, das Planen/Optimieren von Rundreisen f&#252;r Handlungsreisende oder touristische Ziele oder die optimale Verkn&#252;pfung von Haushalten bei der Neuverlegung von Strom- oder Gasleitungen entlang eines Strassennetzes.

Der Vortrag soll anhand von Beispielen einen Einblick in die M&#246;glichkeiten der Netzwerkanalyse mit GRASS GIS geben. Dabei wird auch darauf eingegangen, worauf bei der Datenaufbereitung geachtet werden sollte und wie man Parameter richtungsabh&#228;ngig zuweisen kann. Als Datengrundlage werden OpenStreetMap Strassendaten verwendet.  </abstract>
        <description></description>
        <persons>
          <person id="9">Otto Dassau</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="602">
        <start>13:30</start>
        <duration>00:30</duration>
        <room>5.001</room>
        <slug></slug>
        <title>MATSim: Open-Source-Verkehrssimulation mit offenen Daten</title>
        <subtitle></subtitle>
        <track>Vortr&#228;ge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract>Simulationen sind ein wichtiges Hilfsmittel f&#252;r die Entscheidungsfindung in der Verkehrsplanung. Allerdings sind sie &#228;u&#223;erst datenhungrig, und die Beschaffung und Nutzbarmachung propriet&#228;rer Daten ist zeitaufw&#228;ndig und teuer, weswegen die Erforschung alternativer, insbesondere offener Datenquellen wichtig ist. 

Daten werden auf zwei Seiten ben&#246;tigt: F&#252;r die Angebotsseite (das Verkehrsnetz) und f&#252;r die Nachfrageseite (das Nutzerverhalten). W&#228;hrend wir auf der Nachfrageseite noch immer haupts&#228;chlich auf schwer zu beschaffende Haushaltsbefragungen und Verkehrsz&#228;hlungen angewiesen sind, sieht es auf der Angebotsseite besser aus. Zumindest in den urbanen R&#228;umen der Industriestaaten ist die Datenlage von OpenStreetMap f&#252;r diese Art von Simulation v&#246;llig ausreichend.

In Sachen offener Daten f&#252;r den &#246;ffentlichen Verkehr ist die aktuelle Ver&#246;ffentlichung erster Fahrplandaten im GTFS-Format ein Durchbruch. Wo diese verf&#252;gbar sind, gibt es in Kombination mit OSM jetzt erstmals die M&#246;glichkeit, ein integriertes MIV- und &#214;V-Simulationsnetz auf Knopfdruck an den Start zu bringen.

In dem Vortrag erkl&#228;re ich, wie planerische Verkehrssimulationen mit der Simulationssoftware MATSim (Freie Software) funktionieren und wie man ein einfaches Szenario aus offenen Daten aufsetzt, insbesondere in Hinblick auf den &#246;ffentlichen Verkehr. Ich berichte auch &#252;ber erste Versuche, den Open-Source-Reiseplaner OpenTripPlanner einzubinden und damit Szenarien mit unterschiedlichen Nutzerpr&#228;ferenzen zu rechnen. 
</abstract>
        <description></description>
        <persons>
          <person id="356">Michael Zilske</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="492">
        <start>14:00</start>
        <duration>00:30</duration>
        <room>5.001</room>
        <slug></slug>
        <title>Bereitstellung hochaufgel&#246;ster Wettervorhersagen f&#252;r Geoportale</title>
        <subtitle></subtitle>
        <track>Vortr&#228;ge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>In dem Beitrag wird gezeigt, wie auf der Grundlage frei verf&#252;gbarer meteorologischer Rohdaten r&#228;umlich und zeitlich hochaufgel&#246;ste Vorhersagekarten f&#252;r verschiedene Wetterph&#228;nomene bereitgestellt und in Geoportalen genutzt werden k&#246;nnen. Der gesamte Workflow ist mit FOSS realisiert.

Zun&#228;chst werden die Motivation, die Rahmenbedingungen, die Rohdaten und das verwendete Wettermodell vorgestellt. Anschlie&#223;end wird die implementierte Servicekette beschrieben. Darin ist der Download der Rohdaten aller sechs Stunden, die Berechnung der Vorhersagedaten f&#252;r Temperatur, Luftdruck, Niederschlag, Luftfeuchte, Bew&#246;lkung, Schneefall, Windrichtung und &#8211;temperatur sowie die Konvertierung und Georeferenzierung dieser Vorhersagedaten enthalten. Darauf baut ein st&#252;ndlich aktualisierter, abfragbarer (GetFeatureInfo) und mit Legenden versehener WMS auf. Das abgedeckte Gebiet, der Vorhersagezeitraum und die r&#228;umliche und zeitliche Aufl&#246;sung sind parametrierbar. Gegenw&#228;rtig werden f&#252;r ein 3,5 * 3,5 km -Raster, welches das Gebiet des Bundeslandes Sachsen abdeckt, Vorhersagekarten f&#252;r einen Zeitraum von jeweils 48 Stunden (in Stundenintervallen) ver&#246;ffentlicht. Der Dienst, dessen Metadaten im s&#228;chsischen GeoMIS recherchierbar sind, kann &#252;ber die WMS Schnittstellen in entsprechende Portale geladen werden.

Die Autoren sind keine Meteorologen, sondern bzgl. Wetterprognosen lediglich &#8222;interessierte Laien&#8220;. Ihnen ging es darum zu zeigen, wie frei zug&#228;ngliche Rohdaten mit FOSS aufbereitet und somit f&#252;r die interessierte &#214;ffentlichkeit verf&#252;gbar gemacht werden k&#246;nnen. </abstract>
        <description></description>
        <persons>
          <person id="298">Frank Schwarzbach</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="621">
        <start>14:30</start>
        <duration>00:30</duration>
        <room>5.001</room>
        <slug></slug>
        <title>OpenLayers 3</title>
        <subtitle>Was ist neu und wie finanziert sich OpenLayers 3</subtitle>
        <track>Vortr&#228;ge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>OpenLayers ist eine der bekanntesten OpenSource WebGIS-Clientbibliotheken.... (folgt!)</abstract>
        <description></description>
        <persons>
          <person id="23">Till Adams</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="539">
        <start>15:30</start>
        <duration>00:30</duration>
        <room>5.001</room>
        <slug></slug>
        <title>Wie wird ein Geoportal der Verwaltung genutzt?: Metrik der Dienste von geo.admin.ch </title>
        <subtitle>Spagat zwischen Feature Creep und Nutzererwartungen</subtitle>
        <track>Vortr&#228;ge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>In den drei Jahren Betrieb haben sich die Dienste von geo.admin.ch, dem Geoportal des Bundes, bei weiten Teilen der Bev&#246;lkerung etabliert. Erwartungen der Endnutzer als auch die Anforderungen an das verwendete OpenSourceFramework und der Lizenzbedingungen der Daten waren und sind die Hauptherausforderung:

-	Welche Funktionen/Dienste werden genutzt &#8211; und wo beginnt der feature creep?
-	Welche Daten finden gr&#246;sste Resonanz &#8211; und bei welche Geoinformationen besteht ein Bedarf?
-	Fazit: FOSS im eGov Geoportal Bereich &#8211; St&#228;rken und Schw&#228;chen

Mit echten, aktuellen Daten aus Nutzungsstatistiken und &#8211;umfragen von geo.admin.ch sind die quantitativen und qualitativen Grundlagen gegeben, um eine sinnvolle Diskussion bez&#252;glich dem ROI von webmapping Diensten zu f&#252;hren. Ein faszinierender Fundus an Daten erlaubt es, einen Blick darauf zu werfen, wie die &#214;ffentlichkeit Geodaten im Web nutzt &#8211; und wo die Trends der FOSSGIS Gemeinschaft hingehen sollen:

-	Webkarten sind f&#252;r eine Mehrzahl der Web-Anwender auch 2013 eine Herausforderung. Bei der Informationsvermittlung (Suche und Resultatedarstellung) ist ein Paradigamawechsel gefordert: Weg vom Expertentool hin zur Suchmaschine  
-	Kartenportale der Verwaltung, eine Kurzvisite: Laden &#8211; betrachten &#8211; Seite verlassen: Der Umgang mit Daten der Verwaltung ist f&#252;r viele B&#252;rger/Endnutzer immer (noch) zu komplex. Einfache L&#246;sungen, die konkrete Fragestellungen beantworten, sind zu bevorzugen.
-	Von Daten zu Karten: Thematisch und kartographisch aufgearbeitete Karten generieren mehr Besucherverkehr als Rohdaten &#8211; sie eignen sich auch besser f&#252;r die Indexierung in Suchmaschinen. Kommunikation der (Geo)daten soll Endnutzer in einfachen aggregierter Form geliefert werden.
-	Auto-complete services garantieren ein positives User Experience: Vorschl&#228;ge von Suchresultaten durch ein einziges Suchfenster sind ein Muss.
-	Attributinfo: Nutzer klicken tats&#228;chlich auf icons - Wenn das icon so aussieht wie ein Google Ballon Icon.
-	Standardeinstellungen werden selten durch Nutzer ge&#228;ndert.
-	Mobile &#8211; responsive design bei Kartenanwendungen ist gefragt
-	Datendienste anstatt Datendownload: Geodaten haben meist kurze Nachf&#252;hrungszyklen. Offene Dienste, basierend auf offenen Standards vereinfachen updates.
-	Datenlizenzstruktur: Herausforderung auf Seite Verwaltung ist die &#8222;Institutional jealousy&#8220; : Die Tendenz von Datenherren, Informationen zur&#252;ckzuhalten und die Zusammenarbeit mit anderen Organisation zu unterdr&#252;cken &#8211; um die volle alleinige Kontrolle &#252;ber die Verwendung der Daten zu behalten. Die L&#246;sungsansatz ist die Betroffenen zum data sharing / Kooperation zu motivieren

Auch wenn Technologie und die gesetzliche Grundlage noch so solide sind, individuellen Aspekte Anwender und Datenherr sind schwer greifbar. Nun h&#228;ngt aber der Erfolg einer effektiven Nutzung von Geoinformation gerade von diesen Aspekten ab. Es geht also darum, institutionelle Widerspr&#252;che zu bereinigen, unter der Ber&#252;cksichtigung, dass jede Institution seine Eigenheiten und Selbstst&#228;ndigkeit bewahren kann, ohne dabei das Ziel der Vernetzung der Datendienste aus den Augen zu verlieren.

Was das WebMapping f&#252;r Verwaltungen ben&#246;tigt: Weniger GIS, mehr nutzerfreundliche auto-complete Funktionen und Suchmaschinenoptimierung: Warum? Der Nutzer will, das Suche und Repr&#228;sentation der Resultate f&#252;r Kartenmaterial wie f&#252;r den Rest des Web funktioniert.

Links: www.geo.admin.ch /map.geo.admin.ch/</abstract>
        <description></description>
        <persons>
          <person id="315">David Oesch</person>
        </persons>
        <links>
          <link href="http://">http://</link>
        </links>
      </event>
      <event id="551">
        <start>16:00</start>
        <duration>00:30</duration>
        <room>5.001</room>
        <slug></slug>
        <title>Umstellung auf bzw. Einsatz von FOSSGIS in der Vorarlberger Landesverwaltung: Technische Betrachtung</title>
        <subtitle>Eine Kombination aus Einsatz und Erfolg</subtitle>
        <track>Vortr&#228;ge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract>Abstract:
Die Umstellung auf FOSSGIS f&#252;r zentrale Bereiche im GIS der Vorarlberger Landesverwaltung (VoGIS) erfolgte zwischen 2009 bis 2012. Die Notwendigkeit technische Rahmenbedingungen zu verbessern, Kenntnisse und Erfahrungen im Bereich OpenSource sowie eine neutrale Einstellung gegen&#252;ber freier Software, hat den Einsatz von FOSSGIS erm&#246;glicht. Umgestellt wurden die Bereiche Webdienste, Datendownload und Standard Desktop GIS.

Es k&#246;nnen folgende Eckpunkte zusammengefasst werden:
- Von zentraler Bedeutung ist ein offenes Datenformat.
- FOSSGIS war nicht vorgegeben, hat sich aber bew&#228;hrt.
- CGI-Mapserver mit Linux als Betriebssystem ist performant und stabil. Linux als Serversystem kann zudem weitere Aufgaben &#252;bernehmen (z.B. SFTP Download, Reverse Proxy,    Bandbreitenkontrolle).
- QGIS als Desktop GIS hat sich als richtige Wahl erwiesen. Derzeit gibt es ca. 400 Installation innerhalb der Landesverwaltung. QGIS ist stabil, sehr gut skalierbar und verf&#252;gt bereits &#252;ber einen gro&#223;en Funktionsumfang.
- Kostenersparnis durch Wegfallen der Lizenzkosten.
- FOSSGIS bedeutet auch Transparenz. Umfangreiche Hilfe kann im Internet zu praktisch fast allen Problemen gefunden werden.
- Freier Informationsaustausch: Unabh&#228;ngige Datenformate und Software sind zukunftstr&#228;chtige Standards.
- FOSSGIS f&#246;rdert den Mehrwert von Geoinformation. Durch die freie Verf&#252;gbarkeit der Anwendungen werden Anforderungen an die Verwaltung wie z.B. Open Government Data oder die Zusammenarbeit mit Dienstleistern ideal unterst&#252;tzt.</abstract>
        <description></description>
        <persons>
          <person id="326">Nikolaus Batlogg</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="536">
        <start>16:30</start>
        <duration>00:30</duration>
        <room>5.001</room>
        <slug></slug>
        <title>FOSS-GIS im Kanton Basel-Landschaft</title>
        <subtitle>ein Erfahrungsbericht</subtitle>
        <track>Vortr&#228;ge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract>Die GIS-Fachstelle Basel-Landschaft begann im Jahr 2010 die Suche nach einer neuen GIS-Infrastruktur. Diese sollte sowohl ein neues Web-GIS wie auch Anbindungsm&#246;glichkeiten f&#252;r die im Kanton bestehenden Desktop-GIS beinhalten. Nach einem ausf&#252;hrlichen Evaluierungsprozess fiel der Entscheid zugunsten von OpenSource. Speziell auf das c2cgeoportal. Nach mehr als 2 Jahren und bereits einiger Zeit in produktivem Betrieb von GeoViewBL, kann die GIS-Fachstelle r&#252;ck- und vorw&#228;rtsgewandt Einblick in dieses Projekt und in Erfahrungen geben.</abstract>
        <description></description>
        <persons>
          <person id="313">Clemens Rudert</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="560">
        <start>17:00</start>
        <duration>00:30</duration>
        <room>5.001</room>
        <slug></slug>
        <title>Von Vektordaten zum Rasterkartenwerk mit QGIS Server</title>
        <subtitle>Erfahrungsbericht &#252;ber die automatisierte Erstellung des Basisplans der amtlichen Vermessung</subtitle>
        <track>Vortr&#228;ge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Die Schweizer Kantone erstellen den sogenannten Basisplan der amtlichen Vermessung, ein Rasterkartenwerk in den Massst&#228;ben 1:5000 und 1:10&#8216;000, das automatisch aus den Vektordaten der amtlichen Vermessung generiert und regelm&#228;ssig neu erstellt wird. Der Kanton Solothurn setzt hierzu QGIS Server und GDAL ein. Der Vortrag beschreibt das gew&#228;hlte Vorgehen und geht auf die besonderen Herausforderungen ein, die dabei auftraten.
In diesem Projekt wird QGIS Server als Renderer eingesetzt, weil die Symbolisierung &#252;ber das GUI von QGIS sehr einfach realisiert werden konnte. Die in Millimetern vorgegebenen Symbolgr&#246;ssen usw. konnten in den meisten F&#228;llen direkt so in QGIS eingegeben werden. Auch komplexe Symbole z.B. f&#252;r Grenzlinien konnten mit dem QGIS-GUI aufgebaut werden. Zudem erlaubt QGIS Server bei der Erstellung der Karten die Steuerung des DPI-Werts, was f&#252;r dieses Projekt wichtig ist. 
Der Plan enth&#228;lt Beschriftungen, die an den Blattr&#228;ndern pr&#228;zis zusammenpassen m&#252;ssen, was mit den M&#246;glichkeiten von QGIS in Kombination mit etwas gr&#246;sser als das eigentliche Kartenblatt gerenderten und danach zugeschnitten Beschriftungsebenen realisiert werden konnte.
Da der Basisplan nicht nur in einer farbigen, sondern auch einer schwarz-weissen Variante erstellt wird, musste im Code von QGIS Server eine Anpassung vorgenommen werden, damit auch schwarz-weisse Bilder (1-Bit-Bilder ohne Antialiasing) erzeugt werden k&#246;nnen.
Der Kartenproduktionsprozess wird von einem Python-Skript gesteuert, welches Kartenbilder von QGIS Server anfordert und sie mit einer Abfolge diverser GDAL-Befehle zu den Kartenbl&#228;ttern zusammensetzt und als GeoTIFFs abspeichert.
Mit dem beschriebenen Vorgehen konnte das Planwerk erfolgreich realisiert werden.</abstract>
        <description></description>
        <persons>
          <person id="337">Andreas Schmid</person>
        </persons>
        <links>
        </links>
      </event>
    </room>
    <room name="5.003">
    </room>
    <room name="3.008">
      <event id="519">
        <start>09:00</start>
        <duration>00:30</duration>
        <room>3.008</room>
        <slug></slug>
        <title>GeoPackage, das Shapefile der Zukunft</title>
        <subtitle>Der kommende OGC Standard f&#252;r den Datenaustausch</subtitle>
        <track>Vortr&#228;ge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Der GeoPackage-Standard ist im Januar 2013 vom OGC als Draft ver&#246;ffentlicht worden. Er vereint die Speicherung von Vektor- und Rasterdaten im verbreiteten SQLite DB-Fileformat. Vektoren werden im SpatiaLite-Format und Rasterdaten wie MBTiles gespeichert. Der kommende Standard und m&#246;gliche Anwendungen werden im Detail vorgestellt.</abstract>
        <description></description>
        <persons>
          <person id="99">Pirmin Kalberer</person>
        </persons>
        <links>
          <link href="http://www.opengeospatial.org/standards/requests/95">GeoPackage Candidate Standard</link>
          <link href="http://www.sqlite.org/">SQLite</link>
          <link href="http://www.gaia-gis.it/gaia-sins/">SpatiaLite</link>
          <link href="https://github.com/mapbox/mbtiles-spec">MBTiles</link>
          <link href="https://github.com/cholmes/gpkg-tiles">https://github.com/cholmes/gpkg-tiles</link>
        </links>
      </event>
      <event id="514">
        <start>09:30</start>
        <duration>00:30</duration>
        <room>3.008</room>
        <slug></slug>
        <title>Werkzeuge zur Nutzung von OpenStreetMap-Daten in GIS</title>
        <subtitle></subtitle>
        <track>Vortr&#228;ge (OSM)</track>
        <type>lecture</type>
        <language></language>
        <abstract>Das Wikipedia-&#228;hnliche OpenStreetMap-Projekt (OSM) liefert Geodaten mit grossem Detailreichtum. Die OSM-Daten erg&#228;nzen damit beh&#246;rdliche Geodaten u.a. mit Restaurants, Rastpl&#228;tzen oder Aussichtspunkte. Doch viele wissen nicht, wie das OSM-Objektmodell aufgebaut ist, wie man OSM-Daten durchsucht oder k&#246;nnen mit dem XML-Rohdatenformat von OpenStreetMap nichts anfangen. 

Zun&#228;chst soll also demonstriert werden, wie man Daten findet (OSM Wiki, Taginfo). Dann wird aufgezeigt, wie man ohne zu programmieren, ohne lokale Installation (und auch ohne Kommandozeilen-Werkzeuge) auf freie Geodaten-Quellen zugreifen oder sie herunterladen kann. Es sind dies u.a. der Desktop-Konverter OGR und der online GeoConverter. Beide konvertieren eine OSM-Datei in ein GIS-Format, so dass sie zug&#228;nglich werden. OpenPOIMap bietet (Schweizer) Points-of-Interest an, die auch als WFS-Service bezogen werden k&#246;nnen. Und mit SpatiaLite-Tools kann man u.a. Strassen- und Bahnnetzwerke importieren und analysieren. 

S&#228;mtliche gezeigten Software-Werkzeuge sind Open Source. Am Schluss kommen auch frei zug&#228;ngliche Webdienste wie das online Overpass API zur Sprache. </abstract>
        <description></description>
        <persons>
          <person id="265">Stefan Keller</person>
        </persons>
        <links>
          <link href="http://giswiki.hsr.ch/Nutzen_von_OpenStreetMap-Daten_in_GIS">http://giswiki.hsr.ch/Nutzen_von_OpenStreetMap-Daten_in_GIS</link>
          <link href="http://openpoimap.ch">http://openpoimap.ch</link>
        </links>
      </event>
      <event id="605">
        <start>10:00</start>
        <duration>00:30</duration>
        <room>3.008</room>
        <slug></slug>
        <title>OSM Daten und MariaDB / MySQL</title>
        <subtitle>Verbesserungen in aktuellen Releases </subtitle>
        <track>Vortr&#228;ge (OSM)</track>
        <type>lecture</type>
        <language></language>
        <abstract>Aktuelle MariaDB- und MySQL-Versionen bieten deutliche Verbesserungen gegen&#252;ber der bisherigen GIS Implementation die bis einschlie&#223;lich MySQL 5.5 im Einsatz war. Erstmals sind so zum Beispiel echte r&#228;umliche Relationen wie "ist enthalten in" oder "&#252;berlappt mit" m&#246;glich statt nur vereinfacht auf die Bounding Boxen (MBR - Minimal Bounding Rectangle") der einzelnen Geometrien zur&#252;ckzugreifen. 

MariaDB und MySQL werden damit zum ersten mal ernsthaft f&#252;r GIS Anwendungen interessant, auch wenn der Funktionsumfang nach wie vor nicht mit dem von zB. PostGIS aufschlie&#223;en kann.

Der Vortrag beschreibt zun&#228;chst den aktuellen Funktionsumfang der GIS Implementationen in den beiden Entwicklungszweigen, einschlie&#223;lich der neuen Features und der Detailunterschieden zwischen aktuellen MariaDB und MySQL Versionen.

Im Anschlu&#223; wird eine f&#252;r das MySQL API angepasste Version des OSM Import-Tools "osm2pgsql" vorgestellt und der vorhandene Funktionsumfang an Hand von Beispielen auf importierten OSM-Daten demonstriert.</abstract>
        <description></description>
        <persons>
          <person id="333">Hartmut Holzgraefe</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="541">
        <start>11:00</start>
        <duration>00:30</duration>
        <room>3.008</room>
        <slug></slug>
        <title>Kort</title>
        <subtitle>Gamified Mobile App f&#252;r die Verbesserung von OpenStreetMap</subtitle>
        <track>Vortr&#228;ge (OSM)</track>
        <type>lecture</type>
        <language></language>
        <abstract>Da OpenStreetMap ein freies Projekt, welches es jedermann erm&#246;glicht, Kartendaten zu nutzen und zu editieren, ist es nicht ausgeschlossen, dass fehlerhafte bzw. unvollst&#228;ndige Daten eingetragen werden. Es gibt verschiedene Tools, die es sich zum Ziel gesetzt haben, solche Fehler zu &#64257;nden und aufzubereiten. Die so aufbereiteten Daten mussten bisher anschliessend manuell verglichen und korrigiert werden.

Zur Behebung dieser Fehler ist die cross-platform Web-App Kort entwickelt worden. Diese ist in JavaScript geschrieben und basiert auf dem Sencha Touch 2 -Framework. Im Backend kommt eine PostgreSQL-Datenbank zum Einsatz. Die komplette Kommunikation ist mit REST-Schnittstellen realisiert. Die Fehlerdaten werden t&#228;glich von KeepRight[1] bezogen.

Mit Kort[2] soll das Verbessern von Karten-Daten auf unterhaltsame Weise erm&#246;glicht werden. Dem Benutzer werden dazu die OpenStreetMap-Fehler auf einer Karte angezeigt. Falls er die L&#246;sung f&#252;r einen dieser Fehler kennt, kann er einen entsprechenden L&#246;sungsvorschlag abgeben. Weitere Spieler der App &#252;berpr&#252;fen daraufhin den Vorschlag auf seine G&#252;ltigkeit. Um die Benutzer zu motivieren, die App regelm&#228;ssig zu verwenden, wurden zahlreiche Spiel-Elemente eingesetzt. So erh&#228;lt ein Benutzer f&#252;r alle Aktionen Punkte (sogenannte Koins), die dann in einer Rangliste zum Vergleich dargestellt werden. Zudem k&#246;nnen Auszeichnungen f&#252;r besondere Leistungen gewonnen werden. Dieser Ansatz ist bekannt unter dem Begri&#64256; Gami&#64257;cation.

[1] http://www.keepright.at
[2] http://www.kort.ch</abstract>
        <description></description>
        <persons>
          <person id="311">Stefan Oderbolz</person>
        </persons>
        <links>
          <link href="http://www.kort.ch">Kort Website</link>
          <link href="http://play.kort.ch">Kort WebApp</link>
        </links>
      </event>
      <event id="496">
        <start>11:30</start>
        <duration>00:30</duration>
        <room>3.008</room>
        <slug></slug>
        <title>Effizientes Mappen von Hausnummern</title>
        <subtitle>Keypad-Mapper 3 in der Praxis</subtitle>
        <track>Vortr&#228;ge (OSM)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Von den 30 Millionen Adressen in Deutschland sind derzeit in OSM nur ca. 10% erfasst. In anderen L&#228;ndern ist der Anteil meist noch geringer.
Adress-Suchmaschinen wie NOMINATIM, aber auch Navigationssysteme, LBS-Anwendungen u.v.m. sind auf hinreichend genaue Adressangaben angewiesen.
Steve Coast, der Gr&#252;nder von OSM, hat erst k&#252;rzlich darauf hingewiesen, da&#223; die noch am Anfang befindliche Erfassung von Adressen in OSM der letzte ernstzunehmende Grund ist, propriet&#228;ren Karten gegen&#252;ber OSM in manchen Mainstream-Anwendungen den Vorrang zu geben.
Eine Unterst&#252;tzung von Mappern beim effizienten Erfassen von Hausnummern und Adressen ist daher w&#252;nschenswert.

Keypad-Mapper 3 ist eine Android-Software, die hocheffizientes Mappen von Hausnummern und Adressen erm&#246;glicht.

Die neue Version 3 wartet mit produktivit&#228;tssteigernden Features auf, die qualitativ hochwertige Datenerfassung mit hohem Durchsatz verbinden.
Die App ist auch von OSM-Einsteigern leicht zu bedienen und daher massentauglich, z.B. f&#252;r Anf&#228;ngerkurse in Schulen, VHS etc.

Im Vortrag soll aufgezeigt werden, wie Keypad-Mapper 3 das Mappen von Hausnummern und Adressen unterst&#252;tzt.


Referent:
Dipl.-Ing. Markus Semm
Gr&#252;nder und Gesch&#228;ftsf&#252;hrer der ENAiKOON GmbH, Berlin (Anbieter von Telematikl&#246;sungen f&#252;r gewerbliche Kunden)
Herr Semm ist einer der Top 1100 Mapper weltweit.
ENAiKOON setzt bei seinen L&#246;sungen ausschlie&#223;lich auf OpenStreetMap und unterst&#252;tzt die Community inhaltlich wie auch finanziell

</abstract>
        <description>Warum Hausnummern / Adressen mappen?
Welche Datenmodelle gibt es f&#252;r Hausnummern und Adressen in OSM?
Historie der Software
Features der Software
Backend-Unterst&#252;tzung des Hausnummern-Mappers durch ENAiKOON OSM-Dienste
Seiteneffekt: Beitrag zum OpenSource Projekt opencellid.org



</description>
        <persons>
          <person id="305">Markus Semm</person>
        </persons>
        <links>
          <link href="http://wiki.openstreetmap.org/wiki/DE:Keypad-Mapper_3">Keypad-Mapper 3 Beschreibung</link>
          <link href="http://www.enaikoon.com">ENAiKOON Homepage</link>
        </links>
      </event>
      <event id="513">
        <start>12:00</start>
        <duration>00:30</duration>
        <room>3.008</room>
        <slug></slug>
        <title>Semi-automatische Adressdatenerfassung</title>
        <subtitle>Erfassung von georeferenzierten Adressdaten aus Fotos von Smartphones unter Einbezug von OSM</subtitle>
        <track>Vortr&#228;ge (OSM)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Das Projekt OpenAddresses (OA) wurde im Jahr 2007 konzipiert, gestartet und seither permanent weiterentwickelt. OA erm&#246;glicht das Erfassen von geokodierten Adressen &#252;ber eine Web-Anwendung. Geokodierte Adressen sind ein wichtiger Bestandteil einer Geodateninfrastruktur und dienen zahlreichen Anwendungen als wichtige Ortsinformation. OA erlaubt die erfassten Daten kostenlos herunterzuladen und sie zu verwenden. OA verwendet als Hintergrunddaten OpenStreetMap (OSM) Daten und ist seit einiger Zeit bestrebt, eine m&#246;glichst aktuelle Synchronisation zur OSM-Datenbank herzustellen.
Dieser Beitrag stellt eine Browseranwendung vor, die erstellt wurde, um Fotos von Smartphones f&#252;r die semi-automatische Erfassung von geokodierten Adressen zu verarbeiten. 
Das Vorgehen ist dabei so, dass ein Anwender mit einem Smartphone oder einer Kamera mit entsprechender Sensorik Fotos von Geb&#228;uden erstellt. Diese digitalen Bilder, werden anschliessend &#252;ber die erw&#228;hnte Browseranwendung auf einen Server geladen und dort prozessiert. Dabei werden die erw&#228;hnten Informationen ausgelesen. &#220;ber Nominatim wird die Kameraposition zur Zeit der Aufnahme abgefragt und mithilfe der Information des Richtungssensors wird die gesch&#228;tzte Position des aufgenommenen Geb&#228;udes ermittelt. Die so erhaltenen Informationen werden in der Browseranwendung dargestellt: zum einen wird der Kamerastandort und die gesch&#228;tzte Geb&#228;udeposition in einer Karte dargestellt, zum andern werden die aus Nominatim erhaltenen Adressinformationen in einer Tabelle aufgef&#252;hrt. Der Anwender kann nun einerseits im Kartenfenster die korrekte Adress- bzw. Geb&#228;udeposition festlegen und andrerseits die erhaltenen Adresseninformationen falls n&#246;tig &#228;ndern, erg&#228;nzen oder best&#228;tigen. 
Sind die Angaben vollst&#228;ndig und korrekt, werden die so erhobenen geokodierten Adressinformationen direkt in die Datenbank von OA eingetragen.
Nebst der Browseranwendung wird im Beitrag auch auf die Qualit&#228;t dieses Ansatzes und Risiken und Chancen eingegangen.
</abstract>
        <description></description>
        <persons>
          <person id="30">Hans-J&#246;rg Stark</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="504">
        <start>13:30</start>
        <duration>00:30</duration>
        <room>3.008</room>
        <slug></slug>
        <title>Open Street Map in Freiheit erstarrt?</title>
        <subtitle>Gedanken zur Fortentwicklung durch die Community</subtitle>
        <track>Vortr&#228;ge (OSM)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Einer der hergebrachten Grunds&#228;tze bei OpenStreetMap ist es, dass jeder alles so eintragen darf, wie er es f&#252;r richtig h&#228;lt, wenn der dabei nur auf automatische Edits verzichtet. Trotz dieser immensen Freiheit, die dem Einzelnen zugestanden wird hat jeder aktive Mitwirkende schon Augenblicke der Frustration erlebt, wenn &#252;ber Taggingprobleme auf Mailinglisten beziehungsweise in Foren endlos diskutiert werden, ohne schlie&#223;lich greifbare Ergebnisse zu liefern. Man denke auch an den &#196;rger und Zeitaufwand, den es bedeuten kann, wenn man im Wiki &#196;nderungen an bestehenden Artikeln vornimmt oder versucht via Proposal ein neues Tag zu etablieren.

Der Beitrag setzt sich zun&#228;chst analytisch mit den Ursachen solcher Situationen auseinander und identifiziert das dem Crowdsourcing innewohnende inkrementelle Handlungselement und die Heterogenit&#228;t der Beteiligten als wesentliche Ursachen. Das auf Crowdsourcing, als zentrales Element von OpenStreetMap, nicht verzichtet werden kann, liegt auf der Hand. Deshalb besch&#228;ftigt sich der Beitrag im Weiteren mit L&#246;sungsstrategien aus dem Bereich der Organisations- und Verhaltenslehre, um die positiven Effekte von Crowdsourcing zu erhalten, aber die negativen Begleiterscheinungen nach M&#246;glichkeit zu eliminieren oder abzumildern. So werden einfache Regeln herausgearbeitet, die es jedem erm&#246;glichen k&#252;nftig effektivere Diskussionen &#252;ber das Taggingschema zu f&#252;hren.</abstract>
        <description></description>
        <persons>
          <person id="147">Falk Zscheile</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="608">
        <start>14:00</start>
        <duration>00:30</duration>
        <room>3.008</room>
        <slug></slug>
        <title>overpass turbo</title>
        <subtitle>Einfache Analyse von OpenStreetMap Daten</subtitle>
        <track>Vortr&#228;ge (OSM)</track>
        <type>lecture</type>
        <language></language>
        <abstract>Die Overpass API hat sich als ein sehr hilfreiches Werkzeug herausgestellt, wenn es darum geht, die enormen Datenmengen von OpenStreetMap zu durchforsten und zu analysieren. Die von Roland Olbricht entwickelte Overpass API ist schnell, verf&#252;gbar und durch ihre spezielle Abfragesprache sehr flexibel wenn es darum geht, Daten zu filtern. Sie konnte aber lange Zeit ihre St&#228;rken nicht voll ausspielen, da es f&#252;r die API keine einfache, schnelle und effiziente &#8211; kurz gesagt benutzerfreundliche &#8211; grafische Oberfl&#228;che gab.

Overpass turbo f&#252;llt diese L&#252;cke und erm&#246;glicht es auf eine einfache Art und Weise beliebige Overpass API Abfragen auszuf&#252;hren und die Ergebnis-Daten auf einer interaktiven Karte zu betrachten. Im Zusammenspiel mit der Overpass API k&#246;nnen damit beliebige Aspekte von OpenStreetMap beleuchtet werden. Diese Funktionen k&#246;nnen sowohl f&#252;r Datenkonsumenten als auch f&#252;r OSM-Mapper sehr interessant sein.

In disem Vortrag werden anhand von einigen Beispielen verschiedene Anwendungsf&#228;lle von overpass turbo aufgezeigt. Anschlie&#223;end wird dessen technischer Aufbau erkl&#228;rt und auf die geplante zuk&#252;nftige Weiterentwicklung eingegangen.</abstract>
        <description></description>
        <persons>
          <person id="357">Martin Raifer</person>
        </persons>
        <links>
          <link href="http://overpass-turbo.eu">overpass turbo</link>
          <link href="http://wiki.openstreetmap.org/wiki/Overpass_turbo">Dokumentation (engl.)</link>
          <link href="http://slid.es/martinraifer/overpass_turbo">Folien</link>
        </links>
      </event>
      <event id="521">
        <start>14:30</start>
        <duration>00:30</duration>
        <room>3.008</room>
        <slug></slug>
        <title>Mobile Karten erstellen mit OSM, OpenLayers und Overpass API</title>
        <subtitle></subtitle>
        <track>Vortr&#228;ge (OSM)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Mit OpenStreetMap stehen nicht nur freie Daten zur Verf&#252;gung, sondern wegen der hervorragenden Community decken diese auch ein sehr breites thematisches Spektrum ab, und sie erreichen dabei eine Aktualit&#228;t, die sich eher in Tagen und Stunden als Monaten und Jahren bemisst.

Mit der Kombination der freien Werkzeuge OpenLayers und der Overpass API lassen sich diese leicht in einer Karte f&#252;r thematische Overlays visualisieren, die sowohl gleicherma&#223;en auf dem Desktop wie auf mobilen Endger&#228;ten funktioniert, aber trotzdem nicht mehr Infrastruktur als eine einfache HTML-Seite braucht. Dank Overpass API ist sie stets minutenaktuell und auch spontan im HTML-Code oder sogar zur Laufzeit konfigurierbar.

Anhand einer Beispielkarte werden die M&#246;glichkeiten erl&#228;utert: Es wird gezeigt, wie durch ein durchdacht einfaches Bedienkonzept und Nutzung der Geolokalisierung eine Smartphone-freundliche Karte entsteht. Wir werden eigene Kategorien von Points of Interest spontan als Kartenoverlay hinzuf&#252;gen. Und es wird gezeigt, wie durch Kombination von Tag-Verarbeitung auf dem Client und R&#252;ckgriff auf die Nominatim-API zu jedem POI automatisch eine Adresse ermittelt werden kann.
</abstract>
        <description></description>
        <persons>
          <person id="280">Roland Olbricht</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="579">
        <start>15:30</start>
        <duration>00:30</duration>
        <room>3.008</room>
        <slug></slug>
        <title>GIS basierte, automatisierte Analyseketten als Grundlage f&#252;r r&#228;umliche Energiekonzepte</title>
        <subtitle></subtitle>
        <track>Vortr&#228;ge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Im Zuge der im Jahr 2011 eingeleiteten &#8222;Energiewende&#8220; wird vor allem im l&#228;ndlichen Raum eine Verlagerung von der zentralistischen zu einer dezentralen, regenerativen Energieerzeugung stattfinden. Durch den Aufbau dezentraler Versorgungs- und Erzeugungsstrukturen bieten sich in peripheren als auch in strukturschwachen Regionen die M&#246;glichkeiten, aus der Errichtung und dem Betrieb von regenerativen Anlagen - beispielsweise aus Bio- oder Solarenergie &#8211; regionale, &#246;kologische und &#246;konomische Wertsch&#246;pfungseffekte zu erzielen. Mit der vielseitigen Inanspruchnahme von Fl&#228;chen, Nutzungskonkurrenzen und einer Reihe von Raumimplikationen profiliert sich dieser Planungs- und Entwicklungsprozess - insbesondere auf regionaler Ebene - zu einer wesentlichen Komponente in der Raumentwicklung. Zudem sind informelle Konzepte und formelle Planungen erforderlich, um bei der Realisierung von Projekten zwischen den klima- und energiepolitischen Zielen und wirtschaftlichem Investitionsdruck einerseits, sowie Raumvertr&#228;glichkeit und Akzeptanz in der &#214;ffentlichkeit andererseits einen Ausgleich zu schaffen. Die Geoinformatik, als interdisziplin&#228;res Fachgebiet, kann in diesem Kontext eine bedeutende Rolle spielen. Als technologischer Begleiter der Energiewende er&#246;ffnet sich dabei ein wachsendes Anwendungsspektrum. Mittels GIS basierten, automatisierten Analyseketten lassen sich Restriktionen, sowie Potenzial- und Bedarfsfl&#228;chen auf kommunaler Ebene geb&#252;ndelt auswerten und deutschlandweit transparent vergleichen. In Projekten an der Hochschule Anhalt zeigt sich, dass selbst frei verf&#252;gbare Daten (OpenStreetMap, EEG-Anlagenstammdaten und CORINE Landnutzungsdaten) und Software (gvSIG/QGIS in Verbindung mit der Sextante Toolbox) aussagekr&#228;ftige Ergebnisse f&#252;r eine grundlegende Entscheidungsfindung liefern.</abstract>
        <description></description>
        <persons>
          <person id="239">Martin Becker</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="584">
        <start>16:00</start>
        <duration>00:30</duration>
        <room>3.008</room>
        <slug></slug>
        <title>OpenStreetMap- und ALK-Daten gemeinsam nutzen</title>
        <subtitle>Ein Stadtplandienst f&#252;r Mecklenburg-Vorpommern</subtitle>
        <track>Vortr&#228;ge (OSM)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>&#214;ffentlichen Daten in Verbindung mit OpenStreetMap-Daten zu nutzen ist, sp&#228;testens seit der Umstellung auf die neue OpenStreetMap Lizenz, kein Problem mehr. Ende des Jahres wurde daher ein Projekt ins Leben gerufen, welche zum Ziel hatte einen Stadtplandienst f&#252;r das Land Mecklenburg-Vorpommern bereitzustellen.

Hier wurden Daten der Verwaltungen mit den OpenStreetMap-Daten verarbeitet und in einer gemeinsamen Karte dargestellt. Das Erstellen und Bereitstellen der Karte wurde mit dem Open-Source-Software-Stack Postgis, Imposm, MapServer und MapProxy umgesetzt.

Im Vortrag wird auf die technische Umsetzung, die verwendeten Open-Source-Komponenten, auftretende Probleme und die dabei ben&#246;tigte Weiterentwicklung der genutzten Open-Source-Komponenten eingegangen. So wurde zum Beispiel Imposm im Zuge des Projektes so erweitert, dass polygongenaue Datenbankimporte durchgef&#252;hrt werden k&#246;nnen.

Zudem wird im Vortrag besonderes Augenmerk auf das Zusammenspiel zwischen OpenStreetMap Daten und den Daten aus der &#246;ffentlichen Verwaltung gelegt. So wurden aus dem OpenStreetMap Projekt s&#228;mtliche Stra&#223;endaten, alle Fl&#228;chen- und Geb&#228;udebeschriftungen und jegliche Art von Wasserfl&#228;chen &#252;bernommen. Erg&#228;nzt wurden dies durch die fl&#228;chendeckende Darstellung der Landnutzung von Flurst&#252;cks- und Geb&#228;udedaten aus den Daten der Verwaltung.

Der Datenbestand der OpenStreetMap Daten wird t&#228;glich aktualisiert. Dies erm&#246;glicht es den &#246;ffentlichen Stellen auch, die Daten in OpenStreetMap zu verbessern und diese dann gleichzeitig in der Karte sehen zu k&#246;nnen. &#196;nderungen an den Daten sind somit in sp&#228;testens 24 Stunden in den Karten zu sehen. Um dies zu erm&#246;glichen wurde die MapProxy Seeding Schnittstelle dazu verwendet die Bereiche in denen sich OpenStreetMap Daten ge&#228;ndert haben, neu zu generieren.

Die Karten steht alle B&#252;rgern unter der CC-BY-SA 3.0 Lizenz zur Verf&#252;gung. Das Projekt wurde entstand unter Zusammenarbeit der Stadt Rostock mit der Firma Omniscale durchgef&#252;hrt.</abstract>
        <description></description>
        <persons>
          <person id="142">Dominik Helle</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="546">
        <start>16:30</start>
        <duration>00:30</duration>
        <room>3.008</room>
        <slug></slug>
        <title>Eine Karte in jeder Sprache</title>
        <subtitle></subtitle>
        <track>Vortr&#228;ge (OSM)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>OpenStreetMap ist mit dem Anspruch angetreten, eine Karte der ganzen Welt zu schaffen, eine Karte, die von jederman genutzt werden kann. Die Karten, die aus OSM-Daten erstellt wurden, haben aber h&#228;ufig das Problem, dass die Namen von L&#228;nder, St&#228;dte und POIs f&#252;r die Nutzer der Karten nicht lesbar sind. Der europ&#228;ische Tourist, der seine Asienreise plant, sieht oft nur unverst&#228;ndliche Namen in unbekannten Schriftzeichen. Andersherum, kann ein Schulkind in Nepal die europ&#228;ischen Namen nicht verstehen. Au&#223;erdem gibt es viele Konflikte in mehrsprachigen Regionen, welche Namen denn nun auf der Karte erscheinen sollen.

Diesen Problemen kann nur mit einer mehrsprachigen Karte abgeholfen werden. Jedem Nutzer soll eine OSM-Karte in seiner Sprache zur Verf&#252;gung gestellt werden. Die Daten dazu sind bei OSM h&#228;ufig schon vorhanden, aber es braucht auch die Software um damit umgehen zu k&#246;nnen. Der Wikimedia Deutschland e.V. hat im Jahre 2012 die Entwicklung von Software f&#252;r eine solche Karte finanziert und damit wichtige Schritte erm&#246;glicht. Seither arbeiten wir daran, die mehrsprachige Karte allgemein zur Verf&#252;gung zu stellen.

Der Vortrag stellt den Stand des Projektes dar und beschreibt was f&#252;r technische und soziale Probleme zu &#252;berwinden waren (und noch sind). Er geht auf die technischen Hintergr&#252;nde des Kartenservers auf Basis von Mapnik und der MapQuest-Render-Software ein und zeigt wie mit der manuellen Datenerfassung durch tausende OSM-Enthusiasten in Verbindung mit automatischer Transliteration und schnellem Kartenrendering eine wirklich &#252;berall nutzbare Karte m&#246;glich wird.</abstract>
        <description></description>
        <persons>
          <person id="2">Jochen Topf</person>
          <person id="96">Tim Alder</person>
        </persons>
        <links>
          <link href="http://mlm.jochentopf.com/">Demoseite</link>
        </links>
      </event>
      <event id="610">
        <start>17:00</start>
        <duration>00:30</duration>
        <room>3.008</room>
        <slug></slug>
        <title>Frauen in OpenStreetMap</title>
        <subtitle>Oder: Vielf&#228;ltigere Gruppen f&#252;r OSM begeistern.</subtitle>
        <track>Vortr&#228;ge (OSM)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Aus bisherigen Studien zu OpenStreetMap (z.B. Lechner 2011, Stark 2011) geht hervor, dass nur 2-5% der OSM-Beitragenden weiblich sind. Dieser Anteil ist auch im Vergleich zu anderen Open Source- bzw. Open Data-Projekten sehr niedrig - bei Wikipedia wird beispielsweise von einem Anteil von ca. 10% ausgegangen (z.B. Glott et al. 2010). F&#252;r die OSM-Community ist dieses Thema durchaus relevant: W&#252;rden sich heterogenere Gruppen (inklusive Frauen) von OSM angesprochen f&#252;hlen, g&#228;be es auch ein gr&#246;&#223;eres Potential von Personen, die Daten erfassen und aktuell halten.  
In unserer Forschung untersuchen wir daher die Gr&#252;nde der aktuellen Situation und mit welchen Ma&#223;nahmen es gelingen k&#246;nnte, mehr Frauen f&#252;r OSM zu begeistern. Dazu haben wir die folgenden Methoden angewandt: Eine Langzeitstudie, bei der 12 neue Mapperinnen zun&#228;chst verschiedene OSM-Aktivit&#228;ten erlernten und im Anschluss im mehrmonatigen Rhythmus zu ihrem Aktivit&#228;tsstatus befragt wurden, Telefon-Interviews mit aktiven Mapperinnen und Mappern, sowie einen Online-Fragebogen f&#252;r Personen, die OSM kennen, aber nicht (mehr) aktiv beitragen. Die bereits vorliegenden Ergebnisse lassen darauf schlie&#223;en, dass es f&#252;r neue Mapperinnen in OSM sowohl eines leichteren technischen Einstiegs, als auch sozialer und projektbezogener Anreize bedarf. 
Der Vortrag m&#246;chte die Forschungsergebnisse im Detail vorstellen, sowie Ma&#223;nahmen zur Diskussion stellen, mit denen mehr Personen (insbesondere Frauen) f&#252;r OSM aktiviert werden k&#246;nnen.</abstract>
        <description>Aus bisherigen Studien zu OpenStreetMap (z.B. [1], [2]) geht hervor, dass nur 2&#8211;5% der OSM-Beitragenden weiblich sind. Dieser Anteil ist auch im Vergleich zu anderen Open Source- bzw. Open Content-Projekten sehr niedrig &#8211; bei Wikipedia wird beispielsweise von einem Anteil von ca. 9&#8211;13% ausgegangen [3]. Aber auch bei den teilnehmenden M&#228;nnern scheint die Vielschichtigkeit der Gesellschaft nicht vertreten zu sein. Haklay und Budhathoki [4] beschreiben den prototypischen Teilnehmer als technologieversiert, gut ausgebildet und zwischen 20 und 40 Jahren. F&#252;r die OSM-Community ist dieses Thema durchaus relevant: W&#252;rden sich vielf&#228;ltigere Gruppen von OSM angesprochen f&#252;hlen, g&#228;be es auch ein gr&#246;&#223;eres Potential von Personen, die Daten erfassen und aktuell halten. 

Um vielf&#228;ltigere Gruppen f&#252;r OSM zu begeistern, ist es wichtig zu verstehen, was diese Gruppen bisher von der Teilnahme abh&#228;lt und welche Aspekte sie zur Beteiligung motivieren k&#246;nnten. Fokus unserer Forschung ist die Gruppe der Frauen, die wie oben beschrieben in OSM derzeit stark unterrepr&#228;sentiert ist. Dabei wurden die folgenden Methoden angewandt: Eine Langzeitstudie mit neuen Mapperinnen, Telefon-Interviews mit aktiven Community-Mitgliedern, sowie ein Online-Fragebogen f&#252;r Personen, die OSM kennen, aber nicht (mehr) aktiv beitragen. Im folgenden werden die Ergebnisse der Langzeitstudie, sowie erste Einzelergebnisse des Online-Fragebogens vorgestellt. 

Die Langzeitstudie wurde im Fr&#252;hjahr 2012 an der Technischen Universit&#228;t Wien durchgef&#252;hrt. In der qualitativen Studie wurden 11 neue Mapperinnen in ihrem Lernprozess zur aktiven Teilnahme in  OpenStreetMap begleitet, um Motivatoren und Barrieren in der Auseinandersetzung mit OSM zu erheben. Die Teilnehmerinnen der Studie wurden gezielt ausgew&#228;hlt, um dem typisch m&#228;nnlichen OSM-User zu entsprechen (technologieversiert, gut ausgebildet und zwischen 20 und 40 Jahren, siehe [4]). Zun&#228;chst wurden den Teilnehmerinnen in drei begleiteten Einheiten unterschiedliche OSM-Aktivit&#228;ten n&#228;her gebracht: 1) Mapping mit Walking Papers, 2) Mappen und Editieren auf Basis von Luftbildern mit JOSM, 3) Outdoor-Mapping mit GPS (Exkursion in den Wienerwald). Anschlie&#223;end bekamen die Teilnehmerinnen die Aufgabe, zwei frei gew&#228;hlte Gebiete selbstst&#228;ndig zu mappen und mit einem Vorher-/Nachher-Screenshot zu dokumentieren. Positive und negative Erfahrungen mit OSM wurden von den Teilnehmerinnen &#252;ber die Laufzeit der Studie in einem Online-Mapping-Tagebuch festgehalten. Bei der Abschlussveranstaltung des Kurses stellten die Teilnehmerinnen ihre Mapping-Ergebnisse vor und diskutierten ihre Erfahrungen mit OSM, die im folgenden kurz zusammengefasst werden. Detaillierte Ergebnisse mit Originalkommentaren der Teilnehmerinnen finden sich in [5].

Zusammenfassung der berichteten positiven Erfahrungen:
* Erwerb neuer F&#228;higkeiten und neuen Wissens durch die Besch&#228;ftigung mit OSM
* Gemeinsames Erkunden der Umgebung bei der Exkursion
* Offener Zugang zu OSM und freie Nutzbarkeit der Daten
* Mapping als sinnvoller Beitrag f&#252;r die Gesellschaft
* Unmittelbare Sichtbarkeit der eigenen Beitr&#228;ge auf einer weltweit verf&#252;gbaren Karte
* Soziale Komponente des Mappens, z.B. Exkursion, gemeinsames Probleml&#246;sen

Zusammenfassung der berichteten negativen Erfahrungen:
* keine leicht ersichtliche Starthilfe bzw. Verwirrung durch eine Vielzahl 
* OSM-bezogener Informationsseiten (OSM-Wiki, Foren, Tutorien, etc.)
* Bedienung der Editoren und Erlernen des Tagging-Schemas zun&#228;chst komplex
* fehlendes visuelles Feedback (z.B. durch Wartezeiten auf das Rendering oder weil bestimmte Daten nicht gerendert werden)
* Probleme/Fehlermeldungen beim Daten-Upload 
* hohe Zeitintensit&#228;t

Folgende vier Ma&#223;nahmen wurden au&#223;erdem von den Teilnehmerinnen erarbeitet, um ihnen &#228;hnliche Personengruppen zur Beteiligung in OSM zu motivieren: (1) Projektbasiertes Mapping: Mapping-Aktionen, die nicht nur der Vervollst&#228;ndigung der Karte, sondern auch zus&#228;tzlichen Zielen dienen (z.B. Crisis Mapping). (2) Vereinfachung des Einstiegs z.B. &#252;ber ein einfach auffindbares, nutzungsfreundliches Tutorium. (3) Soziale Events: gemeinschaftliches Mapping und st&#228;rkere Einbindung sozialer Vernetzungsoptionen. (4) Verbesserung des visuellen und technischen Feedbacks: Konstruktive Fehlermeldungen und Lob/Belohnungen f&#252;r erfolgreichen Datenupload.

In einem Online-Fragebogen wurden die in der Langzeitstudie erhobenen Motivatoren und Ma&#223;nahmen als Basis verwendet, um mehr dar&#252;ber zu erfahren, wie Personen, die OSM zwar kennen, aber derzeit nicht aktiv sind, f&#252;r OSM (re)aktiviert werden k&#246;nnen. Die Umfrage wurde im Februar 2013 durchgef&#252;hrt und haupts&#228;chlich &#252;ber Mailinglisten im Geobereich verbreitet. Insgesamt haben 516 Personen teilgenommen; davon fielen 242 in die Kategorie der Personen, die OSM kennen, aber derzeit nicht aktiv beitragen. Im folgenden findet sich eine &#220;bersicht der h&#228;ufigst gew&#228;hlten Barrieren und Motivatoren.

Gr&#252;nde f&#252;r die Inaktivit&#228;t bei OSM:
* Beitragen ist zu zeitaufw&#228;ndig (62%)
* OSM scheint in meiner Region vollst&#228;ndig zu sein (50%)
* Ich habe vergessen teilzunehmen (43%)

Aspekte, die zur (Wieder)Beteiligung bei OSM f&#252;hren k&#246;nnten:
* Mapping f&#252;r einen konkreten Zweck (z.B. Crisis Mapping) (48%)
* Weniger zeitaufw&#228;ndige Mapping-L&#246;sungen (z.B. Smartphone-App) (44%)
* Tutorial f&#252;r OSM-Neulinge (39%)

Insbesondere die Motivatoren zur (Wieder)Beteiligung unterscheiden sich jedoch nach OSM-Erfahrung der Personen. Umfrage-Teilnehmende, die sich als derzeit aktiv in der OSM-Community eingestuft haben, wurden zu ihrem Mapping-Werdegang, sowie zu ihrer Einsch&#228;tzung der Gender-Thematik in OSM befragt. Auswertung und Analyse des Online-Fragebogens sind noch nicht vollst&#228;ndig abgeschlossen. Die Umfrageergebnisse werden voraussichtlich im Sommer 2013 auf der Projektwebsite verf&#252;gbar sein.

Diskussion. Die hier vorgestellten Ergebnisse der Langzeitstudie und des Online-Fragebogens lassen sich wahrscheinlich auch auf weitere, bislang nicht erreichte Gesellschaftsgruppen anwenden &#8211; die genannten Motivatoren und Ma&#223;nahmen m&#252;ssen aber nicht notwendigerweise den Bed&#252;rfnissen anderer Zielgruppen entsprechen. Es bedarf daher einer Zielgruppen-orientierten Vorgehensweise und ma&#223;geschneiderter Ma&#223;nahmen, um vielf&#228;ltige Gruppen f&#252;r die Teilnahme in OSM zu begeistern. In einem Projekt, das so stark Community-getrieben ist wie OSM, k&#246;nnen derartige &#196;nderungen jedoch nur aus der Community selbst entstehen. Die Ergebnisse der vorgestellten Studien k&#246;nnen hierbei als Diskussionsgrundlage dienen.

Details und Updates zum Projekt unter http://cartography.tuwien.ac.at/fem2map</description>
        <persons>
          <person id="210">Manuela Schmidt</person>
        </persons>
        <links>
          <link href="http://cartography.tuwien.ac.at/fem2map/">Projektwebsite</link>
          <link href="http://">http://</link>
        </links>
      </event>
    </room>
    <room name="3.010">
      <event id="622">
        <start>09:00</start>
        <duration>00:30</duration>
        <room>3.010</room>
        <slug></slug>
        <title>Geo-Metadaten in OpenData Portalen</title>
        <subtitle></subtitle>
        <track>Vortr&#228;ge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract></abstract>
        <description>In den letzten Jahren nimmt die Verbreitung von OpenData Portalen auf Basis der Software CKAN immer mehr zu. Die von den OKF initierte Software hat sich dabei zu einem Quasi-Standard entwickelt. Sowohl das OpenData Portal der Europ&#228;ischen Union, als auch viele OpenData Portale der Mitgliedstaaten und kleinerer Institutionen basieren auf dem in Python entwickelten Softwarepaket CKAN. Als RDBM-Backend hat sich in diesem Umfeld Postgres etabliert. Bei CKAN handelt es sich, allgemein betrachtet, um ein Metainformationssystem mit einem speziell auf OpenData ausgerichteten Informationsmodell, das mit einer extra "spatial" Extension auch als Geo-Metadatenkatalog genutzt werden kann.

Als das Land Rheinland-Pfalz Ende 2012 beschloss ebenfalls ein eigenes OpenData Portal aufzusetzen, wurde zun&#228;chst nach m&#246;glichen Datenquellen recherchiert. Ziel war es, vorhandene Metadatenbest&#228;nde - soweit m&#246;glich - automatisiert an das neue Portal anzuschliessen. Als Datenquellen boten sich hier PortalU.rlp sowie das vollst&#228;ndig auf FOSS basierende GeoPortal.rlp an.

Das OpenData Portal des Landes sollte bis zur CeBIT 2013 frei geschaltet werden. Zun&#228;chst wurde versucht das CSW 2.0.2 Interface von Geonetwork zu nutzen, um die Geo-Metadaten durch die in CKAN integrierte Harvesting Schnittstelle "ernten" zu lassen. W&#228;hrend des Versuchs zeigten sich aber starke konzeptionelle wie auch technische Schw&#228;chen dieser Vorgehensweise. Aus diesem Grund wurde der Ansatz zugunsten eines vom GeoPortal.rlp angesto&#223;enen "push"-Verfahrens verworfen. Bei diesem Verfahren werden die Geo-Metadaten der im GeoPortal registrierten Webservices in das CKAN spezifische json Format transformiert und dann &#252;ber die CKAN json API direkt in den OpenData Katalog &#252;berf&#252;hrt.

Im Vortrag werden das Synchronisierungsverfahren, sowie die Probleme zu dessen Umsetzung f&#252;hrten, n&#228;her erl&#228;utert. Weiterhin wird auf die Unterschiede zwischen den Datenmodellen der ISO19139 und des CKAN eingegangen und erkl&#228;rt warum die Versuche einen Datenaustausch &#252;ber die CSW 2.0.2 Schnittstelle zu realisieren momentan zum Scheitern verurteilt sind.

Mit der Umsetzung der Schnittstelle im M&#228;rz 2013 konnte in Deutschland erstmalig die &#220;bertragung der Inhalte eines umfangreichen Geo-Metadatenkatalogs in ein OpenData Portal realisiert werden. Die Daten aus dem GeoPortal.rlp sind derzeit sowohl im rheinland-pf&#228;lzischen Open Government Data Portal (http://www.daten.rlp.de) als auch unter http://www.govdata.de recherchierbar. Ein Anschluss ans Portal der Europ&#228;ischen Kommission befindet sich derzeit in Vorbereitung. </description>
        <persons>
          <person id="257">Armin Retterath</person>
        </persons>
        <links>
          <link href="http://www.govdata.de/">http://www.govdata.de/</link>
          <link href="http://www.daten.rlp.de/">http://www.daten.rlp.de/</link>
          <link href="http://www.geoportal.rlp.de/">http://www.geoportal.rlp.de/</link>
          <link href="http://www.fossgis.de/w/images/e/e4/Fossgis2013_geometadaten_in_opendata_portalen_retterath.pdf">Beitrag Tagungsband</link>
          <link href="http://www.fossgis.de/w/images/c/ca/Fossgis2013_geometadaten_in_opendata_portalen_retterath_slides.pdf">Folien</link>
        </links>
      </event>
      <event id="578">
        <start>09:30</start>
        <duration>00:30</duration>
        <room>3.010</room>
        <slug></slug>
        <title>GeoNetwork 2.8 - Neuerungen</title>
        <subtitle></subtitle>
        <track>Vortr&#228;ge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract>Der Vortrag fokussiert: 
Geo-Metadaten mit GeoNetwork opensource
Neuerungen der Version 2.8

N&#228;heres siehe angeh&#228;ngtes Abstract</abstract>
        <description></description>
        <persons>
          <person id="38">David Arndt</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="595">
        <start>10:00</start>
        <duration>00:30</duration>
        <room>3.010</room>
        <slug></slug>
        <title>Entwicklung und Anwendung von Downloaddiensten  im Kontext der europ&#228;ischen Geodateninfrastruktur INSPIRE</title>
        <subtitle></subtitle>
        <track>Vortr&#228;ge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Der Zeitplan der europ&#228;ischen Geodateninfrastruktur INSPIRE sieht die Bereitstellung von Downloaddiensten ab dem Jahr 2012 vor. Downloaddienste &#252;bertragen origin&#228;re, unpr&#228;sentierte Geodaten. Die heruntergeladenen Geodaten k&#246;nnen &#8211; im Gegensatz zu den &#252;ber einen Darstellungsdienst bereitgestellten Pr&#228;sentationsgrafiken &#8211; individuell analysiert, verarbeitet und pr&#228;sentiert werden.

Im Vortrag werden die rechtlichen Vorgaben und technischen Empfehlungen zu INSPIRE-Downloaddiensten sowie die hierf&#252;r verwendeten Normen und Standards er&#246;rtert. Die aktuellen Technical Guidance empfehlen die drei Umsetzungsvarianten Pre-defined Atom, Pre-defined WFS und Direct WFS auf Basis der Standards Atom (GeoRSS) und WFS 2.0.

Im Folgenden werden verschiedene OpenSource-L&#246;sungen hinsichtlich ihrer Eignung f&#252;r die Bereitstellung von INSPIRE-Downloaddiensten betrachtet. Hierbei wird insbesondere auf die unterschiedlichen WFS 2.0-F&#228;higkeiten der etablierten OpenSource-Produkte UMN MapServer, GeoServer und deegree eingegangen.

Abschlie&#223;end werden Anwendungsm&#246;glichkeiten von INSPIRE-Downloaddiensten vorgestellt. Aufgrund der speziellen Semantik des INSPIRE-Atom-Profils ist eine Nutzung bestehender GeoRSS-Clients nur eingeschr&#228;nkt m&#246;glich. Ferner wird WFS 2.0 noch von sehr wenigen Desktop-GIS unterst&#252;tzt. Im Rahmen meiner Masterarbeit wurde QuantumGIS durch Plugins erweitert, die eine Nutzung von INSPIRE-Downloaddiensten im freien Geoinformationssystem erm&#246;glichen. Der &#8222;INSPIRE Atom Client&#8220; und der &#8222;WFS 2.0 Client&#8220; stehen &#252;ber das QGIS Plugin-Repositorium zur Verf&#252;gung. 

Anmerkung: Der Vortrag basiert auf der gleichnamigen Masterarbeit, die im Januar 2013 bei der Hochschule Anhalt im Onlinestudiengang Geoinformationssysteme eingereicht wurde.
</abstract>
        <description></description>
        <persons>
          <person id="354">J&#252;rgen Weichand</person>
        </persons>
        <links>
          <link href="http://www.weichand.de/masterarbeit-inspire-downloaddienste/">Masterarbeit: Entwicklung und Anwendung von Downloaddiensten im Kontext der europ&#228;ischen Geodateninfrastruktur INSPIRE</link>
          <link href="http://plugins.qgis.org/plugins/tags/inspire/">QGIS Plugin-Repositorium </link>
        </links>
      </event>
      <event id="594">
        <start>11:00</start>
        <duration>00:30</duration>
        <room>3.010</room>
        <slug></slug>
        <title>Einf&#252;hrung ins Web-Framework GeoDjango</title>
        <subtitle>The Web framework for perfectionists with deadlines</subtitle>
        <track>Vortr&#228;ge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract>Django ist ein in Python programmiertes, quelloffenes Web-Framework, welches dem Model-View-Controller-Schema (MVC) folgt und auf die explizite Konfiguration der Anwendung setzt. GeoDjango erweitert die Django-Basis zu einem leistungsf&#228;higen geographischen Web-Framework, von neuen Feldern f&#252;r OGC-Geometrien im objektrelationalen Django-Mapper (ORM) &#252;ber  abstrahierte Python-Schnittstellen f&#252;r Geometrie-Operationen und -Datenformate bis hin zur automatisch generierten, produktionstauglichen Administrationsoberfl&#228;che, welche direkt  die kartographische Bearbeitung von Geometrien erlaubt.

Nach dieser Einf&#252;hrung werden g&#228;ngige Architekturen einer GeoDjango-Webl&#246;sung skizziert, von der Datenbank bis zum http-Server und dem Webbrowser. Als Einstieg ins Handwerk  wird aufgezeigt wie typischerweise eine GeoDjango-Entwicklungsumgebung aufzusetzen ist. Der Umgang mit den verschiedenen GeoDjango-APIs bildet den Kern der Betrachtungen. Es wird auf die zentralen Aspekte der Model-API, der Database-API und der GeoQuerySet-API eingegangen. Ein erster Blick in die GEOS- und GDAL-API runden den Block ab. 

Das GeoDjango Framework liefert Python-Objekte. Es wird beispielhaft gezeigt, wie diese im Django-Template-Engine in eine vom Web-Browser interpretierbare Form aufgearbeitet werden,  oft als JSON-Objekte, welche der JavaScript-Mapping-Library der Wahl &#252;bergeben werden.  Hinweise zum Deploying einer GeoDjango-Applikation runden die Einf&#252;hrung ab.</abstract>
        <description></description>
        <persons>
          <person id="296">Stephan Wagner</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="549">
        <start>11:30</start>
        <duration>00:30</duration>
        <room>3.010</room>
        <slug></slug>
        <title>Das SHOGun-WebGIS Framework </title>
        <subtitle>Vorstellung, Stand und Einsatzbeispiele</subtitle>
        <track>Vortr&#228;ge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Abstract

Die Anforderungen an WebGIS-L&#246;sungen werden vielseitiger und komplexer. Oft werden verwaltungsweite L&#246;sungen ben&#246;tigt, ein umfassendes Berechtigungskonzept m&#246;glichst mit Anbindung an externe Authentifizierungsdienste wie LDAP nachgefragt oder auch die Integration von Geo- und nicht-Geo-Diensten bei gleichzeitiger Absicherung gefordert.

Solche komplexen WebGIS-L&#246;sungen erfordern ein reibungsloses Zusammenspiel und eine hohe Flexibilit&#228;t seitens aller eingesetzten Komponenten. Als eine L&#246;sung stellt terrestris seit Ende 2012 das Framework &#8222;SHOGun&#8220; (&#8220;Spring, Hibernate, OpenLayers, GeoExt un&#8230; d weitere&#8221;) als OpenSource Software bereit, gleichzeitig kommt SHOGun auch in Projekten zum Einsatz. SHOGun besteht aus einem Java-Backend, welches neben der Benutzer- und Rechteverwaltung ein Framework zum Aufsetzen von eigenen Diensten bietet. Dazu liefert SHOGun einen frei konfigurierbaren WebGIS-Client auf Basis von ExtJS, GeoExt und OpenLayers.

Durch den Einsatz dieser renommierten und hochqualitativen Open Source-Frameworks wird die Nachhaltigkeit, Wartbarkeit sowie die Qualit&#228;t der Anwendung gew&#228;hrleistet.

Der Vortrag stellt den Stand des OpenSource Projektes SHOGun vor. Dabei wird neben dem aktuellen Stand auch die Roadmap vorgestellt. Weiterhin werden aktuelle Projekte und daf&#252;r entwickelte Erweiterungen, die SHOGun verwenden vorgestellt. SHOGun ist aktuell in einem gro&#223;en Forschungsprojekt sowie bei einer L&#246;sung f&#252;r die gesamte Wasserwirtschaft eines Bundeslandes im Einsatz. Highlights dabei sind beispielsweise das automatisierte Anlegen von WMS-Layern &#252;ber die GeoServer-API mit SLD-Editor oder die Erstellung eigener GIS-Client-Instanzen.
</abstract>
        <description></description>
        <persons>
          <person id="23">Till Adams</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="570">
        <start>12:00</start>
        <duration>00:30</duration>
        <room>3.010</room>
        <slug></slug>
        <title>Mapbender3 - nimmt Fahrt auf!</title>
        <subtitle>Aufbau von WebGIS Anwendungen mit Mapbender3</subtitle>
        <track>Vortr&#228;ge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Mapbender3 hat in den letzten Monaten Fahrt aufgenommen und will sich an dieser Stelle vorstellen. 

Mapbender3 ist eine Software zur einfachen Erstellung von WebGIS Anwendungen. Basierend auf dem aktuellen Symfony2 Framework wurde eine moderne Webanwendung geschaffen, die durch das Baukastensystem der Bundles von Symfony2 einzeln als auch in andere Anwendungen integriert Verwendung finden kann.

Als moderne Web-Application basiert Mapbender3 auf den Javascript-Bibliotheken jQuery, jQuery UI, OpenLayers und MapQuery als Br&#252;cke zwischen der OpenLayers- und jQuery-Welt. Zusammen mit einem modernen Verwaltungsbackend f&#252;r die Kartenanwendungen ist Mapbender3 ein komfortables Werkzeug f&#252;r die Erstellung und Pflege von Kartenanwendungen.

Der Vortrag stellt zuerst die neuen Komponenten des Frontends vor. Anschlie&#223;end wird das Administrations-Backend, mit dem einfach &#252;ber ein paar Klicks eigene Anwendungen erstellt werden k&#246;nnen, vorgestellt. Das Administrations-Backend beinhaltet au&#223;erdem die M&#246;glichkeit, ein Dienste-Repository aufzubauen. Dienste k&#246;nnen hierbei verschiedene von OpenLayers unterst&#252;tzte Quellen sein, wie z.B. WMS, WMTS, ... 

Mapbender3 bietet au&#223;erdem eine Benutzer- und Gruppenverwaltung mit der M&#246;glichkeit Rechte zuzuweisen. Rechteverwaltung. Benutzer k&#246;nnen auch &#252;ber LDAP in Mapbender &#252;bernommen werden. Eine Sicherung von Diensten &#252;ber OWSPROXY ist ebenfalls vorhanden.
</abstract>
        <description></description>
        <persons>
          <person id="65">Astrid Emde</person>
        </persons>
        <links>
          <link href="http://mapbender3.org">http://mapbender3.org</link>
          <link href="http://doc.mapbender3.org">http://doc.mapbender3.org</link>
          <link href="http://mapbender.org">http://mapbender.org</link>
          <link href="http://svn.osgeo.org/mapbender/trunk/documents/presentations/FOSSGIS2013/Mapbender3_nimmt_Fahrt_auf_FOSSGIS_2013_AEmde.pdf">Mapbender3_nimmt_Fahrt_auf_FOSSGIS_2013_AEmde.pdf (Vortragsfolien Mapbender3 nimmt Fahrt auf! Astrid Emde)</link>
        </links>
      </event>
      <event id="554">
        <start>13:30</start>
        <duration>00:30</duration>
        <room>3.010</room>
        <slug></slug>
        <title>MapFish</title>
        <subtitle>Ein OSGeo WebGIS 2.0 Framework</subtitle>
        <track>Vortr&#228;ge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>MapFish ist ein Framework, welches die Bildung von individuell gestalteten und erweiterbaren Web-GIS Anwendungen vereinfacht.
MapFish ist so gestaltet, dass es einfach zu nutzen ist, entweder als selbst&#228;ndige Anwendung oder als Bestandteil einer bestehenden Webseite. Als selbst&#228;ndige Anwendung ist MapFish via einige Parameter konfigurierbar und bietet schnell ein funktionales Web-GIS. MapFish kann auch in bestehenden Webseiten wie CMS oder Informations System orientierte Anwendungen ohne Aufwand integriert werden. Der Client Teil erm&#246;glicht mittels OpenLayers2, ExtJS3 und GeoExt4, weiterf&#252;hrende WEB2.0 Funktionalit&#228;ten einzubauen.
Der Server-Teil stellt in verschiedene Programmiersprachen flexible Prozesse zur Verf&#252;gung (Routing, Suchmaschine, thematische Kartografie, usw). Auf Serverseite sind momentan insbesondere Komponenten in Java (print), Ruby oder in Python verf&#252;gbar, betreffend Python ist seit letztem Jahr die Papyrus-Library, welches auf der Pyramid-Library basiert.
Diverse Web2.0-Anwendungen wurden bereits auf Basis von Mapfish realisiert, und die Entwicklung wird speziell auch mit dem Aufkommen von Openlayers 3 weitergehen.

Dieser Vortrag stellt das MapFish Framework vor und zeigt auf in welche Richtung es sich weiter entwickeln wird.</abstract>
        <description></description>
        <persons>
          <person id="336">Elisabeth Leu</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="518">
        <start>14:00</start>
        <duration>00:30</duration>
        <room>3.010</room>
        <slug></slug>
        <title>Mapfish Appserver</title>
        <subtitle>Funktionsreiches Web-GIS mit Standard-Protokollen</subtitle>
        <track>Vortr&#228;ge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Der Mapfish Appserver baut auf OGC-Standards f&#252;r die Kartendarstellung und dem Mapfish REST-Protokoll f&#252;r die umfangreichen Editierm&#246;glichkeiten. Es k&#246;nnen verschiedene Viewer vom minimalen Mobile- bis zum vollausgebauten GIS-Viewer parallel betrieben werden. Die Karten-Konfigruation erfolgt &#252;ber das Einlesen von UMN Mapserver Mapfiles oder QGIS Projekten. Es werden automatische Legenden und Abfragetabellen erstellt, welche nach Belieben angepasst werden k&#246;nnen. Weitere Eigenschaften sind die Multi-Site F&#228;higkeit, feingranulare Zugriffskontrolle, erweiterbare Suchfunktionen und das eingebaute Administrationsbackend.</abstract>
        <description></description>
        <persons>
          <person id="99">Pirmin Kalberer</person>
        </persons>
        <links>
          <link href="http://pka.github.io/gb_mapfish_appserver/">http://pka.github.io/gb_mapfish_appserver/</link>
        </links>
      </event>
      <event id="587">
        <start>14:30</start>
        <duration>00:30</duration>
        <room>3.010</room>
        <slug></slug>
        <title>Cartaro - Geospatial CMS</title>
        <subtitle>Ein Content Management System f&#252;r r&#228;umliche Daten</subtitle>
        <track>Vortr&#228;ge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract>Cartaro ist ein Content Management System, mit dem r&#228;umliche Daten nahtlos mit Texten und Bildern kombiniert, verwaltet und publiziert werden. Cartaro verbindet dabei die St&#228;rken des CMS Drupal mit etablierten Open Source GIS-Projekten, allen voran GeoServer, GeoWebCache, PostGIS und OpenLayers. Mit Cartaro lassen sich somit &#252;ber die m&#228;chtige Administrationsoberfl&#228;che von Drupal ohne Programmierung sowohl allgemeine Webseiten wie auch spezialisierte Geoportale und komplette Geodateninfrastrukturen entwickeln. Vor allem dank der Integration von GeoServer stehen alle im CMS verwalteten Inhalte als OGC-Webservices zur  Verf&#252;gung &#8211; innerhalb und ausserhalb der Drupal-Webseite.
In folgenden Bereichen zeigt sich die enge Verzahnung von r&#228;umlichen und nicht-r&#228;umlichen Inhalten des CMS besonders. Alle wichtigen Digitalisierfunktionen, wie sie aus einem Desktop-GIS bekannt sind, stehen in der Drupal-Oberfl&#228;che zur Verf&#252;gung. Die Persistierung r&#228;umlicher Daten beruht auf PostGIS und erlaubt somit umfangreiche r&#228;umliche Abfrage- und Analysem&#246;glichkeiten direkt im CMS. Die ausgefeilten Benutzer- und Rollenkonzepte von Drupal lassen sich komplett auf Geodaten anwenden. Beginnend mit der Steuerung von Privilegien auf Datenebene bis zur Absicherung von Webdiensten erfolgen alle Einstellungen &#252;ber die Drupal-Oberfl&#228;che.
Eine wichtige St&#228;rke von Cartaro liegt in der Erweiterbarkeit &#252;ber eine Vielzahl an Drupal-Modulen. Zum Beispiel lassen sich mit Modulen f&#252;r Redaktionssysteme komplexe Workflows bei der Erfassung und Freigabe r&#228;umlicher Daten abbilden. Dies ist f&#252;r die interne Verwaltung von Geodaten ebenso interessant wie f&#252;r Portale, die im Rahmen der B&#252;rgerbeteiligung oder des Crowdsourcings Daten erheben. 
Die Pr&#228;sentation stellt die Architektur von Cartaro, die Funktionalit&#228;t und verschiedene Anwendungsf&#228;lle vor.
</abstract>
        <description></description>
        <persons>
          <person id="176">Uli M&#252;ller</person>
        </persons>
        <links>
          <link href="http://cartaro.org">Cartaro Webseite</link>
          <link href="http://">http://</link>
        </links>
      </event>
      <event id="494">
        <start>15:30</start>
        <duration>00:30</duration>
        <room>3.010</room>
        <slug></slug>
        <title>GeoCouch</title>
        <subtitle>Ein n-dimensionaler Index f&#252;r Apache CouchDB und Couchbase</subtitle>
        <track>Vortr&#228;ge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract>Bei Apache CouchDB und Couchbase handelt es sich um sogenannte dokumentbasierte Datenbanken. Sie geh&#246;rten somit in die Kategorie der nicht-relationale Datenbanksysteme f&#252;r die sich der Sammelbegriff &#8222;NoSQL&#8220; eingeb&#252;rgert hat.

Eine St&#228;rke von Apache CouchDB ist die (Multi-Master) Datenreplikation. Das bedeutet dass der Datenbestand verschiedener Datenbankinstanzen synchron gehalten werden kann, und dennoch &#196;nderungen an beliebiger Stelle vorgenommen werden k&#246;nnen.

Die Replikation beschr&#228;nkt sich nicht nur auf Apache CouchDB, sondern mittlerweile auf ein gesamtes &#214;kosystem. So ist es m&#246;glich Daten mittels HTML5-Technologie mit einem Browser zu synchronisieren. Diese stehen dem Anwender somit auch offline zur Verf&#252;gung, ohne dass eine Verbindung zu einem Server bestehen muss.

Couchbase hingegen hat seine St&#228;rke bei der Skalierung des Systems. So werden die Daten automatisch auf mehrere Rechner verteilt. Das nachtr&#228;gliche Hinzuf&#252;gen oder Entfernen von Rechnern ist &#252;ber eine Web-Oberfl&#228;che sehr leicht m&#246;glich. Im Falle des Ausfalls eines Rechners l&#228;uft das System ohne Unterbrechung weiter.

GeoCouch bietet sowohl f&#252;r Apache CouchDB als auch Couchbase eine L&#246;sung um n-dimensionale Anfragen machen zu k&#246;nnen. Es ist also nicht nur m&#246;glich r&#228;umlich Anfragen zu stellen, sondern weitere Eigenschaften wie z.B. Zeit, Gr&#246;&#223;en oder beliebige andere numerische Werte mit einzubeziehen.

Apache CouchDD, Couchbase und GeoCouch sind Open-Source und stehen unter der Apache License Version 2.0.</abstract>
        <description></description>
        <persons>
          <person id="33">Volker Mische</person>
        </persons>
        <links>
          <link href="https://github.com/couchbase/geocouch/">GeoCouch</link>
          <link href="http://couchdb.apache.org/">Apache CouchDB</link>
          <link href="http://www.couchbase.com/">Couchbase</link>
        </links>
      </event>
      <event id="497">
        <start>16:00</start>
        <duration>00:30</duration>
        <room>3.010</room>
        <slug></slug>
        <title>Administratives PostgreSQL Tuning</title>
        <subtitle></subtitle>
        <track>Vortr&#228;ge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Viele sehen PostGIS als das ideale Tool zur Verwaltung von Kartendaten. PostGIS ist ein Aufsatz auf das Datenbanksystem PostgreSQL. Der PostgreSQL-Server hat mehr als 100 Stellschrauben, an denen gedreht werden kann, doch f&#252;r ein gutes Tuning auf administrativer Ebene sind nur ein paar wenige interessant. Der Vortrag gibt Aufschluss dar&#252;ber, was auf administrativer Ebene f&#252;r ein gutes PostgreSQL-Tuning notwendig und was zu beachten ist.</abstract>
        <description>Viele sehen PostGIS als das ideale Tool zur Verwaltung von Kartendaten. PostGIS ist ein Aufsatz auf das Datenbanksystem PostgreSQL. Der PostgreSQL-Server hat mehr als 100 Stellschrauben, an denen gedreht werden kann, doch f&#252;r ein gutes Tuning auf administrativer Ebene sind nur ein paar wenige interessant. Der Vortrag gibt Aufschluss dar&#252;ber, was auf administrativer Ebene f&#252;r ein gutes PostgreSQL-Tuning notwendig und was zu beachten ist. </description>
        <persons>
          <person id="307">Susanne Ebrecht</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="543">
        <start>16:30</start>
        <duration>00:30</duration>
        <room>3.010</room>
        <slug></slug>
        <title>Die gemeinsame Nutzung von MS-SQLServer und PostgreSQL/PostGIS sowie weiterer OSGeo-Software in einer Fachdatenbank f&#252;r kulturelles Erbe mit GIS-Anbindung</title>
        <subtitle></subtitle>
        <track>Vortr&#228;ge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract>Die Generaldirektion Kulturelles Erbe Rheinland-Pfalz setzt im Bereich der Geodatenverarbeitung seit 2010 auf Open Source Software wie PostgreSQL/PostGIS, Quantum GIS, Mapserver und Mapbender. Zur Verwaltung der Fachdaten wird der MS SQL-Server eingesetzt, die clientseitig installierten Datenbankfrontends basieren auf .NET. Um die Vorteile aus beiden &#8222;Welten&#8220; nutzen zu k&#246;nnen, wird seit 2011 an einer Verkn&#252;pfung gearbeitet, die vor allem auf dem Datenaustausch zwischen den Datenbanksystemen SQLServer und PostgreSQL/PostGIS aufbaut. Das Ergebnis ist eine Fachanwendung, die hinsichtlich der Darstellung und Bearbeitung von Geodaten je nach Erfordernissen des Users mit unterschiedlichen GIS-Clients genutzt werden kann. Dazu z&#228;hlen ein in die Datenbank integrierter, OpenLayers-Kartenviewer ebenso wie eine Anbindung von QGIS sowie eines weiteren propriet&#228;ren GIS. Derzeit wird zudem eine Verkn&#252;pfung mit dem auf Open Source Komponenten aufbauenden GeoPortal.rlp entwickelt, so dass dort in Zukunft WMS- und WFS-Dienste unmittelbar durch den User freigeschaltet bzw. aktualisiert werden k&#246;nnen.
Im Vortrag soll nicht nur das Ergebnis dieser Symbiose pr&#228;sentiert werden, sondern auch einige der H&#252;rden, die auf diesem Weg genommen werden mussten (z.B. Codierungsprobleme, Einrichten eines DB-Verbindungsservers mit ODBC, Nutzung von OpenQuery und ogr2ogr). Durch die Pr&#228;sentation des noch in der Entwicklungsphase befindlichen Projektes erhoffen sich die Entwickler ein Feedback aus der FOSSGIS-Community und den Kontakt zu &#228;hnlichen Projekten.</abstract>
        <description></description>
        <persons>
          <person id="331">Christof Schuppert</person>
          <person id="365">Katrin Wolters</person>
          <person id="366">Ulrich Himmelmann</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="501">
        <start>17:00</start>
        <duration>00:30</duration>
        <room>3.010</room>
        <slug></slug>
        <title>Ort-Suche mit PostgreSQL/PostGIS</title>
        <subtitle></subtitle>
        <track>Vortr&#228;ge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Ein Ort l&#228;sst sich &#252;ber dessen Lagekoordinaten und den Ortsnamen beschreiben und speichern. Doch wie l&#228;sst sich der Ort in einem Haufen anderer Orte gezielt und effizient auffinden? Aktuelle PostgreSQL/PostGIS - Installationen bieten leistungsf&#228;hige Werkzeuge zur r&#228;umlichen wie textbasierten, unscharfen Ort-Suche.

Es wird in einem ersten Schritt auf die Analogie zwischen koordinatenbasierter, geographischer Suche und der Textsuche wie Ortsnamen eingegangen.  Der Einsatz eines Suchradiuses mithilfe des kNN-GiST Index wird erl&#228;utert und an einem Beispiel die Leistungsf&#228;higkeit demonstriert. Die Methoden und Werkzeuge zur unscharfen Textsuche wie Regex, Soundex, Metaphone/Demetaphone, fuzzystrmatch/Levenshtein, Trigramm, FTS werden anhand von Fallbeispielen erl&#228;utert und St&#228;rken und Schw&#228;chen der verschiedenen Vorgehensweisen gegeneinander abgewogen. Es wird auf die Problematik mehrsprachiger Ortsnamen eingegangen und gezeigt, wie man auch mehrsprachige Suchanfragen mit der in PostgreSQL standardm&#228;ssig enthaltenen Volltextsuche (FTS) treffsicher beantworten kann. Zum Abschluss wird anhand einer massgeschneiderten Webapplikation auf Basis von GeoDjango illustriert, wie die M&#246;glichkeiten der Ort-Suche mit PostgreSQL/PostGIS dem Endanwender zur Verf&#252;gung gestellt werden k&#246;nnen.</abstract>
        <description></description>
        <persons>
          <person id="296">Stephan Wagner</person>
        </persons>
        <links>
        </links>
      </event>
    </room>
    <room name="1.269 (WS)">
    </room>
    <room name="1.271 (WS)">
    </room>
    <room name="1.208 (WS)">
      <event id="613">
        <start>09:00</start>
        <duration>01:30</duration>
        <room>1.208 (WS)</room>
        <slug></slug>
        <title>Einf&#252;hrung in QGIS</title>
        <subtitle></subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language>de</language>
        <abstract>Der Workshop gibt einen &#220;berblick &#252;ber die Funktionalit&#228;ten von Quantum GIS und vermittelt anhand eines praktischen Workflows, wie man auf einfache Art und Weise ein Projekt aufbaut, Analysen durchf&#252;hrt und eine ansprechende Karte erzeugt.</abstract>
        <description>- Einf&#252;hrung in QGIS Funktionalit&#228;t und GUI
- Aufbau eines Projektes
- Umgang mit dem Thema Projektionen
- Visualisieren und Analysieren von Vektor- und Rasterdaten
- Attributmanagement und Digitalisierfunktionen
- Arbeiten mit Plugins
- Layouten einer druckfertigen Karte
</description>
        <persons>
          <person id="9">Otto Dassau</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="520">
        <start>11:00</start>
        <duration>01:30</duration>
        <room>1.208 (WS)</room>
        <slug></slug>
        <title>Daten aus OpenStreetMap extrahieren, analysieren und filtern mit der Overpass API</title>
        <subtitle></subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language>de</language>
        <abstract>Die Faszination von OpenStreetMap liegt in der Reichhaltigkeit und Vollst&#228;ndigkeit der Daten. Leider bedeutet dies auch, dass die schiere Datenmenge hohe Anforderungen an Werkzeuge zur Auswertung stellt. Mit Overpass API ist es m&#246;glich, per einfacher HTTP-Abfrage &#252;ber das Web die Daten gezielt nach eigenen Kriterien wie Thema oder Ort zu filtern und sogar minutenaktuell zu beziehen.

Die Overpass API wird heute bereits f&#252;r eine Vielzahl von Anwendungen, z.B. zur Qualit&#228;tssicherung, f&#252;r in Echtzeit erzeugte Kartenoverlays, thematische Downloads oder auch zur Beschleunigung der Main API verwendet. Ihren Geschwindigkeitsvorteil erzielt die Overpass API durch eine optimierte Datenhaltung anstatt einer relationalen Datenbank. Ihre Flexibilit&#228;t bezieht sie aus einer Abfragesprache, die einfach ist, aber speziell auf die Bed&#252;rfnisse von OpenStreetMap zugeschnitten.

In diesem Workshop wird in die Abfragesprache systematisch eingef&#252;hrt. Als Beispiele werden ein thematisches Kartenoverlay auf Basis von OpenLayers erstellt, es wird die spezielle Area-Syntax zur Extraktion der Stra&#223;enliste einer Stadt verwendet, und es wird als Beispiel f&#252;r eine komplexere Abfrage das Tool zur Erstellung von Bus- und Bahn-Linienb&#228;ndern und -pl&#228;nen vorgestellt.
</abstract>
        <description></description>
        <persons>
          <person id="280">Roland Olbricht</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="616">
        <start>13:30</start>
        <duration>01:30</duration>
        <room>1.208 (WS)</room>
        <slug></slug>
        <title>PostGIS 2</title>
        <subtitle>Workshop rund um die Version 2</subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language>de</language>
        <abstract>Die Version 2 liegt nun seit April 2012 vor und erfreut sich gro&#223;er Beliebtheit. 

Anhand von einigen Beispielen sollen die PostGIS Version 2 vorgestellt werden. Hierbei liegt der Fokus auf den Neuerungen dieser Version. Welche neuen Funktionen stehen bereit? Neue Funktionen zur Datenbereinigung. Rasterunterst&#252;tzung. Topologien. TypMod.

Der Workshop richtet sich an Anwender, die bereits Erfahrungen im Umgang mit PostGIS haben. Anhand von Beispielen sollen die Neuerungen im Workshop ausprobiert werden.</abstract>
        <description>Die Liste der Neuerungen in der Version 2 ist sehr lang, und zu Recht wurde hier der Hauptversionssprung gew&#228;hlt. In Workshop werden einige Neuerungen pr&#228;sentiert. Au&#223;erdem wird angesporchen, was beim Wechsel nach PostGIS 2 zu beachten ist.

* geometrycolumns ist nun eine Sicht (wie auch geographycolumns), die aus dem Systemkatalog aufgebaut wird, und keine Tabelle mehr
* Unterst&#252;tzung der Installation von PostGIS &#252;ber CREATE EXTENSION (ab PostgreSQL 9.1)
* neue Unterst&#252;tzung f&#252;r Raster
* Topologie-Unterst&#252;tzung &#8211; setzt die SQL/MM Vorgaben um und stellt weitere Funktionen bereit
* verbesserte 3D Unterst&#252;tzung
* N-dimensionaler r&#228;umlicher Index
* neue 3D Typen TIN und PolyHedralSurface
* viele tolle neue Funktionen ** ST_Split ** ST_Snap ** Datenbereinigung: STIsValidDetail, STMakeValid, ST_RemoveRepeatedPoints
* KNN Gist Index (K Nearest Neighbor Index) f&#252;r schnellere Distanzabfragen mit Limit
* der Shapefile Loader kann nun mehrere Shape-Dateien laden</description>
        <persons>
          <person id="65">Astrid Emde</person>
        </persons>
        <links>
          <link href="http://postgis.org/">http://postgis.org/</link>
          <link href="http://www.fossgis.de/w/images/5/55/Workshop_PostGIS_2_Emde_FOSSGIS_2013.pdf">Workshop_PostGIS_2_Emde_FOSSGIS_2013.pdf (Workshopfolien Astrid Emde)</link>
          <link href="http://www.fossgis.de/w/images/8/8a/Workshop.zip">PostGIS &#220;bungen</link>
        </links>
      </event>
      <event id="615">
        <start>15:30</start>
        <duration>01:30</duration>
        <room>1.208 (WS)</room>
        <slug></slug>
        <title>QGIS-Formulare, Aktionen und DB-Relationen</title>
        <subtitle></subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language>de</language>
        <abstract>QGIS stellt f&#252;r die Gestaltung von Objektformularen 3 M&#246;glichkeiten zur Verf&#252;gung:
Das Standardformular mit der M&#246;glichkeit Attribute ein/auszublenden resp. ein Eingabewidget zuzuweisen.
Drag and Drop Designer: Der Administrator kann das Formulare in Tabs und Gruppen unterscheiden und die Reihenfolge beliebig selber definieren.
Selbst definierte Formulare welche in qtDesigner erstellt werden. Die Gestaltung ist v&#246;llig frei. Das Formular wird in eine .ui (XML) Datei gespeichert und der Kartenebene zugewiesen. Wenn die Widgets mit Spaltennamen der Datenquelle korrespondieren werden die Werte automatisch dargestellt und wieder gespeichert
Meist stehen Datens&#228;tze auch in Beziehungen zu einander (1:1, 1:n, n:m). Eine klassische Dom&#228;ne der relationalen Datenbanken, welche QGIS als Datenquellen einbinden kann. Damit der Anwender aber auch Verkn&#252;pfungen &#252;ber verschiedene Datenbanken und Dateien hinweg definieren kann ben&#246;tigt QGIS einen &#8222;Relations Manager&#8220;. Dieser ist im Moment in Entwicklung und wird an der FOSSGIS 2013 erstmals einem gr&#246;sseren Publikum vorgestellt. Basierend auf diesen Verkn&#252;pfungen k&#246;nnen dann Objektformulare verkn&#252;pft und verschachtelt werden (z.b. alle Fernsehaufnahmen eines Kanalbauwerks verschachtelt in der Objektmaske des Kanalobjekts).
Aktionen dienen zum &#214;ffnen von externen Programmen oder Skripten aus dem Objektformular heraus, oder mit Hilfe des Hotlink-Werkzeugs. So kann z.b. ein verkn&#252;pftes Foto, ein Film, eine PDF-Datei oder eine Webapplikation aufgerufen werden. Aktionen k&#246;nnen in den Ebeneneigenschaften festgelegt werden und k&#246;nnen entweder f&#252;r alle Betriebssysteme ident definiert werden oder f&#252;r jedes Betriebssysteme separat. Neben Programmen k&#246;nnen auch Python-Skripte aufgerufen werden &#8211; dabei steht die vollst&#228;ndige QGIS API zur Verf&#252;gung. Dem Programm oder Skript wird alternativ entweder ein Attributwert oder ein Ausdruck des Expression-Builders &#252;bergeben.</abstract>
        <description>F&#252;r die Umsetzung vieler Fachschalen ist es n&#246;tig Formulare f&#252;r die Eingabe von Attributwerten zu gestalten. Zudem werden oft Datenbankrelationen ben&#246;tigt um Tabellen miteinander zu verbinden. Mit Hilfe von Aktionen k&#246;nnen Scripte oder externe Programme aufgerufen werden. Aufgrund von Attributwerten des gew&#228;hlten Geoobjekts k&#246;nnen die Startup-Parameter dieser Programme festgelegt werden.
QGIS stellt f&#252;r die Gestaltung von Objektformularen 3 M&#246;glichkeiten zur Verf&#252;gung:
Das Standardformular mit der M&#246;glichkeit Attribute ein/auszublenden resp. ein Eingabewidget (z.b. Textzeile, Texteditor, Kalender, Slider, Auswahlliste, etc.) zuzuweisen. Die Reihenfolge bei der Auflistung der Attributwerte wird dabei von der Datenquelle vorgegeben.
Drag and Drop Designer: Der Administrator kann das Formulare in Tabs und Gruppen unterscheiden und die Reihenfolge beliebig selber definieren. Die zugeordneten Eingabewidgets werden wie beim Standardformular &#252;bernommen.
Selbst definierte Formulare welche in qtDesigner erstellt werden. Die Gestaltung ist v&#246;llig frei. Das Formular wird in eine .ui (XML) Datei gespeichert und der Kartenebene zugewiesen. Wenn die Widgets mit Spaltennamen der Datenquelle korrespondieren werden die Werte automatisch dargestellt und wieder gespeichert
Zus&#228;tzlich zu den 3 oben erw&#228;hnten Formularoptionen k&#246;nnen Startupskripte (Python) zugewiesen werden. Diese werden beim &#214;ffnen des Objektformulars ausgef&#252;hrt. Damit kann man z.b. Widgets aufgrund vorhandener Daten einschr&#228;nken oder abf&#252;llen oder sonst auf Objektdaten im Formular reagieren.
Meist stehen Datens&#228;tze auch in Beziehungen zu einander (1:1, 1:n, n:m). Eine klassische Dom&#228;ne der relationalen Datenbanken, welche QGIS als Datenquellen einbinden kann. Damit der Anwender aber auch Verkn&#252;pfungen &#252;ber verschiedene Datenbanken und Dateien hinweg definieren kann (z.b. zwischen Oracle und ESRI Shapefiles, oder PostgreSQL und MS SQL Server) ben&#246;tigt QGIS einen &#8222;Relations Manager&#8220;. Dieser ist im Moment in Entwicklung und wird an der FOSSGIS 2013 erstmals einem gr&#246;sseren Publikum vorgestellt. Basierend auf diesen Verkn&#252;pfungen k&#246;nnen dann Objektformulare verkn&#252;pft und verschachtelt werden (z.b. alle Fernsehaufnahmen eines Kanalbauwerks verschachtelt in der Objektmaske des Kanalobjekts). Der Workshop gibt einen Einblick in den momentanen Stand dieser Entwicklung und einen Ausblick auf zuk&#252;nftige M&#246;glichkeiten in diesem Bereich.
Aktionen dienen zum &#214;ffnen von externen Programmen oder Skripten aus dem Objektformular heraus, oder mit Hilfe des Hotlink-Werkzeugs. So kann z.b. ein verkn&#252;pftes Foto, ein Film, eine PDF-Datei oder eine Webapplikation aufgerufen werden. Aktionen k&#246;nnen in den Ebeneneigenschaften festgelegt werden und k&#246;nnen entweder f&#252;r alle Betriebssysteme ident definiert werden oder f&#252;r jedes Betriebssysteme separat. So kann z.b. eine verkn&#252;pfte PDF-Datei in Windows mit Acrobat Reader, in OSX mit Preview und unter Linux mit Evince oder Okular aufgerufen werden. Neben Programmen k&#246;nnen auch Python-Skripte aufgerufen werden &#8211; dabei steht die vollst&#228;ndige QGIS API zur Verf&#252;gung. Dem Programm oder Skript wird alternativ entweder ein Attributwert oder ein Ausdruck des Expression-Builders &#252;bergeben.
Alle drei Teile des Workshops (Formulare, Relationen und Aktionen) dienen der vereinfachten Entwicklung von Fachschalen unter QGIS. Sie sollen &#252;ber die kommenden Monate laufend ausgebaut und verbessert werden.</description>
        <persons>
          <person id="79">Andreas Neumann</person>
          <person id="373">Matthias Kuhn</person>
        </persons>
        <links>
        </links>
      </event>
    </room>
    <room name="1.208a (WS)">
      <event id="502">
        <start>09:00</start>
        <duration>01:30</duration>
        <room>1.208a (WS)</room>
        <slug></slug>
        <title>Einf&#252;hrung in die JavaScript-Kartenbibliothek OpenLayers</title>
        <subtitle>Dynamische Kartenanwendungen f&#252;r jede Webseite</subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language>de</language>
        <abstract>OpenLayers (http://openlayers.org) ist wahrscheinlich die bekannteste und weit verbreitetste JavaScript-Bibliothek, um Kartenmaterial verschiedenster Quellen im Web zu kombinieren und einheitliche Interaktionsm&#246;glichkeiten bereitszustellen. Der Workshop soll die M&#246;glichkeiten der Bibliothek aufzeigen und die Teilnehmer in die Lage versetzen, eigene Kartenanwendungen auf Basis von OpenLayers zu entwickeln. M&#246;glicherweise kann der Workshop bereits auf der sich aktuell in deRentwicklung befindlichen neuen Version OpenLayers 3 abgehalten werden, in jedem Fall werden Neuerungen und Unterschiede zu OpenLayers 2.x vorgestellt.

Im Workshop, der von Andreas Hocevar (openGeo), Fr&#233;d&#233;ric Junod(Camptocamp) und Daniel Koch (terrestris) gehalten wird, werden die folgenden Themen behandelt werden:

OpenLayers Grundlagen: Wie f&#252;gt man mit OpenLayers eine Karte zu einer Webseite hinzu? Arbeiten mit Layern (Themen): Wie kann man Raster- und Vektorlayer in einer OpenLayers Karte kombinieren? Arbeiten mit Controls (Kartenwerkzeugen): Wie erweitere ich meine Karte um spezifische Bedienelemente? Zus&#228;tzlich zu oben genannten Themen werden wir, je nach zur Verf&#252;gung stehender Zeit und den konkreten W&#252;nschen der Teilnehmer, gegebenenfalls die folgenden Aspekte behandeln:

Vektorlayer f&#252;r Fortgeschrittene: Verschiedene M&#246;glichkeiten zur Darstellung von Vektordaten in OpenLayers Integration mit anderen Bibliotheken: Die Kombination von OpenLayers mit anderen Bibliotheken, um noch reichhaltigere Kartenanwendungen im Web zu erstellen Zielgruppe sind alle an Webkartographie Interessierten, die OpenLayers kennen lernen wollen. Auch Teilnehmer, die OpenLayers bereits einsetzen, k&#246;nnen von einem Besuch sicherlich profitieren. Wenn Sie absch&#228;tzen m&#246;chten, ob OpenLayers Ihnen bei Ihrer Fragestellung helfen kann, liefert der Workshop sicherlich erste Antworten.

Vorwissen: Grunds&#228;tzliche Kenntnisse von JavaScript sind n&#252;tzlich, werden aber nicht zwingend vorausgesetzt.
</abstract>
        <description></description>
        <persons>
          <person id="173">Andreas Hocevar</person>
          <person id="363">Daniel Koch</person>
          <person id="364">Fr&#233;d&#233;ric  Junod</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="503">
        <start>11:00</start>
        <duration>01:30</duration>
        <room>1.208a (WS)</room>
        <slug></slug>
        <title>Einf&#252;hrung in Rich Map Clients mit GeoExt</title>
        <subtitle>Anspruchsvolle Benutzeroberfl&#228;chen f&#252;r Kartenanwendungen programmieren</subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language></language>
        <abstract>GeoExt (http://geoext.org) ist eine auf den JavaScript-Bibliotheken OpenLayers (f&#252;r Karten im Web, http://openlayers.org) und Ext JS (f&#252;r interaktive Webanwendungen, http://www.sencha.com/products/js/) aufbauende JavaScript- Bibliothek, die es vereinfacht, Kartenmaterial in ansprechenden und komplexen Oberfl&#228;chen im Web zu pr&#228;sentieren.

Im Workshop, der von Andreas Hocevar (OpenGeo), Fr&#233;d&#233;ric Junod (camptocamp) und Daniel Koch (terrestris) gehalten wird, werden die folgenden Themen behandelt:

* GeoExt Grundlagen: Wie erzeugt man ein verschiebbares Kartenfenster inklusive WMS-Layer mit GeoExt?
* WMS mit Readern und Stores: Verwendung der Methoden GetCapabilities, GetMap, GetFeatureInfo und GetLegendGraphic, um das Potential der standardisierten Interaktionen mit den Diensten auszusch&#246;pfen
* WFS einfach gemacht: Wir entwickeln einen WFS-T Editor mit automatisch synchronisierter Karten- und Tabellendarstellung der geographischen Features

Zus&#228;tzlich zu oben genannten Themen werden wir, je nach zur Verf&#252;gung stehender Zeit und den konkreten W&#252;nschen der Teilnehmer, gegebenenfalls die folgenden Aspekte behandeln:

Weitere OGC Standards
* WFS GetCapabilities und DescribeFeatureType
* Filter Encoding (FE) and Styled Layer Descriptor (SLD)

Zielgruppe sind alle an Webkartographie Interessierten, die bereits OpenLayers kennen und ansprechende Oberfl&#228;chen mit GeoExt entwickeln m&#246;chten. Auch Teilnehmer, die GeoExt bereits einsetzen, k&#246;nnen von einem Besuch sicherlich profitieren, etwa um die Eigenschaften der k&#252;rzlich erschienenen Version 1.1 kennenzulernen. Wenn Sie absch&#228;tzen m&#246;chten, ob OpenLayers, Ext JS und GeoExt Ihnen bei Ihrer Fragestellung helfen kann, wird der Workshop erste Antworten liefern. Grunds&#228;tzliche Kenntnisse von JavaScript, OpenLayers und Ext JS sind sicherlich n&#252;tzlich, werden aber nicht zwingend vorausgesetzt.
</abstract>
        <description></description>
        <persons>
          <person id="173">Andreas Hocevar</person>
          <person id="363">Daniel Koch</person>
          <person id="364">Fr&#233;d&#233;ric  Junod</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="508">
        <start>13:30</start>
        <duration>01:30</duration>
        <room>1.208a (WS)</room>
        <slug></slug>
        <title>Entwicklung von Quantum GIS Plugins auf der Basis von PyQT und PyQGIS </title>
        <subtitle></subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language>de</language>
        <abstract>Mit dem Schreiben von Python-Plugins oder Python-Applikationen er&#246;ffnen sich m&#228;chtige M&#246;glichkeiten, um QGIS zur L&#246;sung eigener Fragestellungen zu erweitern oder Komponenten von QGIS in eigenen Applikationen zu verwenden. Die Teilnehmer kennen nach dem Workshop den Einstieg in die QGIS Plugin-Entwicklung mit Python und PyQGIS</abstract>
        <description></description>
        <persons>
          <person id="13">Horst D&#252;ster</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="575">
        <start>15:30</start>
        <duration>01:30</duration>
        <room>1.208a (WS)</room>
        <slug></slug>
        <title>Kartenerstellung und Bearbeiten von Legenden mit gvSIG CE</title>
        <subtitle></subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language>de</language>
        <abstract>gvSIG CE ist ein Open Source Desktop GIS von hoher Leistungsf&#228;higkeit zur Bearbeitung von CAD-, GIS- und in der Kartografie gebr&#228;uchlichen Dateiformaten (Vektor und Raster). Das Programm zeichnet sich durch eine gro&#223;e Benutzerfreundlichkeit und einfache Bedienung aus. Es ist stabil und mit den wichtigsten GIS Funktionen ausgestattet.
In diesem Workshop werden wir einen &#220;berblick &#252;ber die zahlreichen M&#246;glichkeiten bieten, die gvSIG CE f&#252;r die Erstellung von Karten bereith&#228;lt.
Die umfangreiche Werkzeugpalette von gvSIG CE wird verwendet, um die bestm&#246;gliche Ausgestaltung der Karten zu gew&#228;hrleisten: verschiedene Legendentypen (Intervalle, proportional skalierte Symbole), individuelle Gestaltung von Legenden mit Hilfe des Symboleditors, Nutzung eigener Symbole (z.B. als Grafik) nach Verwendung der gvSIG Symbolbibliothek, benutzerdefinierte/individuelle und automatische Beschriftungen, Diagramme, etc.
Legenden werden im .gvl-Format abgespeichert, eigene Symbole in der Standardbibliothek f&#252;r Symbole abgelegt. Die finale Vorlage f&#252;r die Karten wird als gvSIG-Template (.gvt-Format) erzeugt, die auch f&#252;r zuk&#252;nftige Kartenerstellungen beliebig angepasst oder ver&#228;ndert werden kann.
F&#252;r die automatische und schnelle Erstellung von Karten kann man die Funktion "Schnell Druck" verwenden, mit der man vorgefertigte Karten per Knopfdruch einfach erzeugen kann.
Mit dem Dokumenttyp "Karte" bietet gvSIG CE die M&#246;glichkeit, die Geodaten kartografisch mit allen notwendigen Elementen darzustellen: Ma&#223;stab, Legende, Nordpfeil, Logos, etc. Nach Fertigstellung der Karten k&#246;nnen diese als pdf oder ps exportiert werden.
</abstract>
        <description></description>
        <persons>
          <person id="68">Ruth Sch&#246;nbuchner</person>
        </persons>
        <links>
        </links>
      </event>
    </room>
    <room name="1.212 (WS)">
      <event id="569">
        <start>09:00</start>
        <duration>01:30</duration>
        <room>1.212 (WS)</room>
        <slug></slug>
        <title>Mapbender3 Workshop</title>
        <subtitle>Aufbau und Konfiguration einer WebGIS Anwendung mit Mapbender3</subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language>de</language>
        <abstract>Der Workshop soll den Teilnehmern einen ersten Einstieg in die Erstellung von Kartenanwendungen auf Basis von Mapbender3 geben. Neben einem &#220;berblick &#252;ber die neue Architektur auf Basis von Symfony 2 und OpenLayers und der Vorstellung des Frontends mit seinen Komponenten wird die Verwendung des Backends zur Verwaltung von Anwendungen im Mittelpunkt stehen.

Die Teilnehmer werden Mapbender3 in wenigen Schritten selbst installieren. Anschlie&#223;end wird &#252;ber das browserbasierte Administrations-Backend der Aufbau von eigenen Anwendungen erl&#228;utert. Der Aufbau eines Dienste-Repositories wird vorgestellt. Es werden Benutzer und Gruppen angelegt. Au&#223;erdem erfolgt ein Einstieg in die Rechteverwaltung. Abschlie&#223;end wird die Konfiguration &#252;ber yml-Dateien vorgestellt.

</abstract>
        <description>Inhalt des Workshops:
* Installation von Mapbender3
* Erl&#228;uterung der wichtigsten Einstellungen und Logfiles
* Vorstellung Webseite, Dokumentation, API-Dokumentation
* Vorstellung der Backend-Komponenten
* Erstellung einer Applikation (Kartenanwendung) inkl. Berechtigungen
* Aufbau eines Dienste-Repositories
* Einrichten von Benutzern und Gruppen sowie Rechteverwaltung
* Konfiguration &#252;ber yml-Dateien</description>
        <persons>
          <person id="65">Astrid Emde</person>
        </persons>
        <links>
          <link href="http://mapbender3.org">http://mapbender3.org</link>
          <link href="http://demo.mapbender3.org">http://demo.mapbender3.org</link>
          <link href="http://doc.mapbender3.org">http://doc.mapbender3.org</link>
          <link href="http://svn.osgeo.org/mapbender/trunk/documents/presentations/FOSSGIS2013/Mapbender3_Workshop_FOSSGIS_2013_AEmde.pdf">Mapbender3_Workshop_FOSSGIS_2013_AEmde.pdf (Workshopfolien Mapbender3 Workshop Astrid Emde)</link>
        </links>
      </event>
      <event id="592">
        <start>11:00</start>
        <duration>01:30</duration>
        <room>1.212 (WS)</room>
        <slug></slug>
        <title>Cartaro - Geospatial CMS</title>
        <subtitle>Management von r&#228;umlichen Daten im CMS</subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language></language>
        <abstract>Cartaro ist ein Content Management System, mit dem r&#228;umliche Daten nahtlos mit Texten und Bildern kombiniert, verwaltet und publiziert werden. Cartaro verbindet dabei die St&#228;rken des CMS Drupal mit etablierten Open Source GIS-Projekten, allen voran GeoServer, GeoWebCache, PostGIS und OpenLayers. Mit Cartaro lassen sich &#252;ber die m&#228;chtige Administrationsoberfl&#228;che von Drupal ohne Programmierung sowohl allgemeine Webseiten wie auch spezialisierte Geoportale und komplette Geodateninfrastrukturen entwickeln. 

Im Workshop werden auf der Basis einer vorhandenen Cartaro-Installation die Schritte von der Erstellung bis zur Publikation von Geodaten in Cartaro demonstriert:

* Definition eines neuen r&#228;umlichen Datensatzes
* Digitalisieren in der Weboberfl&#228;che
* Hochladen von Daten
* Ausgabe als WMS/WFS
* Einstellung der Zugriffsrechte f&#252;r Daten und Dienste
* Darstellung der Daten in Karten
* Konfiguration von OpenLayers-Karten
* Funktionserweiterung &#252;ber Drupal-Module
* Individuelle Design-Anpassungen

Mit dem Workshop werden die Kenntnisse vermittelt, um &#252;ber die Administrationsoberfl&#228;che von Cartaro ein Geoportal zu entwerfen. Daneben erhalten die Teilnehmer einen ersten Einblick, welche Anpassungsm&#246;glichkeiten &#252;ber individuelle Programmierung bestehen. Es sind keine speziellen Vorkenntnisse erforderlich.</abstract>
        <description></description>
        <persons>
          <person id="176">Uli M&#252;ller</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="611">
        <start>13:30</start>
        <duration>01:30</duration>
        <room>1.212 (WS)</room>
        <slug></slug>
        <title>Interoperability for web portrayal services : a use case with deegree3</title>
        <subtitle></subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language></language>
        <abstract>Concisely, interoperability is the ability of diverse systems to work together. But how to do that when the work is about cartographic styling? This workshop wants to emonstrate how portrayal interoperability is possible within a modern spatial data infrastructure through OpenGIS standards from the Open Geospatial Consortium like OGC Styled Layer Descriptor WMS profile and Symbology Encoding (OGC SLD/SE 1.1). The workshop will guide attendees all along a fictional use case to discover how to inter-operate OGC SLD compliant systems and what are the cartograp&#293;ic abilities of OGC SE. To conclude, an overview of what may be the evolution of these abilities will be experienced.</abstract>
        <description></description>
        <persons>
          <person id="359">Olivier Ertz</person>
          <person id="265">Stefan Keller</person>
        </persons>
        <links>
          <link href="http://wiki.deegree.org">deegree open source software for spatial data infrastructures and the geospatial web</link>
        </links>
      </event>
      <event id="512">
        <start>15:30</start>
        <duration>01:30</duration>
        <room>1.212 (WS)</room>
        <slug></slug>
        <title>Sch&#246;ne Karten mit TileMill erstellen und in die Cloud ver&#246;ffentlichen</title>
        <subtitle></subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language>de</language>
        <abstract>Der Workshop richtet sich an alle, die sch&#246;ne, interaktive thematische Karten entweder in die Cloud oder ohne "grosse" GIS-Infrastruktur auf eigene Webserver stellen wollen. Es werden u.a. GIS Cloud, QGIS Cloud und CartoDB vorgestellt. Ein Schwerpunkt bildet das Kennenlernen des TileMill-Programms (multi-plattform) und dessen Grafikkonfigurations-Sprache CartoCSS. Dazu kommen Erl&#228;uterungen zu Datenformaten wie SpatiaLite (Vektor/Eingabe) und MBTiles (Raster-Kacheln/Ausgabe). Der Workshop ben&#246;tigt nebst grundlegendem Kartenverst&#228;ndnis keine Programmier- sondern h&#246;chstens HTML-Kenntnisse.</abstract>
        <description></description>
        <persons>
          <person id="265">Stefan Keller</person>
        </persons>
        <links>
          <link href="http://giswiki.hsr.ch/Workshop_TileMill">http://giswiki.hsr.ch/Workshop_TileMill</link>
        </links>
      </event>
    </room>
  </day>
  <day date="2013-06-14" index="3">
    <room name="Aula / 4.1000">
    </room>
    <room name="5.001">
      <event id="555">
        <start>09:00</start>
        <duration>00:30</duration>
        <room>5.001</room>
        <slug></slug>
        <title>Schweizmobil Geodatawarehouse</title>
        <subtitle>open source GIS und ERP</subtitle>
        <track>Vortr&#228;ge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract>Die Stiftung Schweizmobil bietet Informationen rund um Langsamverkehr in der Schweiz auf ihrer Webseite www.schweizmobil.ch an. Da fast s&#228;mtliche Informationen einen starken Raumbezug haben, werden die Daten neu in einer r&#228;umlichen Datenbank verwaltet., besteht bereits seit einiger Zeit eine enge Verkn&#252;pfung zur Webkarte, z.B. &#252;ber ein API oder Direktlinks. Die Daten hinter der Webseite wurden aber bis jetzt &#252;ber eine nicht-r&#228;umliche Datenbank verwaltet.
Mit dem Projekt WebDB hat die Stiftung SchweizMobil das Ziel, die Datenbank-Infrastruktur komplett zu erneuern und die Vorteile einer r&#228;umlichen Datenbank verkn&#252;pft mit einem komplexen Datenverwaltungssystem zu nutzen. Die  Daten werden in einer Postgres / PostGIS Datenbank abgelegt und &#252;ber ein OpenObjects-basiertes Interface verwaltet. OpenObject bietet durch ihren Einsatz in BI-Software (OpenERP) weitgehende M&#246;glichkeiten f&#252;r die Verwaltung der SchweizMobil-Daten, insbesondere mit dem GeoEngine, welches die Visualisierung der geographischen Informationen in Karten erm&#246;glicht.
Das System ist seit Februar produktiv und erlaubt, die Daten auf der Schweizmobil-Webseite auf einfache Art und Weise aktuell zu halten.

Dieser Vortag zeigt auf, wie Open Source Komponente aus der Geo- und ERP-Welt optimal zusammen eingesetzt werden k&#246;nnen um das ganze Potenzial von Open Source Software zu nutzen.</abstract>
        <description></description>
        <persons>
          <person id="336">Elisabeth Leu</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="509">
        <start>09:30</start>
        <duration>00:30</duration>
        <room>5.001</room>
        <slug></slug>
        <title>Qualit&#228;tssicherung von Geodaten auf der Basis von Web Processing Services (WPS)</title>
        <subtitle></subtitle>
        <track>Vortr&#228;ge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract>Bevor neue Daten in eine Geodaten-Infrastruktur &#252;berf&#252;hrt werden, m&#252;ssen sie Qualit&#228;tssicherungs-Verfahren durchlaufen. Diese Prozesse k&#246;nnen sowohl generisch, als auch speziell f&#252;r ein bestimmtes Datum konfektioniert sein. Um Sicher zu stellen, dass diese Prozesse langlebig und verf&#252;gbar sind, bietet es sich an OGC-Konforme Services zu diesem Zweck zu nutzen. Deshalb werden im Vortrag die Vor- und Nachteile OGC-Konformer Web Processing Services (WPS) als Basis der Qualit&#228;tssicherung von Geodaten diskutiert. </abstract>
        <description></description>
        <persons>
          <person id="13">Horst D&#252;ster</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="582">
        <start>10:00</start>
        <duration>00:30</duration>
        <room>5.001</room>
        <slug></slug>
        <title>Geodaten absichern mit MapProxy</title>
        <subtitle></subtitle>
        <track>Vortr&#228;ge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>MapProxy kann als Kartenproxy WMS und Kachelanfragen nicht nur weiterleiten, verarbeiten und beschleunigen, sondern diese auch absichern. Der Vortrag erl&#228;utert die Sicherheitsfunktionen von MapProxy mit der Kartendienste benutzerspezifisch Abgesichert werden k&#246;nnen.

Benutzer A darf alle Layer betrachten, aber keine Feature Informationen Abrufen; Benutzer B darf nur auf zwei Layer mittels WMTS zugreifen, nicht aber auf den WMS; Benutzer C darf nur auf einen Layer zugreifen, aber nur innerhalb seiner Gemeinde. Diese und andere Beschr&#228;nkungen k&#246;nnen mit der Sicherheitsschicht von MapProxy umgesetzt werden.

MapProxy erm&#246;glicht die Einschr&#228;nkungen auf einzelne Dienste (WMS/WMTS/TMS/KML), Anfragen (GetMap/GetFeatureInfo) und Layer. Diese Einschr&#228;nkungen k&#246;nnen f&#252;r jeden Benutzer einzeln gesteuert werden.

Neben der Freigabe von gesamten Layern kann die Sicherheitsschicht auch auf exakte Gebiete angewandt werden. So kann zum Beispiel &#252;ber Polygone definiert werden, auf welche Bereiche einzelne Benutzer zugreifen d&#252;rfen und auf welche nicht. Bereiche ausserhalb des zugelassenen Bereiches werden f&#252;r den Benutzer ausgeblendet.
Diese Funktion wird sowohl vom WMS wie auch von den Kacheldiensten unterst&#252;tzt (WMTS/TMS/KML).

Keine Anwendung gleicht der Anderen &#8211; daher wurde die Sicherheitsschicht als offene Schnittstelle entwickelt. So k&#246;nnen vorhandene Benutzerdatenbanken eingebunden und auch ausgefallenere Sicherheitsl&#246;sungen umgesetzt werden.

Der Vortrag zeigt Praxisnah was mit der MapProxy Sicherheitsschicht m&#246;glich ist und wie typische Nutzungen umgesetzt werden k&#246;nnen.
</abstract>
        <description></description>
        <persons>
          <person id="153">Oliver Tonnhofer</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="604">
        <start>11:00</start>
        <duration>00:30</duration>
        <room>5.001</room>
        <slug></slug>
        <title>Tile based map publishing with WMTS TileServer, MapTiler and TileMill</title>
        <subtitle>Fast online maps for web, mobile and desktop applications from a traditional Apache/PHP/MySQL web hosting or from the Amazon S3 cloud</subtitle>
        <track>Vortr&#228;ge (GIS)</track>
        <type>lecture</type>
        <language>en</language>
        <abstract>Almost all mapping applications available today on the web and in mobile devices are in fact using tiles as the core for online distribution of maps. This presentation shortly explains the tiling basics and shows the open-source software typically used for generating and distributing tiled maps in the most popular Spherical Mercator system (EPSG:3857 / EPSG:900913) visible in Google Maps, OpenStreetMap, Bing Maps and other online maps.
The tools for rendering maps such as the MapTiler (powered by GDAL/GDAL2Tiles) and TileMill (powered by Mapnik) will be demonstrated.
The presentation also introduces a new open-source project called TileServer which allows to distribute rendered map tiles (directory or MBTiles) from any ordinary web server (Apache/MySQL) in the standardised OpenGIS WMTS format without a need to install, configure or maintain any additional dynamic software or web server extension. Any traditional web hosting can be therefore used for online distribution of maps. It is a rapid, extremely high-performance and scalable way how to publish maps. Hosting of the rendered maps is also possible from the cloud, such as Amazon S3/CloudFront or RackSpace Files. The published custom maps can be used in HTML5/JavaScript applications (OpenLayers/Leaflet), on mobile devices (iOS: MapKit/RouteMe, Android: OSMDroid), or even opened in desktop GIS systems such as QGIS, UDig and ESRI ArcGIS Desktop. This presentation contains a practical demonstration of map tile rendering and online publishing.</abstract>
        <description></description>
        <persons>
          <person id="327">Petr Pridal</person>
        </persons>
        <links>
          <link href="http://www.maptiler.org/">MapTiler Project website</link>
          <link href="http://www.maptiler.org/google-maps-coordinates-tile-bounds-projection/">Spherical Mercator and Tiling Systems</link>
          <link href="http://mapbox.com/tilemill/docs/crashcourse/introduction/">MapBox TileMill basics</link>
          <link href="https://github.com/klokantech/tileserver-php/">TileServer.php project</link>
        </links>
      </event>
      <event id="580">
        <start>11:30</start>
        <duration>00:30</duration>
        <room>5.001</room>
        <slug></slug>
        <title>Aufbau eines webbasierten Netzinformationssystems mit CAD und freier Software</title>
        <subtitle></subtitle>
        <track>Vortr&#228;ge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract>s.u.</abstract>
        <description>1	Ausgangssituation
Die Werraenergie GmbH in Bad Salzungen ist als regionaler Energiedienstleister zust&#228;ndig f&#252;r die Belieferung von rund 20.000 Haushalten in zwei Th&#252;ringer Landkreisen mit Gas und W&#228;rme. Anfang 2013 &#252;bernahm das Unternehmen zudem den Betrieb des regionalen Stromnetzes und beliefert seitdem zus&#228;tzlich rund 6.000 Haushalte mit Strom. Insgesamt werden zur Zeit 826 km Rohrnetz betreut, die Nacherfassung des Stromnetzes h&#228;lt noch an. 

Neben der Aufgabe als reiner Energielieferant agiert die Werraenergie auch als technischer Betreiber der Energienetze sowie als Beratungsstelle f&#252;r Energie und Ressourcenschutz. Dementsprechend umfangreich sind auch die Anforderungen der verschiedenen Fachbereiche an Software zur Wahrnehmung der jeweiligen Aufgaben. 

Im Zuge der &#220;bernahme des Stromnetzes und den daraus resultierenden Anforderungen an Netzdokumentation, Beauskunftung und Planung, entschied sich das Unternehmen f&#252;r die Abl&#246;sung der bestehenden dezentralen Softwarel&#246;sung durch ein zentrales webbasiertes Netzdokumentationssystem. Folgende Module sollten umgesetzt werden:

Erfassung und Pflege des Netzes &#252;ber bew&#228;hrte CAD-Software
Speicherung der Daten in einer zentralen Datenbank
Umsetzung verschiedener Webapplikationen f&#252;r
OGC-konformes WebGIS
Netzauskunft
Wartungsmanagement
Dokumentenmanagement
Trassenplanung
St&#246;rungsmanagement
mobiles GIS

2	Umsetzung 
Die Umsetzung erfolgte als OGC-konforme Geodateninfrastruktur, da sowohl die &#220;bernahme von Daten der Landesvermessung (Luftbilder, Liegenschaftsdaten) als auch die Abgabe von Daten in Form von Diensten (z.B. f&#252;r die Webauskunft) vorgesehen ist. Zum Einsatz kamen neben OpenSource-Software wie MapServer, PostgreSQL/PostGIS und Mapbender3 auch AutoCAD Map.

2.1	Daten&#252;bernahme
Die Erfassung der Netzdaten erfolgte bisher ausschlie&#223;lich &#252;ber CAD in eine Oracle-Datenbank. Das vorliegende Datenmodell musste daher zun&#228;chst in eine OGC-konforme Struktur &#252;berf&#252;hrt werden. Zum Import der Daten in die PostgreSQL-Datenbank wurde die freie Software GeoKettle verwendet, ein r&#228;umliches ETL-Programm, mit dem Geodaten extrahiert, transformiert und geladen werden k&#246;nnen. Ziel war es, die im alten Datenmodell in verschiedenen Tabellen verteilt vorliegenden Daten in einer Tabelle zu aggregieren. Sachdaten und Geometrien (als Textfelder mit X/Y-Werten) waren zudem auf verschiedenene Tabellen verteilt und sollten ebenfalls zusammengef&#252;hrt werden. Ein weiteres &#8222;CAD-typisches&#8220; Problem war, dass in den Tabellen neben dem eigentlichen Objekt auch dessen Beschriftung als eigener Datensatz vorlag. Diese sollten voneinander getrennt und in einer separaten Annotation-Tabelle abgelegt werden. F&#252;r die verschiedenen datenmodellierenden Aufgaben wurden mit GeoKettle Transformationsmodelle erstellt, die f&#252;r alle zuk&#252;nftigen Importe eingesetzt werden k&#246;nnen. Diese Modelle enthalten &#228;hnlich einem Skript alle notwendigen Prozesse f&#252;r die Datenmigration, angefangen beim Einlesen der Daten aus den verschiedenen Datenquellen &#252;ber die Transformationen der Daten in das neue Modell bis hin zur Erzeugung der neuen Datenbankstruktur und dessen Bef&#252;llung.

Ergebnis der Migration war ein objektbasiertes Datenmodell mit klarer Zuordnung von Lage, Attributen und Geometrien im OGC simple feature model.

2.2	Erfassung und Pflege mit AutoCAD Map
Die Erfassung und Pflege der Objekte sollte auch weiterhin an leistungsstarken Desktop-Arbeitspl&#228;tzen mittels CAD erfolgen. Die Wahl fiel auf AutoCAD Map mit konfektionierten Erfassungsmasken. Durch Nutzung der OSGeo-Software FDO Data Access Technology kann das CAD direkt in die zentrale PostgreSQL-Datenbank speichern. Durch die Software konnte ein direkter Datenaustausch zwischen Erfassungspl&#228;tzen und Fachanwendungen eingerichtet werden, der die permanente Aktualit&#228;t der Datengrundlage f&#252;r alle Anwendungen sicherstellt.

2.3	Webapplikationen
Bei den bisher eingesetzten Fachanwendungen handelte es sich um Desktop-Programme, die zum Teil auf separate Datenquellen zugriffen. Eine zentrale Datenbank f&#252;r alle Anwendungen existierte nicht. Ziel des neuen Netzinformationssystems sollte es dementsprechend sein, den aktuellen Leitungsdatenbestand f&#252;r die oben genannten Anwendungen verf&#252;gbar zu machen. Die Umsetzung sollte webbasiert erfolgen; zum einen, um arbeitsplatzunabh&#228;ngig auf alle Applikationen zugreifen zu k&#246;nnen, zum anderen um zuk&#252;nftig weitere Anwendungen wie eine Internetauskunft oder mobile L&#246;sungen realisieren zu k&#246;nnen.

Die Umsetzung erfolgte mit UMN MapServer und Mapbender3. 

3	Zielsetzung und Schwerpunkt des Vortrags
Ziel des Vortrags soll es weniger sein, die Umsetzung des Netzinformationssystems als OGC-konforme GDI zu beschreiben, sondern vielmehr auf die Besonderheiten und Herausforderungen des Projektes einzugehen.

Hervorgehoben werden vor allem folgende Aspekte:

&#220;berf&#252;hrung der bestehenden Datenbankstruktur in ein zentrales, relationales und OGC-konformes Datenmodell: Die eingesetzte Software GeoKettle ist ein leistungsstarkes und intuitives Tool zur Automatisierung komplexer Datenmigrationen. Die bei dem Projekt gemachten Erfahrungen sind interessant f&#252;r alle Fachanwender, die gro&#223;e Mengen an Sach- und Geodaten verwalten. 
Kopplung von CAD- und GIS-Welt mit FDO: Mit der  FDO Data Access Technology wurden nicht nur freie und propriet&#228;re Software miteinander gekoppelt, viel interessanter ist die Verkn&#252;pfung von CAD und GIS-Welt &#252;ber einen zentralen Datenbestand. Das System stellt somit f&#252;r alle Bereiche, in denen CAD und GIS eine Rolle spielen, eine interessante L&#246;sung dar, wie der Energie- und Versorgungssektor, Facilitymanagement oder Stadt- und Landschaftsplanung. </description>
        <persons>
          <person id="70">Olaf Knopp</person>
        </persons>
        <links>
        </links>
      </event>
    </room>
    <room name="5.003">
    </room>
    <room name="3.008">
      <event id="593">
        <start>09:00</start>
        <duration>00:30</duration>
        <room>3.008</room>
        <slug></slug>
        <title>Analyse strukturgeologischer 3D-Daten in PostGIS</title>
        <subtitle>Eine Entscheidungsgrundlage bei der Bewilligung von Erdw&#228;rmesonden</subtitle>
        <track>Vortr&#228;ge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Im Zuge steigender Energiekosten werden geothermische Heizanlagen in der Schweiz immer beliebter. Um Risiken bei der Anlage von Erdw&#228;rmesonden zu vermeiden ist es entscheidend, neben zweidimensionalen Oberfl&#228;chendaten auch die r&#228;umliche Geometrie der im Untergrund befindlichen Schichten zu kennen. Zur Entscheidungsfindung f&#252;r die Bewilligung von Erdsonden wurde eine Abfrageroutine in PostGIS entwickelt. Die geologischen Schichten wurden in GOCAD, einer propriet&#228;ren geologischen Software, modelliert und als 3D-Geometrien in PostGIS importiert. Die Abfrageroutine liefert f&#252;r jeden Punkt auf Basis einer langen Reihe von Kriterien als Ergebnis die Zul&#228;ssigkeit einer Erdw&#228;rmesonde, die zul&#228;ssige Bohrtiefe sowie einen spezifischen erl&#228;uternden Text mit Begr&#252;ndungen und allf&#228;lligen Auflagen. 
Der Vortrag demonstriert einerseits die Abfrageroutine und geht weiter auf die M&#246;glichkeiten und Grenzen der Ablage und Analyse von geologischen 3D-Daten in PostGIS ein.
</abstract>
        <description></description>
        <persons>
          <person id="176">Uli M&#252;ller</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="556">
        <start>09:30</start>
        <duration>00:30</duration>
        <room>3.008</room>
        <slug></slug>
        <title>WebGL f&#252;r die Geomatik</title>
        <subtitle>Perspektiven im Geomatik Bereich</subtitle>
        <track>Vortr&#228;ge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract>Die Verbreitung der HTML5-Norm erlaubt es, neue Technologien zu einzusetzen. WebGL, als Teil der HTML5-Norm, erm&#246;glicht es die Rechenst&#228;rke der Graphikkarte zu benutzen. Hoch performante 2D-Webmapping Anwendungen sollen dieses Prinzip nutzen. Als Beispiel bietet Google Maps/WebGL neue Funktionalit&#228;ten sowie eine verbesserte Ergonomie im Vergleich zur klassischen Anwendung. Im 3D Bereich, wo Berechnungen sehr aufw&#228;ndig sind, kann man jetzt mit dieser neuen Technologie Web-Anwendungen entwickeln, die ohne Plugin in einem Browser laufen.

Diese Pr&#228;sentation wird die WebGL Technologie vorstellen sowie ihre potentielle Einsatzm&#246;glichkeit im WebGIS Bereich. Ausserdem werden Synergien zwischen 2D und 3D Webmapping-Anwendungen angedeutet.</abstract>
        <description></description>
        <persons>
          <person id="76">Emmanuel Belo</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="588">
        <start>10:00</start>
        <duration>00:30</duration>
        <room>3.008</room>
        <slug></slug>
        <title>3D-Stadtmodelle in PostGIS mit der 3D City Database</title>
        <subtitle></subtitle>
        <track>Vortr&#228;ge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract>3D-Stadtmodelle in PostGIS mit der 3D City Database

Mit der 3D City Database ist es m&#246;glich CityGML-basierte virtuelle 3D-Stadtmodelle in einem Datenbank Management System (DBMS) zu speichern. Es handelt sich dabei um ein relationales Datenbankschema, das aus dem Datenmodell des OGC-Standards CityGML abgeleitet und f&#252;r Datenbank-Routinen optimiert wurde. &#220;ber eine einfach zu bedienende Java-basierte Client-Anwendung k&#246;nnen 3D-Modelle in die Datenbank im- und exportiert werden. Die freie, quelloffene Software wurde in den letzten Jahren ma&#223;geblich von dem Institut f&#252;r Geod&#228;sie und Geoinformationstechnik (IGG) an der TU Berlin unter der Leitung von Prof. Thomas H. Kolbe entwickelt und unterst&#252;tzt seit Sommer letzten Jahres neben Oracle Spatial endlich auch die freie Geodatenbank PostGIS. 

Die 3D-Unterst&#252;tzung von PostGIS wurden zuletzt mit dem Release der 2.0 Version im April 2012 stark erweitert. Bei der derzeit noch recht geringen Auswahl an Werkzeugen zum Austausch und Bearbeiten von dreidimensionalen Geodaten, liefert die 3D City Database ein hervorragendes Beispiel einer effizienten wie leistungsstarken 3D-Datenbank auf PostGIS. 

Der Vortrag wird die zum Einen die technischen Hintergr&#252;nde rund um CityGML und den Datenbankaufbau erl&#228;utern und zum Anderen praktische Anwendungsbeispiele im Bereich der Web-Visualisierung von Stadtmodellen pr&#228;sentieren.</abstract>
        <description>Mit der 3D City Database, in der Folge mit 3DCityDB abgek&#252;rzt, ist es m&#246;glich, CityGML-basierte virtuelle 3D-Stadtmodelle in PostgreSQL/PostGIS oder Oracle Spatial zu speichern. Die Software umfasst zum einen ein relationales Datenbank-Schema, welches auf dem Datenbank Management System (DBMS) aufsetzt, und zum anderen die Java-basierte Client-Anwendung Importer/Exporter, mit dessen Hilfe Stadtmodell-Daten im CityGML-Format unabh&#228;ngig von Gr&#246;&#223;e und Komplexit&#228;t hochperformant in die Datenbank hinein und wieder heraus geschrieben werden k&#246;nnen. Die 3DCityDB stellt damit eine einfach zu bedienende, leistungsf&#228;hige und vor allem offene Schnittstelle zum Verwalten, Analysieren und Austauschen von 3D-Stadtmodellen bereit. Die Software ist urspr&#252;nglich aus dem Forschungsprojekt &#8222;Geodatenmanagement in der Berliner Verwaltung - Amtliches 3D-Stadtmodell f&#252;r Berlin&#8220; [1] hervorgegangen und wurde ma&#223;geblich von dem Institut f&#252;r Kartographie und Geoinformation (IKG) an der Uni Bonn und dem Institut f&#252;r Geod&#228;sie und Geoinformationstechnik (IGG) an der TU Berlin unter der Leitung von Thomas H. KOLBE entwickelt [2]. Das Projekt hatte zum Ziel, eine Datenbank zur Speicherung und Verarbeitung semantischer 3D-Stadtmodellen gem&#228;&#223; des CityGML-Standards sowie eine Software-Schnittstelle f&#252;r die Arbeit mit solchen Daten zu schaffen. Die Software ist frei verf&#252;gbar unter 3dcitydb.net [3] und quelloffen nach LGPL v3.


Was ist CityGML?

CityGML ist ein Anwendungsschema der Geography Markup Language (GML). Es stellt ein offenes Austauschformat f&#252;r 3D-Stadtmodelle dar und wird seit 2002 von der Special Interest Group 3D (SIG 3D), einem Gremium aus Vertretern der Wirtschaft, Wissenschaft und &#214;ffentlichen Verwaltung (sig3d.de), konzipiert und entwickelt. Seit 2008 ist CityGML ein offizieller OGC-Standard [4]. Es deckt mit seinem modular aufgebauten Datenmodell verschiedenste thematische Bereiche der urbanen und l&#228;ndlichen Topographie ab (neben Geb&#228;uden u.a. auch Verkehr, Vegetation, Landnutzung, Gew&#228;sser), l&#228;sst sich dar&#252;ber hinaus aber noch &#252;ber eine generische Schnittstelle (Application Domain Extension &#8211; ADE) erweitern. 

Eine entscheidende St&#228;rke von CityGML gegen&#252;ber anderen 3D-Formaten ist die semantische Tiefe, welche den Modellen verliehen werden kann. Bestehen Stadtobjekte bei g&#228;ngigen Visualisierungsformaten meist aus einer nicht n&#228;her definierten Ansammlung von Geometrien und Texturen, k&#246;nnen bei CityGML nicht nur die Objekte selbst sondern auch einzelne Komponenten der Objekte thematisch klassifiziert und mit Sachinformationen attributiert werden, wie z.B. W&#228;nde, D&#228;cher oder Fenster eines Geb&#228;udes etc. [5]. Dieser hierarchische Ansatz kann sich je nach Zweck und Anforderung an Genauigkeit auf bis zu f&#252;nf unterschiedliche Ma&#223;stabsebenen, so genannte &#8222;Levels of Detail&#8220; (LOD), ausdehnen. Die Breite an semantischer Qualifizierung erm&#246;glicht die Integration von 3D-Geodaten aus heterogenen Quellen in einem Stadtmodell und macht es somit f&#252;r verschiedenste Anwendungen nutzbar. Die Beispiele reichen von der einfachen Visualisierung &#252;ber komplexe r&#228;umliche Analysen bis hin zu Simulationsanwendungen in unterschiedlichsten Fachdom&#228;nen wie beispielsweise Stadt- und Umweltplanung [6], Energiewirtschaft [7, 8], Katastrophenmanagement [9] oder Facility Management [10].

[Abb.1]
Abb. 1: CityGML Geb&#228;udepr&#228;sentation in verschiedenen Level of Detail (LOD). Die Beispiele entstammen 
 dem Berliner 3D Stadtmodell. [12]

Aufgrund seiner breiten Akzeptanz in der Fachwelt, dient CityGML auch als Grundlage f&#252;r weitere Datenmodelle im Bereich der dreidimensionalen Geb&#228;udemodellierung, z.B. INSPIRE Building 3D [11], AdV-CityGML-Profil (ALKIS 3D) [12], IMGeo (Niederl&#228;ndische GDI) [13].


Features 3DCityDB

- Verf&#252;gbar f&#252;r Oracle Spatial ab Version 10g R2 und f&#252;r PostgreSQL 8,4+ mit PostGIS 2.0+
- Geometrisch-semantische Modellierung in f&#252;nf LOD-Stufen
- Speicherung von zus&#228;tzlichen Oberfl&#228;chen-eigenschaften wie Texturen, Materialien, aber auch nicht sichtbare Ph&#228;nomene wie W&#228;rme-abstrahlung, L&#228;rmemission, -etc.
- Speicherung von digitalen Gel&#228;ndemodellen (DGM) als Raster, TIN, 3D-Punktwolke oder 3D-Bruchkanten
- Speicherung von Luftbildern
- Prototypische Repr&#228;sentation von Objekten, die in gleicher Form an vielen Stellen im Stadtmodell existieren (B&#228;ume, Stadtm&#246;bel, Stra&#223;enlaternen Schilder etc.)
- Referenzierung von externen Datenquellen
- Geometrische Erfassung von 3D-Objekten anhand ihrer Begrenzungsfl&#228;chen um die verschiedenen Auspr&#228;gungen in Solids, Surfaces oder ihrer Aggregation in einer Tabelle organisieren zu k&#246;nnen
- Rekursive Gruppierungsm&#246;glichkeit von Objekten
- Historien-Management der Datenbank, u.a. auch f&#252;r das Erstellung von Planungsszenarios (dieses Feature existiert nur f&#252;r die Oracle-Version)


Features Importer/Exporter

- Unterst&#252;tzt derzeit CityGML 0.4.0 und 1.0.0
- Exportiert auch in das KML/COLLADA Format
- XML Validierung von CityGML Dokumenten
- Anlegen von benutzer-definierten Koordinaten- systemen in 2D und 3D
- Affine Transformation beim CityGML Import
- Koordinatentransformation beim CityGML Export
- Kartenfenster zum Bestimmen eines Auswahl-rechtecks (Bounding Box)
- Inkrementell erweiterbar durch Plugins
  - Matching / Merging von Geb&#228;uden
  - Spreadsheet Im- und Export
- Technische Details:
  - Programmiert in Java
  - Verwendete Frameworks: citygml4j,  JDBC , JAXB, SAX, Swing
  - Modulare Softwarearchitektur
  - Liest und schreibt CityGML-Dateien unabh&#228;ngig von Gr&#246;&#223;e und Komplexit&#228;t
  - Nebenl&#228;ufige Programmierung f&#252;r hoch-performantes Prozessieren der Daten
  - Vor- und R&#252;ckw&#228;rtsaufl&#246;sung von Xlinks
  - Unterst&#252;tzte Betriebssysteme sind Windows, MAC OS, Linux/UNIX und seine Derivate
  - Quellcode verf&#252;gbar unter: http://opportunity.bv.tu-berlin.de/software 


Aufbau der 3DCityDB

Das relationale Schema der 3DCityDB ist aus dem Datenmodell von CityGML abgeleitet. F&#252;r das Mapping wurde der Anspruch verfolgt, das objektorientierte Modell von CityGML zugunsten einer optimalen Datenbank-Performance zu vereinfachen, die Inhalte aber weitestgehend verlustfrei abzubilden [2, 14].

Das geometrische Modell von CityGML wurde im Datenbankschema insbesondere im Hinblick auf die Speicherung von fl&#228;chenhaften Geometrien optimiert. Komplexe Geometrien wie Solids, TINs und sonstige Aggregationen von Polygonen werden in ihre einzelnen Fl&#228;chenprimitive zerlegt, die &#252;ber zus&#228;tzliche Tabellenspalten mit ihren Eltern- und Wurzelelementen verkn&#252;pft werden k&#246;nnen (siehe Abb.2).

[Abb.2]
Abb. 2: Verwaltung komplexer GML-Geometrien in der Datenbank [2]

Auf diese Weise k&#246;nnen den Einzelfl&#228;chen beliebig viele Oberfl&#228;cheneigenschaften wie Texturen oder Materialinformationen zugewiesen werden. Durch die Referenzierung des Wurzelelements von jeder Fl&#228;chengeometrie k&#246;nnen komplexe Geometrieobjekte mit einem einzigen SELECT Statement abgefragt werden.

Neben den Tabellen umfasst die 3DCityDB auch in der Datenbank gespeicherte Prozeduren, die haupts&#228;chlich f&#252;r Funktionalit&#228;ten des Importer/Exporter verwendet werden. Diese sind in Oracle (PL/SQL) in Packages und in PostgreSQL (PL/pgSQL) in einem separaten Schema organisiert. F&#252;r die Oracle Version besteht dar&#252;ber hinaus die M&#246;glichkeit auf Basis des Oracle Workspace Managers Planungsszenarien in der 3DCityDB anzulegen, um verschiedene Versionen und Planungsalternativen der Stadtmodelldaten zu verwalten. Leider bietet PostgreSQL bis dato kein vergleichbares Werkzeug an, so dass die PostgreSQL/PostGIS Version der 3DCityDB derzeit ohne dieses Feature auskommen muss.


Datenaustausch mit der 3DCityDB

Auch wenn das relationale Datenbankschema aus dem Datenmodell von CityGML abgeleitet wurde, ist die 3DCityDB nicht nur auf den Datenaustausch von CityGML-Daten beschr&#228;nkt. Mit Hilfe von Konvertern, wie z.B. FME von Safe Software, k&#246;nnen auch andere semantisch weniger umfangreiche 3D-Formate (3D Shape, 3ds, dxf, osm3D) in die Datenbank importiert bzw. aus ihr exportiert werden [15]. Die 3DCityDB kann deshalb als zentrale Datenhaltungsschnittstelle eingesetzt werden, die einerseits Stadtmodelldaten aus verschiedenen Quellen in sich vereint und andererseits zweckorientierte Ausgaben f&#252;r Desktop- oder Webanwendungen liefert.


3DCityDB in Action

Neben der Verwendung in zahlreichen Forschungsprojekten, u.a. dem Energie Atlas Berlin (siehe Abb.3) [7, 10], wird die 3DCityDB auch im kommerziellen Umfeld von den Firmen virtualcitySYSTEMS und M.O.S.S. Computer Grafik Systeme eingesetzt, u.a. in Stadtverwaltungen (z.B. in Berlin, Potsdam, M&#252;nchen, N&#252;rnberg, Z&#252;rich, Dresden) und Landesvermessungs&#228;mtern (wie z.B. in Baden-W&#252;rttemberg, Bayern, Hessen, Rheinland-Pfalz, Sachsen, Th&#252;ringen).

[Abb.3]
Abb. 3: Zusammenf&#252;hrung energierelevanter Informationen im Energieatlas Berlin [10]

Die Freie und Hansestadt Hamburg wird innerhalb der ersten Jahresh&#228;lfte 2013 als erste Stadt ihr 3D-Stadtmodell mit der seit Juli 2012 erh&#228;ltlichen PostgreSQL/PostGIS-Version der 3DCityDB [16] im Pilotbetrieb verwalten. Angesichts der Bestimmungen der Arbeitsgemeinschaft der Vermessungsverwaltungen der L&#228;nder (AdV), gem&#228;&#223; denen in den kommenden Jahren fl&#228;chendeckend f&#252;r Deutschland LOD1- und LOD2-Modelle von den zust&#228;ndigen Kataster&#228;mtern zu f&#252;hren sind [17], kann davon ausgegangen werden, dass die Nutzung einer g&#228;nzlichen kostenfreien Datenbankl&#246;sung f&#252;r weitere Kommunen in Betracht kommen wird.


Zuk&#252;nftige Entwicklungen

Geplant ist, dass die 3DCityDB in der zweiten Jahresh&#228;lfte 2013 einen neuen Major-Release erfahren wird. Es folgt die Anpassung auf CityGML 2.0.0, das im April 2012 vom OGC verabschiedet wurde, sowie weitere Optimierungen des Datenbankschemas. F&#252;r das Importer/Exporter Tool ist vorgesehen die derzeit parallel entwickelten Versionen f&#252;r Oracle und PostgreSQL/PostGIS in einer Software zusammenzuf&#252;hren. Langfristig ist au&#223;erdem eine generische Unterst&#252;tzung beliebiger Application Domain Extensions (ADEs) geplant.

Im Februar dieses Jahres haben Prof. KOLBE (seit dem 1. 10. 2012 an der Technischen Universit&#228;t M&#252;nchen), virtualcitySYSTEMS und M.O.S.S. in einer Kooperationsvereinbarung beschlossen, die Weiterentwicklung der 3DCityDB gemeinsam voranzutreiben. Dadurch wurde ein Forum geschaffen, dem sich einerseits weitere Entwickler und Unternehmen anschlie&#223;en k&#246;nnen, das andererseits aber auch die Nutzer der 3DCityDB vernetzen soll.


Referenzen

[1] 
CASPER, E. (2008): Geodatenmanagement in der Berliner Verwaltung &#8211; Amtliches 3D Stadtmodell f&#252;r Berlin. Projektbericht 2007. Verf&#252;gbar unter: 	http://www.businesslocationcenter.de/imperia/md/content/3d/efre_ii_projektdokumentation.pdf

[2] 
KOLBE, T. H.; K&#214;NIG, G.; NAGEL, C.; STADLER, A. (2009): 3D-Geo-Database for CityGML. Version 2.0.1. Documentation. Berlin. Verf&#252;gbar unter: www.3dcitydb.net

[3] 
http://www.3dcitydb.net/

[4] 
http://www.opengeospatial.org/standards/citygml

[5] 
STADLER, A.; KOLBE, T. H. (2007): Spatio-semantic Coherence in the Integration of 3D City Models. Proceedings of the 5th International Symposium on Spatial Data Quality, June 13-15, Enschede.

[6] 
ROSS, L.; D&#214;LLNER, J.; KLEINSCHMIT, B.; SCHROTH, O. (2009): E-Collaboration between the private and the civil Sector: Support of long-term Utilization and update of Official 3D City models. Geoweb 2009 Conference in Vancouver, Canada.

[7] 
KADEN, R.; KR&#220;GER, A; KOLBE, T. H. (2012): Integratives Entscheidungswerkzeug f&#252;r die ganzheitliche Planung in St&#228;dten auf der Basis von semantischen 3D-Stadtmodellen am Beispiel des Energieatlasses Berlin. In: SEYFERT, E. (Hrsg.) Publikationen der Deutschen Gesellschaft f&#252;r Photogrammetrie, Fernerkundung und Geoinformation, Band 21, 32. Wissenschaftlich-Technische Jahrestagung der DGPF am 14.-17. M&#228;rz in Potsdam.

[8] 
CARRI&#211;N, D.; LORENZ, A.; KOLBE, T. H. (2010): Estimation of the energetic rehabilitation state of buildings for the city of Berlin using a 3D City Model represented in CityGML. In: Proc. of the 5th International Conference on 3D Geo-Information 2010 in Berlin. The International Archives of the Photogrammetry, Remote Sensing and Spatial Information Sciences, XXXVIII-4/W15, S. 31-36.

[9] 
BECKER, T.; NAGEL, C.; KOLBE, T. H. (2011): Integrated 3D Modeling of Multi-utility Networks and their Interdependencies for Critical Infrastructure Analysis. In: KOLBE, T. H.; K&#214;NIG, G; NAGEL, C. (Hrsg.): Advances in 3D Geo-Information Sciences. Lecture Notes in Geoinformation and Cartography. Springer Verlag.

[10]
KOLBE, T. H. (2012): Urban Information Fusion using Semantic 3D City Models focusing on City Lifecycle Management and Strategic Energy Planning. Vortrag am 15. 11. 2012. Smart City World Expo Congress in Barcelona. Verf&#252;gbar unter: http://www.citygml.org/typo3-igg/fileadmin/citygml/docs/Kolbe-Urban_Information_Fusion_with_3D_City_Models.pdf 

[11] 
INSPIRE THEMATIC WORKING GROUP BUILDING (TWG BU) (2011): INSPIRE Data Specification on Building &#8211; Draft Guidelines. Version D2.8.III.2.

[12] 
GRUBER, U. (2012): Die dritte Dimension im amtlichen Vermessungswesen Deutschlands. Vortrag am 29.03.2012. Geoinformatik 2012. Verf&#252;gbar unter:
http://www.kreis-re.de/dok/Katasteramt/File/Geoinformatik2012_Gruber.pdf

[13] 
VAN DEN BRINK, L.; STOTER, J.; ZLATANOVA, S. (2013): Establishing a national standard for 3D topographic data compliant to CityGML. In: International Journal of Geographical Information Science 27, No. 1.

[14] 
STADLER, A.; NAGEL, C.; K&#214;NIG, G.; KOLBE, T. H. (2009): Making interoperability persistent: A 3D geo database based on CityGML. In: LEE, ZLATANOVA (Hrsg.): Proceedings of the 3rd International Workshop on 3D Geo-Information, Seoul, Korea. Lecture Notes in Geoinformation and Cartography. Springer Verlag.

[15] 
http://www.business-geomatics.com/online/unternehmen-a-maerkte/47-unternehmen-a-maerkte/1119-3d-auf-knopfdruck.html

[16] 
KUNDE, F (2012): CityGML in PostGIS: Portierung, Anwendung und Performanz-Analyse am Beispiel der 3D City Database von Berlin. Masterarbeit. Verf&#252;gbar unter: urn:nbn:de:kobv:517-opus-63656

[17] 
GEOINFODOK (2009): Dokumentation zur Modellierung der Geoinformationen des amtlichen Vermessungswesens. Hauptdokument Version 6.0.1. Arbeitsgemeinschaft der Vermessungsverwaltungen der L&#228;nder der Bundesrepublik Deutschland.</description>
        <persons>
          <person id="306">Felix Kunde</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="623">
        <start>11:00</start>
        <duration>00:30</duration>
        <room>3.008</room>
        <slug></slug>
        <title>Der OpenStreetMap-Geocoder Nominatim</title>
        <subtitle></subtitle>
        <track>Vortr&#228;ge (OSM)</track>
        <type>lecture</type>
        <language></language>
        <abstract>Nominatim ist die Software, die sich hinter der Suchbox der OpenStreetMap-Hauptseite
verbirgt. Sie bietet eine Freitext-Suche genauso wie Reverse-Geocoding, deckt OSM-Daten
weltweit ab und kann min&#252;tlich auf dem Stand der letzten &#196;nderungen in OSM gehalten
werden.

Dieser Vortrag gibt einen kurzen Einblick ins Innere von Nominatim. Es
wird erkl&#228;rt, wie die OSM-Daten vorverarbeiten werden, wie ein Ort seine Adresse
erh&#228;lt und wie schlussendlich die Suche selber funktioniert. Der Schwerpunkt liegt
dabei weniger auf technischen Details sondern der Vortrag wird mehr die grundlegenden
Prinzipien erkl&#228;ren, die der Suche zugrunde liegen. Damit soll dem interessierten
Mapper geholfen werden, besser zu verstehen, wie die sorgf&#228;ltig in OSM erfassten
Daten verarbeitet werden, damit sie von anderen gefunden werden k&#246;nnen.</abstract>
        <description></description>
        <persons>
          <person id="195">Sarah Hoffmann</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="495">
        <start>11:30</start>
        <duration>00:30</duration>
        <room>3.008</room>
        <slug></slug>
        <title>3D-Landschaftsmodelle aus OSM und SRTM</title>
        <subtitle>Wie OSM2World die OpenStreetMap-Daten um die dritte Dimension erg&#228;nzt</subtitle>
        <track>Vortr&#228;ge (OSM)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Speziell im deutschsprachigen Raum enth&#228;lt OpenStreetMap zunehmend hochdetaillierte Informationen, dank derer sich eine dreidimensionale Szene etwa mit Geb&#228;udemodellen, spurgenauen Stra&#223;endarstellungen und Stra&#223;enm&#246;blierung ausstatten l&#228;sst. Auch relative H&#246;heninformationen wie Steigungen, Stockwerke oder die vertikale Anordnung von Br&#252;cken und Tunneln werden bereits vielerorts eingetragen.

Die Erfassung absoluter H&#246;heninformationen ist jedoch un&#252;blich und bleibt in der Praxis vereinzelten Landschaftspunkten wie Gipfeln vorbehalten. Weder die Bedienkonzepte der OSM-Editoren, noch die &#252;blichen Datenquellen (Luftbilder und GPS-Daten) eignen sich gut f&#252;r diese Aufgabe. Daher muss hier ein anderer Ansatz gew&#228;hlt werden: Der R&#252;ckgriff auf externe Quellen wie die SRTM-Satellitendaten der NASA.

Der Vortrag stellt einen Ansatz zur Verschmelzung von OSM- und SRTM-Daten vor und beschreibt dessen Umsetzung in OSM2World, einem Open-Source-Werkzeug zur Erzeugung von 3D-Landschaftmodellen: Mithilfe von passend gew&#228;hlten Interpolationsverfahren wird zun&#228;chst aus den SRTM-Messpunkten und gegebenenfalls zus&#228;tzlichen Landschaftsmerkmalen eine Gel&#228;ndeoberfl&#228;che berechnet. F&#252;r diesen Schritt wurde u.a. mit Least-Squares- und Natural-Neighbor-Algorithmen experimentiert. Anschlie&#223;end werden Modelle mittels eines Optimierungsverfahrens so in das Terrain eingepasst, dass implizit und explizit vorhandene Informationen etwa zur Steigung in L&#228;ngs- und Querrichtung oder zum lichtem Raum &#252;ber Verkehrswegen ber&#252;cksichtigt werden.</abstract>
        <description></description>
        <persons>
          <person id="144">Tobias Knerr</person>
        </persons>
        <links>
          <link href="http://osm2world.org/">http://osm2world.org/</link>
          <link href="http://tobias-knerr.de/publications/">http://tobias-knerr.de/publications/</link>
        </links>
      </event>
      <event id="619">
        <start>12:30</start>
        <duration>01:00</duration>
        <room>3.008</room>
        <slug></slug>
        <title>Abschlussveranstaltung</title>
        <subtitle></subtitle>
        <track>Allgemeines</track>
        <type></type>
        <language></language>
        <abstract>* C&#233;dric Moullet: Zeitreise mit geo.admin.ch http://geo.admin.ch/ (Keynote)
* Stefan Keller: Das Leben ist doch ein Spiel!
* FOSSGIS e.V. (Marco Lechner): FOSSGIS - Der Verein
* FOSSGIS e.V. (Marco Lechner): Verlosung</abstract>
        <description></description>
        <persons>
          <person id="324">C&#233;dric Moullet</person>
          <person id="135">Marco Lechner</person>
          <person id="265">Stefan Keller</person>
        </persons>
        <links>
        </links>
      </event>
    </room>
    <room name="3.010">
      <event id="529">
        <start>09:00</start>
        <duration>00:30</duration>
        <room>3.010</room>
        <slug></slug>
        <title>Performanceoptimierte WMS-Dienste mit QGIS Server</title>
        <subtitle></subtitle>
        <track>Vortr&#228;ge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract>Eine hohe Leistungsf&#228;higkeit ist f&#252;r WMS-Dienste absolut zentral. Dieser Beitrag zeigt anhand praxisnaher Fallbeispiele auf, was als Serveradministrator und als Entwickler gemacht werden kann, um eine hohe (QGIS) Serverleistung zu erreichen. Es werden Techniken zur Performancemessung gezeigt und die Resultate werden mit anderen WMS-Servern verglichen. Der Beitrag geht technisch sehr ins Detail und ist daher sowohl f&#252;r Entwickler wie auch Betreiber von WMS-Diensten interessant</abstract>
        <description></description>
        <persons>
          <person id="319">Marco Hugentobler</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="542">
        <start>09:30</start>
        <duration>00:30</duration>
        <room>3.010</room>
        <slug></slug>
        <title>GeoServer</title>
        <subtitle>the open source server for interoperable spatial data handling</subtitle>
        <track>Vortr&#228;ge (GIS)</track>
        <type>lecture</type>
        <language>en</language>
        <abstract>GeoServer is an open source geo-spatial server written in Java, following the common Java 2 Enterprise practices, allowing for the handling, distribution and analysis of geospatial data.</abstract>
        <description>GeoServer allows to distribute, handle and analyses data using the most widely accepted OGC standards (WMS, WFS, WCS and WPS), without forgetting specific extensions for a transparent interacting with clients such as Google Earth and commercial software in general, and providing support for the now common protocols based on REST and GeoJSON for the distribution of simple vector based data.
 
The presentation will give the audience an exhaustive overview of GeoServer 2.2 functionalities for the creation of interoperable Spatial Data Infrastructures, with particular focus on the new functionalities introduced with the upcoming GeoServer 2.3 release as well as on the WPS 1.0 spatial data analysis capabilities.

 
Closing the presentation we&#8217;ll see some recently added features and improvements, such as the ability to transform data on the fly while rendering, WFS 2.0 and WFS paging, optimizing PNG outputs, better WMS cascading and virtual services.
</description>
        <persons>
          <person id="332">Simone Giannecchini</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="553">
        <start>10:00</start>
        <duration>00:30</duration>
        <room>3.010</room>
        <slug></slug>
        <title>CouchWFS</title>
        <subtitle>Ein WFS umgesetzt mit CouchDB Bordmitteln</subtitle>
        <track>Vortr&#228;ge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract>CouchDB wird prim&#228;r als indizierter JSON-Storage wahrgenommen. Vielen, besonders f&#252;r die Web-Entwicklung vorteilhaften Funktionen und deren m&#246;glichen Anwendung wird dabei weniger Beachtung geschenkt.
Mithilfe der GeoCouch-Erweiterung wurde CouchDB bereits um r&#228;umliche Abfragen erweitert, der Zugriff auf die Geodaten erfolgt jedoch &#252;ber eine dem Produkt eigene Schnittstelle.
WFS ist ein vom OGC definierter Standard zur &#220;bertragung von Vektordaten &#252;ber das HTTP, mit welchem viele GIS von Haus aus umgehen k&#246;nnen.
Unter Ausnutzung von "list" Funktionen ist es m&#246;glich, ohne weitere Software einen WFS Server in einer CouchDB zu implementieren und so ein standardisiertes Interface einer jeden GeoCouch Datenbank zu einer Vielzahl an GIS zu schaffen.
Der so erstellte WFS ist dabei ausschlie&#223;lich in einem "design" Dokument gespeichert und kann bei Bedarf einfach in die gew&#252;nschte Datenbank kopiert werden, um diese mit WFS-F&#228;higkeiten auszustatten.

In dem Vortrag wird die Implementierung des WFS beschrieben und demonstriert, aber auch die Grenzen des mit dieser Methode Machbaren aufgezeigt.</abstract>
        <description></description>
        <persons>
          <person id="338">Markus Mayr</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="564">
        <start>11:00</start>
        <duration>00:30</duration>
        <room>3.010</room>
        <slug></slug>
        <title>M&#246;glichkeiten und Risiken der unternehmerischen Nutzung von Crowdsourcingprojekten am Beispiel von Open Street Map</title>
        <subtitle></subtitle>
        <track>Vortr&#228;ge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Mit Social Communitys und Crowdsourcing haben wir ein Ph&#228;nomen unserer Zeit vor uns, bei dem viele Menschen durch kleine Beitr&#228;ge gemeinsam etwas generieren, dass au&#223;erhalb der M&#246;glichkeiten des Einzelnen liegt. Dabei stellt sich f&#252;r Unternehmen die Frage, ob es m&#246;glich ist, das schier endlos erscheinende Potential von kostenlosen Arbeitsstunden, die sich in Communitys versammeln, f&#252;r die eigenen Unternehmensziele nutzbar zu machen. Gerade im Bereich von Geoinformationen kann es verlockend erscheinen, die Datenerfassung und Qualit&#228;tssicherung zumindest teilweise durch Crowdsourcing erledigen zu lassen. Bevor ein Unternehmen beschlie&#223;t, die M&#246;glichkeit zu nutzen, sollte es sorgf&#228;ltig die Vor- und Nachteile analysieren.  Der Beitrag widmet sich dieser Frage am Beispiel des Open Street Map Projekts. 

Zun&#228;chst wird allgemein auf die Besonderheiten von Crowdsourcing eingegangen. Hieraus ergibt sich bereits ein erstes Ger&#252;st f&#252;r eine Nutzung. Daran schlie&#223;t sich die Auseinandersetzung mit der Open Street Map Community und ihrem Selbstverst&#228;ndnis an. Daraus ergeben sich bereits feste Grenzen f&#252;r eine unternehmerische Nutzung. Schlie&#223;lich muss eine genauere Analyse der Unternehmensziele erfolgen. Je nach Kongruenz zu den Communityzielen ergeben sich unterschiedliche Handlungsm&#246;glichkeiten f&#252;r das Unternehmen.  Kommt nach dem bisher Gesagten eine Kooperation in Betracht, so muss sich das Unternehmen auch mit den sonstigen wirtschaftlichen Kosten auseinandersetzen. Je enger eine Kooperation ist, um so eher wird von der Community auch erwartet, dass vom Unternehmen etwas zur&#252;ck flie&#223;t. Dar&#252;ber hinaus kann es notwendig sein, Personal f&#252;r die Pflege der Community vorzuhalten. Wann und warum solche Kosten entstehen, wird im Vortrag n&#228;her erl&#228;utert.

Im Ergebnis ist festzuhalten, dass die Zusammenarbeit mit Crowdsourcing-Projekten nicht absolut planbar ist. Chancen und Risiken m&#252;ssen im Einzelfall gegeneinander abgewogen werden.</abstract>
        <description></description>
        <persons>
          <person id="147">Falk Zscheile</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="552">
        <start>11:30</start>
        <duration>00:30</duration>
        <room>3.010</room>
        <slug></slug>
        <title>&#8222;Open&#8220; im postgradualen Fernlehre-Kontext</title>
        <subtitle>Das Beispiel UNIGIS</subtitle>
        <track>Vortr&#228;ge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>UNIGIS verfolgt unter anderem das Ziel, die Pr&#228;senz freier und offener Software und Daten in den postgradualen Studienangeboten weiter zu erh&#246;hen. Dieser Beitrag versucht das Verh&#228;ltnis zwischen den Anforderungen seitens UNIGIS und rezenten Entwicklungen innerhalb der FOSSGIS-Community darzustellen. Anhand aktueller Beispiele soll gezeigt werden, wie die universit&#228;re Aus- und Weiterbildung von Impulsen aus der FOSSGIS-Community profitiert und umgekehrt, eine entsprechende Pr&#228;senz in einem postgradualen Studium f&#252;r die FOSSGIS-Community in vielerlei Hinsicht eine lohnende &#8222;Investition&#8220; sein kann.
Nach dem ersten &#8222;Statusbericht&#8220; bei der letztj&#228;hrigen FOSSGIS-Konferenz in Dessau, kann dieses Mal von einem weiteren Bedeutungszuwachs von freier und offener Software im Rahmen des UNIGIS-Fernstudiums berichtet werden: propriet&#228;re &#220;bungssoftware wurde durch Open Source Alternativen ersetzt, das Thema &#8222;Open&#8220; war bei diversen Pr&#228;senzveranstaltungen prominent vertreten und der Anteil der Abschlussarbeiten, die mit Open Source L&#246;sungen erstellt wurden, liegt im deutschsprachigen UNIGIS MSc Studium bei mittlerweile fast f&#252;nfzig Prozent.
Um diese Dynamik weiterhin zu erhalten, gilt es, sowohl seitens UNIGIS als auch von Seiten der FOSSGIS-Community die richtigen Impulse zu setzen. Ein diesbez&#252;glicher Ausblick soll diesen Beitrag abrunden.</abstract>
        <description></description>
        <persons>
          <person id="302">Martin Loidl</person>
        </persons>
        <links>
          <link href="http://www.unigis.at">http://www.unigis.at</link>
          <link href="http://www.unigis.net">http://www.unigis.net</link>
          <link href="http://www.zgis.at">http://www.zgis.at</link>
        </links>
      </event>
    </room>
    <room name="1.269 (WS)">
    </room>
    <room name="1.271 (WS)">
    </room>
    <room name="1.208 (WS)">
      <event id="617">
        <start>09:00</start>
        <duration>01:30</duration>
        <room>1.208 (WS)</room>
        <slug></slug>
        <title>PostgreSQL Wartung und Administration</title>
        <subtitle></subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language>de</language>
        <abstract>PostGIS ist sehr beliebt zur Verwaltung von Kartendaten. PostGIS ist ein Aufsatz f&#252;r das Datenbanksystem PostgreSQL. PostgreSQL ist ein klassisches Datenbanksystem, dass einwenig administrative Wartung und Pflege bedarf. Der Vortrag zeigt ein paar administrative Tricks und Kniffe wie das System gut gepflegt und gewartet werden kann.  
</abstract>
        <description>PostGIS ist sehr beliebt zur Verwaltung von Kartendaten. PostGIS ist ein Aufsatz f&#252;r das Datenbanksystem PostgreSQL. PostgreSQL ist ein klassisches Datenbanksystem, dass einwenig administrative Wartung und Pflege bedarf. Der Vortrag zeigt ein paar administrative Tricks und Kniffe wie das System gut gepflegt und gewartet werden kann.  </description>
        <persons>
          <person id="307">Susanne Ebrecht</person>
        </persons>
        <links>
        </links>
      </event>
    </room>
    <room name="1.208a (WS)">
      <event id="614">
        <start>09:00</start>
        <duration>01:30</duration>
        <room>1.208a (WS)</room>
        <slug></slug>
        <title>Einf&#252;hrung in UMN MapServer</title>
        <subtitle></subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language>de</language>
        <abstract>Wir m&#246;chten damit denjenigen, die die Konferenz zum Kennenlernen des 
Mapservers nutzen wollen, die M&#246;glichkeit geben, sich pers&#246;nlich mit der 
Funktionsweise vertraut zu machen ohne einen Teil des Vortragsprogramms 
zu verpassen. Der Workshop soll einen Einblick in die Funktionalit&#228;t des 
Mapservers geben. Folgende Fragen sollen gekl&#228;rt werden:

* Welche Rolle spielt ein Kartenserver in meiner WebGIS Anwendung?
* Wie kann ich meine Daten mit dem UMN Mapserver visualisieren?
* Wie kann ich OGC konforme Dienste (WMS und WFS) mit dem UMN Mapserver 
aufsetzen und was bedeutet das eigentlich?
* Welche Formate unterst&#252;tzt der UMN Mapserver?
* Welche Klassifikations- und Stylem&#246;glichkeiten bietet der UMN Mapserver?
* Welche OpenSource-Clients kann ich f&#252;r die Datenvisualisierung mittels 
Mapserver nutzen?</abstract>
        <description>* Einf&#252;hrung
** Geschichte
** Funktionalit&#228;t
** DesktopGIS vs. WebGIS
* Aufbau der Mapdatei
** Header
** Web
** Layer
** Class
* Welche Datenformate werden unterst&#252;tzt
** Raster
** Vektor
** Datenbank
* OGC-Dienste
** OGC WMS mit Mapserver
** OGC WFS mit Mapserver</description>
        <persons>
          <person id="123">J&#246;rg Thomsen</person>
          <person id="119">Toni Pignataro</person>
        </persons>
        <links>
        </links>
      </event>
    </room>
    <room name="1.212 (WS)">
      <event id="612">
        <start>09:00</start>
        <duration>01:30</duration>
        <room>1.212 (WS)</room>
        <slug></slug>
        <title>Einf&#252;hrung in GeoServer</title>
        <subtitle></subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language></language>
        <abstract>In diesem Workshop lernen TeilnehmerInnen, wie man mit GeoServer Geodaten laden, publizieren, symbolisieren und weitergeben kann. Konkrete Inhalte sind die Navigation in der GeoServer Benutzerschnittstelle, die Anbindung an unterschiedliche Datenquellen, Information &#252;ber OGC Webdienste und SLD, sowie die Nutzung publizierter Inhalte in Software von Drittanbietern, wie z.B. Google Earth. </abstract>
        <description></description>
        <persons>
          <person id="173">Andreas Hocevar</person>
        </persons>
        <links>
        </links>
      </event>
    </room>
  </day>
</schedule>
