<?xml version="1.0" encoding="UTF-8"?>
<schedule>
  <conference>
    <title>FOSSGIS 2012</title>
    <subtitle>Konferenz f&#252;r freie und Open Source-Software im GIS-Bereich und f&#252;r freie Geodaten</subtitle>
    <venue>Hochschule Anhalt</venue>
    <city>Dessau</city>
    <start>2012-03-19</start>
    <end>2012-03-22</end>
    <days>4</days>
    <release>#&lt;Conference_release::Row:0x2b5ee492b0d0&gt;</release>
    <day_change>07:00</day_change>
    <timeslot_duration>00:15</timeslot_duration>
  </conference>
  <day date="2012-03-19" index="1">
    <room name="H&#246;rsaal des Umweltbundesamtes (UBA)">
      <event id="484">
        <start>13:00</start>
        <duration>00:15</duration>
        <room>H&#246;rsaal des Umweltbundesamtes (UBA)</room>
        <slug></slug>
        <title>Lightning Talk Geo</title>
        <subtitle>Trends in der Geoinformatik</subtitle>
        <track>Lightning Talks (GIS)</track>
        <type>lightning</type>
        <language>de</language>
        <abstract>Ein R&#252;ckblick auf vergangene Hard- und Software, ein Gedanke zu Eigentum und wie Computer und der Sinn des Lebens zusammenpassen.</abstract>
        <description></description>
        <persons>
          <person id="51">Arnulf Christl</person>
        </persons>
        <links>
          <link href="http://arnulf.us">Arnulfs private Webseite</link>
          <link href="http://arnulf.us/publications/fossgis-2012_lightning-talk_arnulf-christl.pdf">Download der Folien</link>
        </links>
      </event>
    </room>
    <room name="H&#246;rsaal 08">
    </room>
    <room name="H&#246;rsaal 04/114">
    </room>
    <room name="H&#246;rsaal 04/113">
    </room>
    <room name="WSRaum1">
    </room>
    <room name="WSRaum2">
    </room>
    <room name="WSRaum3">
    </room>
    <room name="Vor Ort Aushang">
      <event id="476">
        <start>18:00</start>
        <duration>02:00</duration>
        <room>Vor Ort Aushang</room>
        <slug></slug>
        <title>Inoffizieller Start im Brauhaus Dessau</title>
        <subtitle></subtitle>
        <track>Community Sessions</track>
        <type></type>
        <language></language>
        <abstract>Am Montag Abend findet die inoffizielle Konferenzer&#246;ffnung mit den Organisatoren und dem Lokalteam im Brauhaus Dessau statt.</abstract>
        <description></description>
        <persons>
        </persons>
        <links>
          <link href="http://www.fossgis.de/konferenz/2012/socialevents/">&#220;bersicht Social Events</link>
        </links>
      </event>
    </room>
  </day>
  <day date="2012-03-20" index="2">
    <room name="H&#246;rsaal des Umweltbundesamtes (UBA)">
      <event id="471">
        <start>13:15</start>
        <duration>00:30</duration>
        <room>H&#246;rsaal des Umweltbundesamtes (UBA)</room>
        <slug></slug>
        <title>Er&#246;ffnung</title>
        <subtitle></subtitle>
        <track>Allgemeines</track>
        <type>podium</type>
        <language></language>
        <abstract>Er&#246;ffnung der FOSSGIS 2012 durch Dr. Marco Lechner den ersten Vorsitzenden des FOSSGIS e.V.

* Herr Prof. Dr. Klaus Kummer, Leiter der Abteilung &#8222;Geoinformation 
und Landesentwicklung&#8220; (Ministerium f&#252;r Landesentwicklung und Verkehr 
des Landes Sachsen-Anhalt)
* Herr Dr. Michael Angrick, Leiter des Fachbereichs "Nachhaltige 
Produktion und Produkte, Kreislaufwirtschaft" (Umweltbundesamt)
* Herr Oberb&#252;rgermeister Klemens Koschig (Stadt Dessau-Ro&#223;lau)
* Herr Prof. Dr. Dr. h.c. Dieter Orzessek (Pr&#228;sident der Hochschule 
Anhalt)</abstract>
        <description></description>
        <persons>
        </persons>
        <links>
        </links>
      </event>
      <event id="434">
        <start>13:45</start>
        <duration>00:15</duration>
        <room>H&#246;rsaal des Umweltbundesamtes (UBA)</room>
        <slug></slug>
        <title>Public-Private-Partnership und freie Software</title>
        <subtitle>am Beispiel OpenLayers mobile</subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Die popul&#228;re Open Source JavaScript-Bibliothek OpenLayers bietet seit der Version 2.11 auch auf mobilen Endger&#228;ten wie Smartphones (etwa iPhone oder Android-Ger&#228;te) und Tablet-Computern (z.B. iPad) eine hervorragende Grundlage zur Erstellung von webbasierten geographischen Informationssystemen. Der Vortrag zeigt die vielf&#228;ltigen neuen M&#246;glichkeiten auf und erkl&#228;rt deren Verwendung in eigenen Projekten. Vor allem aber wird auf die Entstehungsgeschichte der Version 2.11 eingegangen: Dank einer Public-Private-Partnership, welche einen Codesprint mit Teilnehmern aus aller Welt m&#246;glich machte, bietet OpenLayers nun die Funktionen, die WebGIS auf mobilen Endger&#228;ten erm&#246;glichen.

Der Referent ist Kernentwickler von OpenLayers und war in der gl&#252;cklichen Lage, auch am bereits erw&#228;hnten Entwicklertreffen teilzunehmen. Im Vortrag wird von den technischen und organisatorischen Hintergr&#252;nden der aktuellen OpenLayers Version berichtet und sozusagen aus dem &#8222;OpenLayers-N&#228;hk&#228;stchen&#8220; geplaudert. Dabei wird deutlich, wie die Unterst&#252;tzung von Open Source durch &#246;ffentliche Verwaltungen als Innovationsmotor wirken kann.
</abstract>
        <description></description>
        <persons>
          <person id="173">Andreas Hocevar</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="399">
        <start>14:00</start>
        <duration>00:15</duration>
        <room>H&#246;rsaal des Umweltbundesamtes (UBA)</room>
        <slug></slug>
        <title>OpenStreetMap in Zahlen und Karten</title>
        <subtitle></subtitle>
        <track>Vorträge (OSM)</track>
        <type>podium</type>
        <language></language>
        <abstract>OpenStreetMap ist nun fast acht Jahre alt und hat eine Unmenge an Daten gesammelt beziehungsweise geschaffen. Wir alle kennen die &#252;blichen OpenStreetMap-Karten, die aus diesen Daten erzeugt werden. Aber es steckt noch eine Menge mehr in diesen Daten. Sie erz&#228;hlen uns etwas &#252;ber die Welt. Und sie erz&#228;hlen etwas &#252;ber die Geschichte von OSM und &#252;ber die Mapper und ihre Interessen.

Ohne Anspruch auf Vollst&#228;ndigkeit oder Systematik, gibt der Vortrag in Zahlen, Graphen und Karten eine Einblick in die Welt aus der Perspektive der OpenStreetMap-Datenbank.
</abstract>
        <description></description>
        <persons>
          <person id="2">Jochen Topf</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="470">
        <start>14:15</start>
        <duration>00:30</duration>
        <room>H&#246;rsaal des Umweltbundesamtes (UBA)</room>
        <slug></slug>
        <title>Lightning Talks im Plenum</title>
        <subtitle></subtitle>
        <track>Allgemeines</track>
        <type>podium</type>
        <language></language>
        <abstract>OpenSeaMap - Markus B&#228;rlocher - aktuelle Highlights:
- Garmin-Kartenplotter geknackt (brandneu)
- 1,7 Mio. Wikipedia-Artikel integriert
- Schiffstracking und Flottenmanagement (Satellit und AIS)
- Echtzeit-Darstellung von Sensor-Werte
- Bathymetrie und Flachwassertiefen per Crowdsourcing
- Taucher und Kanuten: hunderttausende neue OSMer</abstract>
        <description></description>
        <persons>
        </persons>
        <links>
        </links>
      </event>
    </room>
    <room name="H&#246;rsaal 08">
      <event id="354">
        <start>15:30</start>
        <duration>00:30</duration>
        <room>H&#246;rsaal 08</room>
        <slug></slug>
        <title>gvSIG Community Edition (CE)</title>
        <subtitle>Entwicklungsgeschichte und aktueller Stand des Projektes</subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract>Titel

gvSIG Community Edition (CE): Entwicklungsgeschichte und aktueller Stand des Projektes
 
Referent

Benjamin Ducke &lt;benducke@fastmail.fm&gt;

Kurzbeschreibung 

Die gvSIG Community Edition ist ein neues Open-Source-GIS-Projekt, das  2011 ins Leben gerufen wurde. Es handelt sich um eine, durchaus kontrovers diskutierte, Abzweigung des &#8222;offiziellen&#8220; gvSIG-Projekts der Conselleria de Infraestructuras y Transporte (CIT) in Valencia. Hauptziel des Projektes ist es, die Zusammenarbeit mit anderen relevanten Projekten wie SEXTANTE, GRASS GIS und SAGA  mit gvSIG sowie die Internationalisierung der Software und Anwendergemeinde voran zu treiben.

Technisch gesehen, basiert gvSIG CE auf gvSIG OADE (2010), den aktuellen Verbesserung aus dem CIT-Codezweig, sowie der aktuellsten Version von SEXTANTE GIS. Besonderes Merkmal von gvSIG CE ist die Einbindung von mehr als 700 Funktionen zur Geodatenprozessierung aus den genannten Partnerprojekten. Die Entwicklung von gvSIG CE geschieht auf Englisch, um die Kommunikation zwischen allen Entwicklern und Anwendern zu vereinfachen. Die Projektstruktur ist bewusst offen und weitestgehend frei von Hierarchien gestaltet.

Der Vortrag erl&#228;utert die technischen, &#246;konomischen und sonstigen Aspekte der Gr&#252;ndung von gvSIG CE. Er w&#228;gt dessen Entwicklungsmodell gegen das der CIT ab und gibt einen Einblick in den momentanen Stand der Entwicklung und die Dynamiken hinter dem Projekt. Eine kurze Live-Einf&#252;hrung der aktuellen Version sowie die Vorstellung der konkreten Web-Organisation des Projektes runden den Vortrag ab.

Weitere Informationen erhalten Sie auf der Internetseite des Projektes: http://www.gvsigce.org

Ansprechpartner

Benjamin Ducke &lt;benducke@fastmail.fm&gt;
Ruth Sch&#246;nbuchner &lt;ruth.schoenbuchner@csgis.de&gt;</abstract>
        <description></description>
        <persons>
        </persons>
        <links>
        </links>
      </event>
      <event id="415">
        <start>16:00</start>
        <duration>00:30</duration>
        <room>H&#246;rsaal 08</room>
        <slug></slug>
        <title>QGIS auf Android</title>
        <subtitle>Ein vollwertiges GIS auf Android-Ger&#228;ten</subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Ubiquit&#228;t von mobilen Ger&#228;ten macht die Verwendung solcher Ger&#228;ten ein Tagesgesch&#228;ft f&#252;r viele Profis heutzutage. Bei der Datenerfassung oder Verwaltung im Feld, ist die Verwendung von sperrigen Hardware sehr unbequem und unproduktiv. Das Zusammenf&#252;hren von erstklassigen Software wie QGIS und letzte Generation Android Tablet-Ger&#228;ten kann die Produktivit&#228;t vieler Berufs-, Firmen- und Privat-benutzer bedeutend verbessern. Diese Pr&#228;sentation wird aktuellen Status und die zuk&#252;nftigen Pl&#228;ne f&#252;r die Android-Port von QGIS veranschaulichen.
Dank seiner Multi-Plattform-Natur (Win, Mac, Linux und Android) und seiner breiten Features-Set (Desktop, Server, Web-Client), ist QGIS eine der am weitesten verbreiteten Open-Source GIS Software und wird bereits von vielen Institutionen als GIS-Software der Wahl ben&#252;tzt.
Die Erg&#228;nzung der QGIS suite mit einer Tablet f&#228;hige (und ein kleiner Bildschirm-Version in naher Zukunft) Version bietet den Anwendern einen vollwertigen im Feld GIS Daten  Verwaltung Infrastruktur.</abstract>
        <description></description>
        <persons>
          <person id="274">Marco Bernasocchi</person>
        </persons>
        <links>
          <link href="http://www.bernawebdesign.ch/byteblog/2011/12/14/qgis-on-android-talk-at-the-universita-degli-studi-di-urbino/">http://www.bernawebdesign.ch/byteblog/2011/12/14/qgis-on-android-talk-at-the-universita-degli-studi-di-urbino/</link>
          <link href="http://android.qgis.org">http://android.qgis.org</link>
          <link href="http://www.opengis.ch">http://www.opengis.ch</link>
        </links>
      </event>
      <event id="427">
        <start>16:30</start>
        <duration>00:30</duration>
        <room>H&#246;rsaal 08</room>
        <slug></slug>
        <title>QGIS und gvSIG - Desktop-GIS L&#246;sungsans&#228;tze</title>
        <subtitle></subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract>Zunehmend r&#252;cken Open Source Desktop-GIS in den Fokus der &#246;ffentlichen Verwaltung und anderer GIS-Anwender. Dies liegt vor allem daran, dass auch im OpenSource Umfeld nun absolute Highend-L&#246;sungen f&#252;r Desktop-GIS verf&#252;gbar sind. Wussten Sie, dass Sie in QGIS Google-Karten anzeigen oder dass Sie in gvSIG einfach 3D-Darstellungen erstellen k&#246;nnen?

Der Vortrag versucht einen Vergleich zwischen den beiden prominentesten Vertretern der Open Source Desktop GIS. Dabei geht es nicht darum, Funktionslisten gegen&#252;berzustellen und abzuarbeiten, sondern neben Funktionsgruppen auch die Philosophie der beiden Systeme zu vergleichen. An einigen Beispielen wird praktisch aufgezeigt, wie klassische GIS-Fragestellungen mit beiden Systemen gel&#246;st werden k&#246;nnen. Dabei wird jeweils eine L&#246;sung derselben Aufgabe in beiden Systemen vorgestellt.</abstract>
        <description></description>
        <persons>
          <person id="23">Till Adams</person>
        </persons>
        <links>
        </links>
      </event>
    </room>
    <room name="H&#246;rsaal 04/114">
      <event id="377">
        <start>15:30</start>
        <duration>00:30</duration>
        <room>H&#246;rsaal 04/114</room>
        <slug></slug>
        <title>Ermittlung und Visualisierung von Einsatzgebieten der Polizei, Feuerwehr oder von Ersthelfern auf Basis von OpenStreetMap </title>
        <subtitle>Am Beispiel der Gemeinde H&#252;nstetten im Taunus</subtitle>
        <track>Vorträge (OSM)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract></abstract>
        <description>Ein typisches Problem im Bereich der Standortanalyse im Bereich der Blaulichtorganisationen (BOS) ist: Welches Gebiet kann von einer Einsatzzentrale der Polizei, der Feuerwehr oder von Ersthelfern in einer vorgegebenen Zeit abgedeckt werden? In den meisten F&#228;llen scheitert die Beantwortung einer solchen Frage entweder an dem Nichtvorhandensein der Daten oder am Fehlen entsprechender Software f&#252;r die Analyse. 

Als Datengrundlage kann in Deutschland inzwischen auf das bereits gute und kostenlose Datenmaterial des OpenStreetMap.org (OSM) Projektes zur&#252;ckgegriffen werden. Im OSM Datenbestand werden neben Stra&#223;endaten auch die Standorte von Feuerwehren, Krankenh&#228;usern oder Polizeistationen gelistet. Fr&#252;her erfolgten einfache Darstellungen &#252;ber einen Kreis auf einer Karte, der das zu erreichende Gebiet darstellt. Inzwischen kann auch die kostenlose Erreichbarkeitsanalyse [1] im Portal von OpenRouteService.org (ORS) verwendet werden. Der Dienst ermittelt dabei realistischere Isochronen als Polygone auf Basis des Stra&#223;ennetzes. Diese Fl&#228;chen repr&#228;sentieren dann das Gebiet, welches in einer vorgegebenen Zeit oder Entfernung erreicht werden kann.

Im Vortrag wird beispielhaft f&#252;r die Gemeinde H&#252;nstetten im Taunus gezeigt, welche Gebiete die gemeindeeigenen freiwilligen Feuerwehren in bestimmten Zeiten abdecken k&#246;nnen. Dabei werden unterschiedliche Dienste, die Daten des OSM Projektes verwenden, genutzt. Angefangen bei der Overpass API [2], &#252;ber die Erreichbarkeitsanalyse von ORS [3] zu der Darstellung der Ergebnisse mittels der freien Javascript Bibliothek OpenLayers [4]. Der Vortrag wird vor allem so aufgebaut sein, dass es anschlie&#223;end f&#252;r jeden m&#246;glich sein sollte, das Gezeigte f&#252;r ein eigenes Gebiet wiederholen zu k&#246;nnen. Weitere Informationen finden sich hier [5][6].


Referenzen:
[1] Neis, P., A. Zipf (2007): A Web Accessibility Analysis Service based on the OpenLS Route Service. AGILE 2007. International Conference on Geographic Information Science of the Association of Geograpic Information Laboratories for Europe (AGILE). Aalborg, Denmark.
[2] http://wiki.openstreetmap.org/wiki/Overpass_API
[3] http://wiki.openstreetmap.org/wiki/DE:OpenRouteService#Was_kannst_Du_alles_auf_ORS_machen.3F
[4] OpenLayers: Free Maps for the Web  - http://openlayers.org/
[5] http://neis-one.org/2010/08/etwas-osm-fur-die-feuerwehr/
[6] http://neis-one.org/2010/09/osm-fur-die-feuerwehr-2-0/
</description>
        <persons>
          <person id="66">Pascal Neis</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="373">
        <start>16:00</start>
        <duration>00:30</duration>
        <room>H&#246;rsaal 04/114</room>
        <slug></slug>
        <title>Eigene OpenStreetMap Kartendienste</title>
        <subtitle>Mit freier Software eigene, individuelle Kartendienste auf OpenStreetMap-Basis aufsetzen.</subtitle>
        <track>Vorträge (OSM)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Wie die OpenStreetMap Daten selbst, liegen auch alle Softwarekomponenten und Konfigurationsdateien unter einer freien Lizenz vor, die ben&#246;tigt werden um einen eigenen Kartendienst wie openstreetmap.org aufzusetzen.

Der Standardkartendienst unterliegt jedoch einigen Einschr&#228;nkungen, die die Nutzung erschweren, wie zum Beispiel hohe Hardwareanforderungen, komplizierte Anpassung des Kartendesigns oder die fehlende WMS Unterst&#252;tzung.

Der Vortrag stellt eine alternative Softwaresammlung vor, die es erm&#246;glicht die OpenStreetMap-Daten in PostGIS zu importieren, individuelle Karten zu designen und f&#252;r Web- und GIS-Anwendungen bereitzustellen.

Vorgestellt werden:

 - Imposm
 - PostgreSQL/PostGIS
 - Mapnik/TileMill
 - mb-utils
 - MapProxy</abstract>
        <description></description>
        <persons>
          <person id="153">Oliver Tonnhofer</person>
        </persons>
        <links>
          <link href="http://imposm.org">http://imposm.org</link>
          <link href="http://postgis.refractions.net/">http://postgis.refractions.net/</link>
          <link href="http://mapnik.org/">http://mapnik.org/</link>
          <link href="http://mapbox.com/tilemill/">http://mapbox.com/tilemill/</link>
          <link href="http://mapproxy.org">http://mapproxy.org</link>
        </links>
      </event>
      <event id="351">
        <start>16:30</start>
        <duration>00:30</duration>
        <room>H&#246;rsaal 04/114</room>
        <slug></slug>
        <title>Mobiles ortsbezogenes soziales Netzwerk</title>
        <subtitle>Ein Geowiki auf OSM-Basis</subtitle>
        <track>Vorträge (OSM)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Im Rahmen des BMBF-gef&#246;rderten Forschungsprojekts EMN-MOVES entsteht an der Universit&#228;t Bamberg der Prototyp eines &#8222;Geo-Wikis&#8220; auf Basis von OSM. Unser Beitrag untersucht konzeptuelle und technische Herausforderungen, die durch die engen Verzahnung von textuellen und kartenbasierten Informationen entstehen. Wir gehen auch auf Formen der Personalisierung und standortabh&#228;ngige Views f&#252;r mobile Nutzer ein.</abstract>
        <description>Ein wesentlicher Aspekt selbstbestimmten Wohnens und Lebens ist die Erhaltung der Mobilit&#228;t im Alter und bei k&#246;rperlichen Behinderungen. Hierzu z&#228;hlt der Gang zum B&#228;cker genauso wie die Nutzung von Mitfahrgelegenheiten. Im BMBF-Projekt EMN-MOVES haben sich Universit&#228;ten, Wohungsunternehmen und Pflegedienstleister zusammengeschlossen, um soziale und technische Dienste zu entwickeln, die Bewohner von Wohnquartieren bef&#228;higen, ihre individuelle Mobilit&#228;t durch gemeinschaftliches Handeln zu bewahren.

Ein wesentlicher technischer Baustein ist ein quartierbezogens &#8222;Geo-Wiki&#8220; auf OSM-Basis, das die Umgebung eines Wohnviertels, m&#246;gliche Wege, Anschl&#252;sse an den Nahverkehr, aber auch Barrieren wie Treppen oder Baustellen beschreibt. Die Bewohner, unterst&#252;tzt durch ehrenamtliche Helfer, k&#246;nnen mit Hilfe des Wikis Mobilit&#228;tshindernisse &#8211; beispielsweise Baustellen, Sperrungen, ver&#228;nderte Fahrpl&#228;ne &#8211; identifizieren und L&#246;sungen zu deren Beseitigung oder Umgehung ver&#246;ffentlichen. 

Im &#8222;Geo-Wiki&#8220; stehen Text- und Karteninformationen gleichberechtigt nebeneinander. Das Einbinden von OSM-Karten in ein Mediawiki wie auf den geolokalisierten Seiten der Wikipedia kann dabei ein erster Schritt sein, bietet allerdings nur eine lose Kopplung. F&#252;r uns stellen sich mehrere Forschungsfragen:

* Ortsinformationen und Wegbeschreibungen k&#246;nnen in sehr unterschiedlicher Weise angeboten werden. Dies reicht von umgangssprachlichen Ortsbezeichnungen &#8222;am gro&#223;en Brunnen&#8220; &#252;ber Adressen &#8222;Feldkirchenstra&#223;e 21, 96045 Bamberg&#8220; bis hin zu Geokoordinaten &#8222;10.905653, 49.907141&#8220;. Welche Formen der semantischen Verarbeitung und Darstellung in Text und Karte bieten sich hier an?

* Gerade f&#252;r Nutzer mobiler Endger&#228;te ist eine vom aktuellen Standpunkt abh&#228;ngige Sicht auf das &#8222;Geo-Wiki&#8220;, gegebenenfalls auch f&#252;r spzialisierte mobile Clients, hilfreich. Wie kann das System den f&#252;r den Nutzer passende Kontext bestimmen?

* Welche Aspekte eines &#8222;Sozialen Netzwerks&#8220; mu&#223; das &#8222;Geo-Wiki&#8220; abbilden, um unterschiedliche personalisierte Sichten und die Zusammenarbeit der Nutzer der unterschiedlichen Rollen wie ehrenamtlicher Helfer, Rollstuhlfahrer usw. zu verbessern? Wie wird die wiki-typische Zusammenarbeit an georeferenzierten Inhalten, insbesondere die Qualit&#228;tssicherung bei der Verfeinerung oder Korrektur von Georeferenzen unterst&#252;tzt?

Wir wollen unsere L&#246;sungsans&#228;tze vorstellen und diskutieren und nat&#252;rlich auch Alternativen kennenlernen.

Klaus Stein und Christoph Schlieder
Lehrstuhl f&#252;r Angewandte Informatik 
in den Kultur-, Geschichts-, und Geowissenschaften
Otto-Friedrich-Universit&#228;t Bamberg
</description>
        <persons>
          <person id="243">Klaus Stein</person>
        </persons>
        <links>
          <link href="http://www.emn-moves.de/">http://www.emn-moves.de/</link>
          <link href="http://">http://</link>
        </links>
      </event>
      <event id="410">
        <start>17:15</start>
        <duration>00:30</duration>
        <room>H&#246;rsaal 04/114</room>
        <slug></slug>
        <title>Die deutschen OSM Dev Server</title>
        <subtitle>Vorstellung &amp; Nutzung</subtitle>
        <track>Community Sessions</track>
        <type></type>
        <language></language>
        <abstract>Der FOSSGIS betreibt speziell f&#252;r OSM drei von STRATO gesponsorte Server und ganz neu einen vierten Server, der aus ESRI-Sponsorgeldern finanziert wurde. Auf diesen Servern werden von Mitgliedern der OSM-Community ganz verschiedene n&#252;tzliche Dienste angeboten; dieses Angebot erm&#246;glicht es auch denen, die sich nicht mal schnell einen Server leisten k&#246;nnen und wollen, sich technisch in der OSM-Community einzubringen. Unter anderem liefern diese Server den deutschen Kartenstil aus, produzieren regelm&#228;&#223;ig OSM-Karten f&#252;r Garmin-GPS-Ger&#228;te und bieten statische Kartendienste an.

Alle Software auf den Dev-Servern muss Open Source sein.

Dieser Vortrag berichtet vom aktuellen Stand auf den Dev-Servern und gibt Entwicklern alle n&#246;tigen Informationen, um selbst ein Dev-Server-Projekt auf die Beine zu stellen.</abstract>
        <description></description>
        <persons>
          <person id="26">Sven Geggus</person>
        </persons>
        <links>
        </links>
      </event>
    </room>
    <room name="H&#246;rsaal 04/113">
      <event id="404">
        <start>15:30</start>
        <duration>00:30</duration>
        <room>H&#246;rsaal 04/113</room>
        <slug></slug>
        <title>Das Anlagen- und Indirekteinleiterkataster (AUIK) der Stadt Bielefeld</title>
        <subtitle></subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract>Im Anlagen- und Indirekteinleiterkataster (AUIK) der Stadt Bielefeld werden standortbezogene Daten zu Anlagen zum Umgang mit wassergef&#228;hrdenden Stoffen und Indirekteinleitern erfasst. Durch die objektorientierte Struktur l&#228;&#223;t es sich leicht f&#252;r andere Informationen, die &#252;ber einen Standort (Stra&#223;e/Hausnummer) und einen Betreiber definiert sind, einsetzen. Die Datenhaltung findet in einer PostgreSQL/PostGIS Datenbank statt. &#220;ber eine Schnittstelle kann QGIS, ausgehend von einem Standort, mit einem lokal gespeicherten Projekt ge&#246;ffnet werden. Dabei wird einem modifizierten zoom-to-point PlugIn der Rechts- und Hochwert dieses Standortes &#252;bergeben, so dass man einfach zu diesem Standort navigieren kann. Umgekehrt ist es m&#246;glich, Rechts- und Hochwerte aus der Karte abzugreifen und in Datens&#228;tze einzutragen. Durch die gemeinsame Datenhaltung mit geografischen Daten k&#246;nnen Sachdaten mit diesen verschnitten werden. Dar&#252;ber hinaus k&#246;nnen automatisch Eintr&#228;ge in Datens&#228;tze aufgrund ihrer r&#228;umlichen Zugeh&#246;rigkeit zu beispielsweise Entw&#228;sserungsgebieten, Wasserschutzgebieten etc. generiert werden.</abstract>
        <description>Bei dem Anlagen- und Indirekteinleiterkataster (AUIK) handelt es sich um eine Eigenprogrammierung der Stadt Bielefeld die mittlerweile von der Intevation GmbH in Osnabr&#252;ck unterst&#252;tzt wird. Hier wird auch der Code, der seit April diesen Jahres unter der GNU General Public License steht, gehostet. Die Anf&#228;nge der Programmierung gehen auf die fr&#252;hen 90er Jahre zur&#252;ck. Seit 2005 laufen die Frontends unter Java. Als Backend kommt nach DB2 und Informix mittlerweile eine PostgreSQL/PostGIS Datenbank zum Einsatz.

Erfasst werden in der Datenbank alle wesentlichen Informationen zu Anlagen zum Umgang mit wassergef&#228;hrdenden Stoffen (VAwS) und Firmen, die produktionsspezifisches Abwasser in die &#246;ffentliche Kanalisation einleiten (Indirekteinleiter). An verschiedenen Stellen wie z. B. wiederkehrende Sachverst&#228;ndigenpr&#252;fungen werden automatisch Wiedervorlagelisten erzeugt. Probenahmen nach Entw&#228;sserungssatzung werden in dem System vom Autrag &#252;ber den automatischen Import der Analyseergebnisse bis zur Generierung des Geb&#252;hrenbescheides bearbeitet. Des Weiteren sind in dem System die Messwerte der Kl&#228;rschlammanalytik und von Sielhautuntersuchungen im Kanalnetz enthalten. Die Entwicklung der Schadstoffgehalte wird in Diagrammen graphisch aufbereitet, wodurch ein umfassendes Bild &#252;ber die Gesamtsituation, regionale Unterschiede und deren potentielle Verursacher entsteht.

Da in dem Kataster Objekte erfasst werden, die mindestens einen Standort, einen Betreiber und eine Objektart haben, l&#228;sst es sich durch erg&#228;nzen eines Eintrages in der Objektart-Tabelle f&#252;r beliebige andere Zwecke verwenden. Erst wenn die Bearbeitung der Objekte zus&#228;tzliche Attribute erfordert, muss die Datenbank erweitert und zus&#228;tzliche Masken programmiert werden. In der Regel sind an einem Standort nur wenige Objekte erfasst, so dass man mit einem Blick einen &#220;berblick bekommt. Wird die Liste einmal zu lang, l&#228;sst sie sich nach unterschiedlichen Kriterien verk&#252;rzen.

Eine lockere Anbindung des QGIS an das Kataster erlaubt es, das Programm ausgehend von einem Standort zu starten. Bei diesem Aufruf wird dem QGIS-PlugIn "zoom-to-point" &#252;ber zwei Umgebungsvariablen der Rechts- und Hochwert des Standortes &#252;bergeben. Dadurch ist es m&#246;glich, mit wenigen Klicks zu einem Standort zu navigieren. Das QGIS-Projekt, das hierbei zur Anwendung kommt, wird von einer Vorlage auf den lokalen Rechner kopiert und kann hier, abh&#228;ngig von den Anforderungen und F&#228;higkeiten des/der einzelnen Sachbearbeiters/Sachbearbeiterin, modifiziert werden.

Wenn Rechts- und Hochwerte aus der Karte abgegriffen und in einen Standort oder Messstellendatensatz eingetragen werden sollen, so ist dies &#252;ber das Tool "Koordinaten aufnehmen" und die Zwischenablage m&#246;glich. Neben dem o. g. PlugIn "zoom-to-point" gibt es noch zwei weitere eigene PlugIns f&#252;r QGIS bei der Stadt Bielefeld die im Grunde ebenfalls von diesem abgeleitet sind. Das eine erm&#246;glicht die Navigation zu einem Standort direkt im QGIS. Hier wird auf eine zentrale Datenbank zugegriffen, die regelm&#228;&#223;ig aktualisiert wird und s&#228;mtliche Standorte der Stadt Bielefeld enth&#228;lt. Das zweite bietet die M&#246;glichkeit zu einem beliebigen Flurst&#252;ck zu navigieren und benutzt die selbe Datenbank.

Seit dem Umstieg auf die PostgreSQL/PostGIS Datenbank Anfang diesen Jahres, wurde diese in "fisumwelt", was f&#252;r Fach-Informations-System-Umwelt steht, umbenannt. Neben dem Schema "auik", in dem die Sachdatenhaltung des Katasters stattfindet, gibt es in dieser Datenbank ein Schema "gis" f&#252;r Geoinformationen. Hier ist z. B. der gesamte Kanalbestand, die Wasserschutzgebietsgrenzen, Altlastenverdachtsfl&#228;chen, Zust&#228;ndigkeitsbereiche usw. gespeichert. Da unser Katasteramt eine Vielfalt von Karten als WMS zur Verf&#252;gung stellt, ist es nun auch wenig ge&#252;bten Benutzern m&#246;glich, ein QGIS-Projekt mit Hintergrundkarten und Fachdatenebenen zu erstellen. Ein weiteres Schema mit dem Namen "oberflgw" ist mittlerweile hinzugekommen. Hier werden die Daten zur Bearbeitung der Einleitungen und Bauwerke in Oberfl&#228;chengew&#228;ssern gespeichert. Sobald das Programm "AquaInfo", das bei uns zur Erfassung der Grundwassermessstellen, Trinkwasserbrunnen und Sondierungen eingesetzt wird, die PostgreSQL Datenbank unterst&#252;tzt, werden auch diese Informationen hier abgelegt und damit &#252;ber die gleiche Schnittstelle im QGIS verf&#252;gbar sein.

Durch die gemeinsame Datenhaltung von Sach- und Geographiedaten sind nicht nur r&#228;umliche Abfragen wie: "Welche Heiz&#246;ltanks liegen in Wasserschutzgebieten" sehr einfach, man kann auch Datens&#228;tze aufgrund ihrer Lage manipulieren. So wurden alle Standortdaten mit Informationen &#252;ber die Zugeh&#246;rigkeit zu einem Entw&#228;sserungsgebiet und VAwS-Bezirk erg&#228;nzt.

N&#228;here Informationen erhalten Sie bei gerd.genuit@bielefeld.de. Der Quellcode kann unter http://wald.intevation.org/projects/auik/ heruntergeladen werden. Hier wird auch in K&#252;rze eine Webseite zu dem Projekt entstehen.</description>
        <persons>
          <person id="247">Gerhard Genuit</person>
        </persons>
        <links>
          <link href="http://wald.intevation.org/projects/auik/">http://wald.intevation.org/projects/auik/</link>
          <link href="http://">http://</link>
        </links>
      </event>
      <event id="452">
        <start>16:00</start>
        <duration>00:30</duration>
        <room>H&#246;rsaal 04/113</room>
        <slug></slug>
        <title>Konzeption eines Spatial Business Intelligence Systems zur Analyse und Steuerung von Re-Produktionsketten</title>
        <subtitle>auf Grundlage von OpenSource Komponenten</subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Re-Produktionsketten sind Kombinationen technischer Prozesse des Wasser- und Energiesektors im l&#228;ndlichen Raum, die in stofflicher, energetischer oder wirtschaftlicher Hinsicht miteinander in Beziehung gesetzt sind und als Ziel die lokale Wertsch&#246;pfung und Ressourceneinsparung verfolgen. In diesem interdisziplin&#228;ren Arbeitsfeld setzt sich das Forschungsprojekt mit der Identifizierung, dem Aufbau und der Steuerung derartiger regionaler Stoffkreisl&#228;ufe auseinander. Angesichts steigender Preise f&#252;r Energie und Rohstoffe interessieren sich Kommunen und Unternehmen sehr f&#252;r den Aufbau solcher regionaler Wertsch&#246;pfungsketten. F&#252;r die r&#228;umlich-analytische Untersuchung der starken r&#228;umlichen Beziehungen zwischen den Akteuren, den technischen und nat&#252;rlichen Elementen der Re-Produktionsketten soll ein r&#228;umliches Entscheidungsunterst&#252;tzungssystem (Spatial Business Intelligence System) auf Grundlage von OpenSource Komponenten aufgebaut werden, welches auf kommunaler Ebene zum Einsatz kommen soll. Die tragende Herausforderung ist dabei die kombinierte r&#228;umliche Betrachtung von GIS-Analysen und Business Intelligence in einer Web-basierten Anwendung. Ein solches System besteht aus verschiedensten Technologien um den umfangreichen Prozess aus Datenrecherche, -beschaffung, -bereitstellung, -integration und -modellierung zu verarbeiten und zu steuern.</abstract>
        <description></description>
        <persons>
          <person id="239">Martin Becker</person>
        </persons>
        <links>
          <link href="http://www.reproketten.de">Homepage RePro-Ketten</link>
        </links>
      </event>
      <event id="364">
        <start>16:30</start>
        <duration>00:30</duration>
        <room>H&#246;rsaal 04/113</room>
        <slug></slug>
        <title>Forschungsdatenmanagement mit Open-Source-Software </title>
        <subtitle>Verbindung von Geodateninfrastruktur mit Semantic Web Technologien</subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract>In diesem Beitrag wird die Entwicklung und Implementation des Datenmanagement des interdisziplin&#228;ren Sonderforschungsbereich 806 (SFB806) vorgestellt. 
Der SFB806 ist ein, von der deutschen Forschungsgemeinschaft (DFG) gef&#246;rdertes, interdisziplin&#228;res Forschungsprojekt an den Universit&#228;ten K&#246;ln, Bonn und Aachen, dass sich mit der Ausbreitung des modernen Menschen (Homo Sapiens) von Afrika nach Mitteleuropa befasst. Insgesamt sind &#252;ber 100 Forscher am Projekt beteiligt, die a.) Daten produzieren, die sicher archiviert und der Forschungscommunity zug&#228;nglich gemacht werden m&#252;ssen. Und b.) Daten f&#252;r ihre Forschungen ben&#246;tigen.
Die SFB806-Datenbank implementiert also zwei Aspekte, a. ein Archiv der Forschungsergebnisse des SFB806 und b. eine integrierte Datenbasis und (Geodaten-)Infrastruktur als Grundlage f&#252;r Forschungen im SFB806. 
Fokus des Beitrags ist die OpenSource-Software basierte Umsetzung der beiden Aspekte, unter Verwendung von Technologien wie OGC Standards und Semantic Web (RDF) Methoden f&#252;r das Backend, und webbasierten Interfaces (Webportal/WebGIS,SPARQL Endpoint) f&#252;r das System.</abstract>
        <description></description>
        <persons>
          <person id="192">Christian Willmes</person>
        </persons>
        <links>
          <link href="http://www.sfb806db.uni-koeln.de/slides/FOSSGIS2012.html">http://www.sfb806db.uni-koeln.de/slides/FOSSGIS2012.html</link>
          <link href="http://">http://</link>
        </links>
      </event>
    </room>
    <room name="WSRaum1">
      <event id="450">
        <start>11:00</start>
        <duration>01:30</duration>
        <room>WSRaum1</room>
        <slug></slug>
        <title>Einfache Rasterdatenverarbeitung mit GDAL</title>
        <subtitle>Grundlagenworkshop f&#252;r Einsteiger</subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language></language>
        <abstract>Die Geodata Abstraction Library (GDAL) stellt verschiedene Tools zur Rasterdatenverarbeitung bereit. Dabei handelt es sich um Kommandozeilenprogramme, die sich hervorragend zur Formatkonvertierung, zur Erzeugung von Bildkatalogen und Bildausschnitten, zur Umrechnung der Aufl&#246;sung u.a. eignen.

Im Fokus dieses Workshops steht die Vorverarbeitung von Rasterdaten zur Performanzsteigerung von WebGIS-Anwendungen mit dem UMN-MapServer. Der Workshop gibt einen &#220;berblick &#252;ber wichtige Eigenschaften von Rasterdaten, und f&#252;hrt in die Benutzung der Kommandozeilenprogramme in einer Shell unter Linux bzw. einem DOS-Fenster unter Windows ein. Die Teilnehmerinnen und Teilnehmer haben die M&#246;glichkeit, in einer &#220;bungsreihe verschiedene Programme zur Rasterdatenverarbeitung an praktischen Beispielen kennenzulernen.

Nach den Erfahrungen der vergangenen beiden FOSSGIS- Konferenzen wird es dieses Jahr erstmals einen Grundlagen-Workshop f&#252;r Einsteiger und einen thematischen Workshop f&#252;r Fortgeschrittene geben. Wenn Sie die M&#246;glichkeiten der Rasterdatenverarbeitung kennenlernen m&#246;chten und sich bislang noch nicht an den Einsatz von Kommandozeilenprogrammen gewagt haben, bekommen Sie mit diesem Workshop einen guten Einstieg in ein lohnendes Thema!</abstract>
        <description></description>
        <persons>
          <person id="17">Andreas Fischer</person>
          <person id="23">Till Adams</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="463">
        <start>15:30</start>
        <duration>01:30</duration>
        <room>WSRaum1</room>
        <slug></slug>
        <title>Einf&#252;hrung in den OSM Editor JOSM</title>
        <subtitle></subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language></language>
        <abstract></abstract>
        <description></description>
        <persons>
          <person id="95">Frederik Ramm</person>
        </persons>
        <links>
        </links>
      </event>
    </room>
    <room name="WSRaum2">
      <event id="438">
        <start>11:00</start>
        <duration>01:30</duration>
        <room>WSRaum2</room>
        <slug></slug>
        <title>Einf&#252;hrung in die JavaScript-Kartenbibliothek OpenLayers</title>
        <subtitle>Dynamische Kartenanwendungen f&#252;r jede Webseite</subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language>de</language>
        <abstract>OpenLayers (http://openlayers.org) ist wahrscheinlich die bekannteste und weit verbreitetste JavaScript-Bibliothek, um Kartenmaterial verschiedenster Quellen im Web zu kombinieren und einheitliche Interaktionsm&#246;glichkeiten bereitszustellen. Der Workshop soll die M&#246;glichkeiten der Bibliothek aufzeigen und die Teilnehmer in die Lage versetzen, eigene Kartenanwendungen auf Basis von OpenLayers zu entwickeln.

Im Workshop, der von Andreas Hocevar (einem der Kernentwickler von OpenLayers, des weiteren Mitglied des Project Steering Committee) und Marc Jansen (einem der Autoren des deutschsprachigen Buches zu OpenLayers und ebenfalls Kernentwickler des Projektes) gehalten wird, werden die folgenden Themen behandelt werden:

OpenLayers Grundlagen: Wie f&#252;gt man mit OpenLayers eine Karte zu einer Webseite hinzu?
Arbeiten mit Layern (Themen): Wie kann man Raster- und Vektorlayer in einer OpenLayers Karte kombinieren?
Arbeiten mit Controls (Kartenwerkzeugen): Wie erweitere ich meine Karte um spezifische Bedienelemente?
Zus&#228;tzlich zu oben genannten Themen werden wir, je nach zur Verf&#252;gung stehender Zeit und den konkreten W&#252;nschen der Teilnehmer, gegebenenfalls die folgenden Aspekte behandeln:

Vektorlayer f&#252;r Fortgeschrittene: Verschiedene M&#246;glichkeiten zur Darstellung von Vektordaten in OpenLayers
Integration mit anderen Bibliotheken: Die Kombination von OpenLayers mit anderen Bibliotheken, um noch reichhaltigere Kartenanwendungen im Web zu erstellen
Zielgruppe sind alle an Webkartographie Interessierten, die OpenLayers kennen lernen wollen. Auch Teilnehmer, die OpenLayers bereits einsetzen, k&#246;nnen von einem Besuch sicherlich profitieren. Wenn Sie absch&#228;tzen m&#246;chten, ob OpenLayers Ihnen bei Ihrer Fragestellung helfen kann, liefert der Workshop sicherlich erste Antworten.

Vorwissen: Grunds&#228;tzliche Kenntnisse von JavaScript sind n&#252;tzlich, werden aber nicht zwingend vorausgesetzt.</abstract>
        <description></description>
        <persons>
          <person id="34">Marc Jansen</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="367">
        <start>15:30</start>
        <duration>01:30</duration>
        <room>WSRaum2</room>
        <slug></slug>
        <title>Einf&#252;hrung in MapServer </title>
        <subtitle>Internetkartographie mit MapServer</subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language></language>
        <abstract>Wir m&#246;chten damit denjenigen, die die Konferenz zum Kennenlernen des Mapservers nutzen wollen, die M&#246;glichkeit geben, sich pers&#246;nlich mit der Funktionsweise vertraut zu machen ohne einen Teil des Vortragsprogramms zu verpassen. Der Workshop soll einen Einblick in die Funktionalit&#228;t des Mapservers geben. 
Folgende Fragen sollen gekl&#228;rt werden: 
* Welche Rolle spielt ein Kartenserver in meiner WebGIS Anwendung?
* Wie kann ich meine Daten mit dem UMN Mapserver visualisieren?
* Wie kann ich OGC konforme Dienste (WMS und WFS) mit dem UMN Mapserver aufsetzen und was bedeutet das eigentlich?
* Welche Formate unterst&#252;tzt der UMN Mapserver?
* Welche Klassifikations- und Stylem&#246;glichkeiten bietet der UMN Mapserver?
* Welche OpenSource-Clients kann ich f&#252;r die Datenvisualisierung mittels Mapserver nutzen?</abstract>
        <description>1. Einf&#252;hrung
    1. Geschichte
    2. Funktionalit&#228;t
    3. DesktopGIS vs. WebGIS
2. Aufbau der Mapdatei
    1. Header
    2. Web
    3. Layer
    4. Class
3. Welche Datenformate werden unterst&#252;tzt
    1. Raster
    2. Vektor
    3. Datenbank
4. OGC WMS mit Mapserver
5. OGC WFS mit Mapserver
</description>
        <persons>
          <person id="242">Toni Pignataro</person>
        </persons>
        <links>
        </links>
      </event>
    </room>
    <room name="WSRaum3">
      <event id="339">
        <start>11:00</start>
        <duration>01:30</duration>
        <room>WSRaum3</room>
        <slug></slug>
        <title>QGIS Plugin Programmierung mit PyQt4 und PyQGIS</title>
        <subtitle></subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language></language>
        <abstract>Der Workshop f&#252;hrt in die Programmierung PyQt4 und PyQGIS ein. Es werden die grundlegenden Konzepte von PyQt vermittelt und ein einfaches PyQGIS-Plugin erarbeitet. Nach dem Workshop sind die Teilnehmer in der Lage ein Plugin zu erstellen und kennen die notwendigen Dokumentationen zur Umsetzung eigener Plugin Ideen. 

Grundkenntnisse in obejektorientierter Programmierung werden voraussgesetzt. </abstract>
        <description></description>
        <persons>
          <person id="13">Horst D&#252;ster</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="442">
        <start>15:30</start>
        <duration>01:30</duration>
        <room>WSRaum3</room>
        <slug></slug>
        <title>Einf&#252;hrung in die OpenGeo Suite</title>
        <subtitle>Web-GIS mit PostGIS, GeoServer und OpenLayers</subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language>de</language>
        <abstract>Der Workshop macht TeilnehmerInnen mit Werkzeugen und Konzepten vertraut, die zum Aufbau und der Nutzung einer kompletten GIS Software Architektur ben&#246;tigt werden: eine r&#228;umliche Datenbank (PostGIS), ein Geodatenserver (GeoServer), ein browser-basiertes Kartenmanagement-Werkzeug (GeoExplorer), ein Cache f&#252;r Kartenkacheln (GeoWebCache), Web-Map Client Frameworks (OpenLayers und GeoExt). Diese Komponenten sind in der OpenGeo Suite zu einem kompletten Installationspaket zusammegefasst.</abstract>
        <description></description>
        <persons>
          <person id="173">Andreas Hocevar</person>
        </persons>
        <links>
        </links>
      </event>
    </room>
    <room name="Vor Ort Aushang">
      <event id="477">
        <start>18:30</start>
        <duration>02:00</duration>
        <room>Vor Ort Aushang</room>
        <slug></slug>
        <title>Social Event im Bauhaus Dessau</title>
        <subtitle></subtitle>
        <track>Community Sessions</track>
        <type>community_session</type>
        <language></language>
        <abstract>Das Social Event am Dienstag Abend findet im Bauhaus Dessau statt. Das Bauhaus befindet sich in unmittelbarer N&#228;he zum Konferenzstandort und bietet die einmalige Gelegenheit die Dessauer Bauhauskulter hautnah zu erleben. Das Social Event soll den Teilnehmern die M&#246;glichkeit geben, sich im abendlichen Ambiente mit anderen Teilnehmern auszutauschen.

Im Preis inbegriffen sind Buffet sowie 3-4 Getr&#228;nke (werden als Gutscheine ausgegeben) und die musikalische Untermalung.

Unkostenbeitrag: 45&#8364;.</abstract>
        <description></description>
        <persons>
        </persons>
        <links>
          <link href="http://www.fossgis.de/konferenz/2012/socialevents/">&#220;bersicht Social Events</link>
        </links>
      </event>
    </room>
  </day>
  <day date="2012-03-21" index="3">
    <room name="H&#246;rsaal des Umweltbundesamtes (UBA)">
    </room>
    <room name="H&#246;rsaal 08">
      <event id="413">
        <start>09:00</start>
        <duration>00:30</duration>
        <room>H&#246;rsaal 08</room>
        <slug></slug>
        <title>Produktion topographischer Webkarten aus amtlichen Geobasisdaten unter Verwendung freier Software</title>
        <subtitle>Einsatz von Mapnik f&#252;r das Rendern von Karten aus amtlichen Landschaftsmodellen</subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Beim Bundesamt f&#252;r Kartographie und Geod&#228;sie wurde die Software Mapnik eingesetzt, um Webkarten aus verschiedenen amtlichen Geobasisdaten zu rendern. Das Ziel war der Aufbau eines WMTS, welcher Karten in verschiedenen Zoomstufen und Darstellungsvarianten pr&#228;sentieren sollte, die den amtlichen topographischen Karten der Bundesrepublik Deutschland &#228;hnlich sind.

Neben den Daten des Digitalen Basislandschaftsmodells Deutschlands (Basis-DLM) wurde auf weitere Geobasisdaten zur&#252;ckgegriffen. F&#252;r kleinere Zoomstufen wurde das Digitale Landschaftsmodell 1 : 250 000 eingesetzt. F&#252;r die Darstellung der Geb&#228;ude in gr&#246;&#223;eren Zoomstufen wurden die Daten der amtlichen Hausumringe verwendet. Ebenso kam der Datensatz "Georeferenzierte Adressdaten Bund" zum Einsatz, um in der h&#246;chsten Zoomstufe die Geb&#228;ude mit Hausnummern versehen zu k&#246;nnen. Dieser Datensatz beruht auf den amtlichen Hauskoordinaten der L&#228;nder.

H&#246;henlinien wurden aus dem Digitalen Gel&#228;ndemodell mit einer Gitterweite von 10m gerechnet. F&#252;r eine Darstellungsvariante des WMTS wurde auch eine Schummerung aus dem gleichen DGM10 gerechnet. F&#252;r die Berechnung der H&#246;henlinien und der Schummerung wurde auf die freie Bibliothek GDAL zur&#252;ckgegriffen. Eine weitere Bearbeitung der Schummerungen erfolgte unter Zuhilfenahme des Open-Source-Frameworks AForge.NET.

Alle vektoriellen Geobasisdaten wurden zun&#228;chst in Postgis-Datenbanken &#252;bertragen. F&#252;r die Aufbereitung der GIS-Daten und f&#252;r den Import in die Postgis-Datenbanken wurde die Software Safe FME eingesetzt.

Der Vortrag beschreibt die Prozesskette der einzelnen Bearbeitungsschritte von der Aufbereitung der Geodaten bis hin zum Renderprozess der Kartendaten.</abstract>
        <description>Aufgaben des Bundesamtes f&#252;r Kartographie und Geod&#228;sie
Amtliche Geobasisdaten der Bundesrepublik Deutschland
Datenaufbereitung mit FME und Import der Daten nach Postgis
Erzeugen von H&#246;henlinien aus dem DGM10 mit GDAL
Aufbau der Prozesskette f&#252;r das Rendern der Kartendaten
Probleme beim Erzeugen der Kartengrafik
Kartenbeispiele der verschiedenen Zoomstufen und Darstellungsvarianten
Ausblick

</description>
        <persons>
          <person id="277">Peter Kunz</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="407">
        <start>09:30</start>
        <duration>00:30</duration>
        <room>H&#246;rsaal 08</room>
        <slug></slug>
        <title>Bauzonenstatistik in der Verwaltung mit FOSS</title>
        <subtitle></subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Nebst der Ausgabe rein attributiver Kenngr&#246;ssen zu einem Datensatz, erm&#246;glicht die Anwendung auch clientseitige Manipulation der Geometrieobjekte. Dazu kommt aus PostGIS 2.0 eine neue Funktion zum Splitten von Parzellen zum Einsatz, die bisher umst&#228;ndliche und fehleranf&#228;llige Workarounds ersetzt. Des Weiteren wird auf das Thema Historisierung von Parzellen eingegangen, welches seit Jahren zwar durch Gesetze vorgeschrieben ist und auf dem Skizzenblock existiert, jedoch technisch noch nicht umgesetzt worden ist.</abstract>
        <description></description>
        <persons>
          <person id="130">Hans-J&#246;rg Stark</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="444">
        <start>10:00</start>
        <duration>00:30</duration>
        <room>H&#246;rsaal 08</room>
        <slug></slug>
        <title>DIVE4elements als Business Intelligence Werkzeug</title>
        <subtitle>Wasserwirtschaft und Ozenaographie: Ma&#223;geschneiderte Arbeitsprozesse Analysen und Produkte</subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>DIVE4elements ist ein BI-Werkzeug zur Analyse, Modellierung und
Visualisierung von Arbeitsprozessen auf gro&#223;en, (geo-)bezogenen
Datenmengen und wird z.Z. in der Ozeanographie und Wasserwirtschaft
eingesetzt.

Herzst&#252;ck von DIVE4elements ist die flexible
Konfigurierbarkeit von Workflows, die auf Basis von komplexen
Abfragen auf angeschlossenen Datawarehouses (Data Mining) 
zu Produkten in Form von Diagrammen, Karten (OGC konform WMS/WFS)
und Datenexporten f&#252;hren. Das Systems wurde auf leichte 
Verst&#228;ndlichkeit hin entworfen, um gut auf individuelle
Anforderungen reagieren zu k&#246;nnen.

Durch den modularen, REST-basierten Aufbau des Systems ist eine
Nutzung verschiedener Arten von Klienten m&#246;glich:
Kommandozeile, Web-Interfaces (klassisch/AJAX) und Desktop. 

Durch die Mehrschichtigkeit ist serverseitig eine effektive Lastverteilung m&#246;glich.
Dies ist gerade bei intensivem Geo-Processing von Vorteil.
Skalierbarkeit wird zus&#228;tzlich durch integriertes Caching
gew&#228;hrleistet. Datenbankabstraktion erm&#246;glicht die Anbindungen
verschiedener Datenquellen.

Der Vortrag zeigt exemplarisch zwei Anwendungsf&#228;lle der Software im
Produktivbetrieb. Die erzeugten Karten werden hier mit Hilfe von 
UMN MapServer und OpenLayers erstellt.

DIVE4elements ist in Java implementiert und als Freie Software unter der
LGPL ver&#246;ffentlicht.

Weitere Informationen sind und unter http://dive4elements.org/ zu finden.</abstract>
        <description></description>
        <persons>
          <person id="284">Sascha L. Teichmann</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="386">
        <start>11:00</start>
        <duration>00:30</duration>
        <room>H&#246;rsaal 08</room>
        <slug></slug>
        <title>NAS - BasisDLM Aufbereitung mit gdal/PostNAS</title>
        <subtitle>Kostenfreie Tools f&#252;r das performante Management von Geodaten der &#214;ffentlichen Verwaltung </subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Vorstellung eines kostenfreien Verfahrens zur Bereitstellung von tagesaktuellen und ma&#223;stabsfreien WMS Diensten auf Grundlage von AAA DLM Daten. 
Seit der Integration einer lesenden Schnittstelle f&#252;r die NAS Daten in die gdal Bibliothek, kann beinahe jede Software die gdal nutzt auch NAS XML Dateien lesen und bei Bedarf darstellen. Die Schnittstelle erm&#246;glicht eine &#220;berf&#252;hrung der kompliziert modellierten NAS Objekte in eine relativ flache Datenstruktur. Die Beziehungen der Objekte untereinander werden dabei in einer eigenen Tabelle abgelegt. Auf Grundlage dieses Konverters, der aus dem PostNAS Projekt (www.postnas.org) stammt, wurde schon ein Auskunftssystem f&#252;r Katasterdaten aufgesetzt (ALKIS Auskunft des Kommunalen Rechenzentrums Minden-Ravensberg/Lippe). Das System basiert auf den FOSS Komponenten UMN Mapserver, Mapbender und PostGIS.
Da die Datenstruktur von ATKIS mit der von ALKIS identisch ist, l&#228;&#223;t sich der Konverter auch f&#252;r die Daten des Digitalen Landschaftsmodells einsetzen. In einem Proof of Concept wurden die Daten des BasisDLM's (Vektordaten 1:25.000) von Rheinland-Pfalz &#252;ber die PostNAS Schnittstelle in eine PostGIS-DB &#252;berf&#252;hrt und dort mit PostGIS Funktionen in 6 Stufen generalisiert. Das Rendering &#252;bernimmt hier, wie auch bei der ALKIS Auskunft, ein UMN Mapserver. Beim Aufsetzen der Logik wurde besonderes auf ein performantes Rendering der Vektordaten geachtet. Der einzelne Renderingprozess selbst braucht in allen Stufen weniger als 0.5s pro Bild. 
Da der gesamte Importprozess f&#252;r Rheinland-Pfalz mehr als 5h ben&#246;tigt, geschieht die Fortf&#252;hrung der Daten &#252;ber das s.g NBA Verfahren. Hier werden t&#228;glich nur die &#196;nderungen &#252;bertragen. 
Der WMS, dem man als Ergebnis erh&#228;lt, rendert die Daten die am Tag zuvor in der Datenhaltungskomponente der Vermessungsverwaltung fortgef&#252;hrt werden. Das Verfahren eignet sich sehr gut f&#252;r Nutzer, die &#252;ber wenig bzw. keine finanziellen Mittel verf&#252;gen um sich teure propriet&#228;re AAA Konverter anzuschaffen.</abstract>
        <description>Inhalt
* Hintergr&#252;nde / Geschichte
* BasisDLM Umsetzung mit PostNAS 
* Generalisierung
* Live Demo
* Performance
* Live Rendering &#8596; Rasterkacheln
* Offene Punkte
* Diskussion

Kontakt zu den Autoren:
Tobias Dick
Universit&#228;t Trier
Fachbereich VI Geographie/Geowissenschaften
Abteilung Fernerkundung
Behringstr. 21
54286 Trier
0651/201-4594
s6todick@uni-trier.de

Armin Retterath
Zentrale Stelle Geodateninfrastruktur Rheinland-Pfalz
Landesamt f&#252;r Vermessung und Geobasisinformation RP
Ferdinand-Sauerbruch-Stra&#223;e 15
56073 Koblenz
0261/492-466
armin.retterath@lvermgeo.rlp.de</description>
        <persons>
          <person id="257">Armin Retterath</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="338">
        <start>11:30</start>
        <duration>00:30</duration>
        <room>H&#246;rsaal 08</room>
        <slug></slug>
        <title>PGVS - Konkurrenzierendes Editieren von PostGIS Layern</title>
        <subtitle></subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Das versionierte Bearbeiten von PostGIS-Layern wird bedeutend, wenn mehr als eine Person gleichzeitig an einem Layer arbeitet, oder spezifische Projektst&#228;nde der zu bearbeitenden Daten erhalten werden sollen. Das Ziel des PostGIS Versionierungs Systems pgvs ist das Management verschiedener konkurrenzierender Versionen eines einzelnen PostGIS Layers. Dabei ist das System so angelegt, dass es sich &#228;hnlich wie Quellcode Versionierungssysteme wie z.B. CVS oder Subversion verh&#228;lt. Mit pgvs werden Layer individuell bearbeitet und die &#196;nderungen in die produktive Umgebung zur&#252;ck gespielt. Allf&#228;llige Konflikte k&#246;nnen bereinigt werden. Im Vortrag wird ausserdem das Zusammenspiel der PostGIS Versionierung mit der M&#246;glichkeit PostGIS-Daten offline zu editieren pr&#228;sentiert.

Der erste Teil des Vortrages f&#252;hrt in das Konzept und die Funktionsweise von pgvs als Erweiterung von PostGIS ein. Im zweiten Teil der Pr&#228;sentation wird ein QGIS Plugin vorgestellt, das als Frontend zu pgvs dient und auf diese Weise einen einfachen Einsatz von pgvs erm&#246;glicht.
</abstract>
        <description></description>
        <persons>
          <person id="13">Horst D&#252;ster</person>
        </persons>
        <links>
          <link href="http://www.kappasys.ch/cms/index.php?id=23">http://www.kappasys.ch/cms/index.php?id=23</link>
        </links>
      </event>
      <event id="337">
        <start>12:00</start>
        <duration>00:30</duration>
        <room>H&#246;rsaal 08</room>
        <slug></slug>
        <title>PostGIS 2.0 - Was bringt die neue Version?</title>
        <subtitle></subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Die Version 2.0 wird f&#252;r M&#228;rz 2011 erwartet. Anhand von einigen Beispielen sollen die Neuerungen der PostGIS Version 2.0 vorgestellt werden. Welche neuen Funktionen wird es geben? Neue Funktionen zur Datenbereinigung. Rasterunterst&#252;tzung. Topologien. TypMod.

Die PostGIS Version 2.0.0 wurde f&#252;r das erste Quartal 2012 angek&#252;ndigt. Nur noch wenige offene Tickets verhindern die Ver&#246;ffentlichung. Die Entwickler haben &#252;ber 900 Tickets f&#252;r die Version 2.0.0 bearbeitet. Zahlreiche Neuerungen erwarten uns mit diesem Release.

Die Liste der Neuerungen in der Version 2.0 ist sehr lang, und zu Recht wurde hier der Hauptversionssprung gew&#228;hlt.
Nachfolgend werden einige Neuerungen aufgef&#252;hrt, die im Vortrag vorgestellt werden sollen. Nat&#252;rlich kann hier nur eine kleine Auswahl pr&#228;sentiert werden. Au&#223;erdem wird vorgestellt, was beim Wechsel nach PostGIS 2.0.0 zu beachten ist. 

* geometry_columns ist nun eine Sicht (wie auch geography_columns), die aus dem Systemkatalog aufgebaut wird, und keine Tabelle mehr 
* Unterst&#252;tzung der Installation von PostGIS &#252;ber CREATE EXTENSION (ab PostgreSQL 9.1)
* neue Unterst&#252;tzung f&#252;r Raster [5]
* Topologie-Unterst&#252;tzung &#8211; setzt die SQL/MM Vorgaben um und stellt weitere Funktionen bereit
* verbesserte 3D Unterst&#252;tzung
* N-dimensionaler r&#228;umlicher Index
* neue 3D Typen TIN und PolyHedralSurface
* viele tolle neue Funktionen
** ST_Split 
** ST_Snap 
** Datenbereinigung: ST_IsValidDetail, ST_MakeValid, ST_RemoveRepeatedPoints 
* KNN Gist Index (K Nearest Neighbor Index) f&#252;r schnellere Distanzabfragen mit Limit
* der Shapefile Loader kann nun mehrere Shape-Dateien laden
</abstract>
        <description></description>
        <persons>
          <person id="65">Astrid Emde</person>
        </persons>
        <links>
          <link href="http://www.fossgis.de/w/images/2/2c/PostGIS_2.0_Emde_FOSSGIS_2012.pdf">PostGIS - Was bringt die neue Version? (Vortragsfolien)</link>
          <link href="http://postgis.org">http://postgis.org</link>
          <link href="http://trac.osgeo.org/postgis/milestone/PostGIS%202.0.0">Milestone PostGIS 2.0</link>
          <link href="http://postgis.org/documentation/manual-svn/release_notes.html#id2900644">Dokumentation Release 2.0</link>
          <link href="http://postgis.org/documentation/manual-svn/PostGIS_Special_Functions_Index.html#NewFunctions_2_0">Neu in PostGIS 2.0</link>
          <link href="http://db0smg.afug.uni-goettingen.de/~fossgis/FOSSGIS2012-337-de-PostGIS%202.0%20-%20Was%20bringt%20die%20neue%20Version%3f.mp4">Video Vortrag (mp4)</link>
        </links>
      </event>
      <event id="385">
        <start>13:30</start>
        <duration>00:30</duration>
        <room>H&#246;rsaal 08</room>
        <slug></slug>
        <title>Neues vom QGIS Server und -Webclient</title>
        <subtitle></subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract>Letztes Jahr haben wir an der FOSSGIS Konferenz gezeigt, wie man problemlos Webkarten mit dem QGIS Server und -Webclient publiziert. Seither sind noch mehr Funktionen dazugekommen, die &#252;ber den WMS Standard hinausgehen.
H&#228;ufige Funktionen bei Webkarten sind Objektsuche nach Attributen sowie das Highlighten der Resultate. Bisher kommt man nicht umhin, daf&#252;r neben dem eigentlichen WMS noch weitere Serverkomponenten zu installieren und zu konfigurieren. 
W&#228;hrend dem letzten Jahr wurden daher in QGIS Server Erweiterungen entwickelt, die es erlauben, Suche und Selektion mit dem WMS Server zu machen. So kann die GetFeatureInfo Anfrage ohne Klickkoordinate und mit FILTER-Parameter gemacht werden, worauf der QGIS Server Attributinformationen der passenden Objekte sowie deren Boundingboxen zur&#252;ckschickt. Die so erhaltenen Objekte k&#246;nnen dann in einer GetMap Anfrage mit dem neuen Parameter SELECTION markiert werden. Der QGIS webclient unterst&#252;tzt diese Art der Suche bereits und kann mit minimalem Aufwand konfiguriert werden.

Ein weiterer Schwerpunkt dieses Vortrags ist das Publizieren von Geodaten und Karten &#252;ber die QGIS cloud.</abstract>
        <description></description>
        <persons>
          <person id="151">Marco Hugentobler</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="460">
        <start>14:00</start>
        <duration>00:30</duration>
        <room>H&#246;rsaal 08</room>
        <slug></slug>
        <title>TinyOWS - der schlanke WFS Server</title>
        <subtitle>WFS-T mit PostGIS als Backend</subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract>TinyOWS ist ein hochperformanter, leichtgewichtiger und einfach einzurichtender Transaktionaler Web Feature Service (WFS-T). Betrieben wird er als CGI- oder FastCGI-Modul in einem Standards-Webserver mit PostGIS als Datenspeicher.

TinyOWS wird h&#228;ufig in Verbindung mit einem MapServer eingesetzt, um Daten &#252;ber WFS-T und schnelle WFS Dienste f&#252;r QGIS und/oder OpenLayers Clients bereitzustellen. Die Konfiguration kann dabei direkt &#252;ber das Mapfile erfolgen. TinyOWS ist produktiv in Organsiationen und Regierungsbeh&#246;rden weltweit im Einsatz. WFS 1.0 und WFS 1.1 sind standardkonform implementiert und alle OGC CITE Tests - ca. 1000 - wurden erfolgreich durchlaufen.
</abstract>
        <description></description>
        <persons>
          <person id="99">Pirmin Kalberer</person>
        </persons>
        <links>
          <link href="http://tinyows.org">http://tinyows.org</link>
          <link href="http://live.osgeo.org/de/overview/tinyows_overview.html">http://live.osgeo.org/de/overview/tinyows_overview.html</link>
        </links>
      </event>
      <event id="422">
        <start>14:30</start>
        <duration>00:30</duration>
        <room>H&#246;rsaal 08</room>
        <slug></slug>
        <title>MXD2map - ein freier Konverter von ArcGIS MXD-Dateien zu UMN MapServer</title>
        <subtitle>OGC-konforme Dienste auf Basis von UMN MapServer mit ArcGIS erstellen</subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>MXD2map - ein freier Konverter von ArcGIS MXD-Dateien zu UMN MapServer
Untertitel: OGC-konforme Dienste auf Basis von UMN MapServer mit ArcGIS erstellen

MXD2map ist ein freier Konverter zur Erzeugung von UMN MapServer Mapfiles aus
ESRI ArcGIS MXD-Dateien. Das Kartenlayouten und zusammenstellen geschieht
weiterhin in ArcGIS, eine Darstellung als WMS- und WFS-Service wird &#252;ber
den UMN MapServer realisiert. MXD2map bietet diese Funktionalit&#228;t als
Toolbox-Eintrag direkt aus ArcGIS heraus.

Durch die Nutzung der ArcGIS API wird ein Metaformat innerhalb des
Konverters erstellt, auf dessen Basis weitere beliebige Ausgabe-Formate (QGIS,
mapnik etc) ranimplementiert werden k&#246;nnten.

Der Vortrag gibt Einblicke in die Funktionalit&#228;ten, zeigt
Usecase-Szenarien sowie eine Roadmap der weiteren geplanten Funktionen und
l&#228;dt Interessierte zum Ausprobieren und mitmachen
ein. 

</abstract>
        <description>MXD2map - ein freier Konverter von ArcGIS MXD-Dateien zu UMN MapServer
Untertitel: OGC-konforme Dienste auf Basis von UMN MapServer mit ArcGIS erstellen

MXD2map ist ein freier Konverter zur Erzeugung von UMN MapServer Mapfiles aus
ESRI ArcGIS MXD-Dateien. Das Kartenlayouten und zusammenstellen geschieht
weiterhin in ArcGIS, eine Darstellung als WMS- und WFS-Service wird &#252;ber
den UMN MapServer realisiert. MXD2map bietet diese Funktionalit&#228;t als
Toolbox-Eintrag direkt aus ArcGIS heraus.

Durch die Nutzung der ArcGIS API wird ein Metaformat innerhalb des
Konverters erstellt, auf dessen Basis weitere beliebige Ausgabe-Formate (QGIS,
mapnik etc) ranimplementiert werden k&#246;nnten.

Der Vortrag gibt Einblicke in die Funktionalit&#228;ten, zeigt
Usecase-Szenarien sowie eine Roadmap der weiteren geplanten Funktionen und
l&#228;dt Interessierte zum Ausprobieren und mitmachen
ein. 

</description>
        <persons>
          <person id="46">Stephan Holl</person>
        </persons>
        <links>
          <link href="http://www.mxd2map.org">http://www.mxd2map.org</link>
        </links>
      </event>
      <event id="425">
        <start>15:30</start>
        <duration>00:30</duration>
        <room>H&#246;rsaal 08</room>
        <slug></slug>
        <title>Ein Geoportal f&#252;r Deutschland</title>
        <subtitle></subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Im Rahmen der Neuentwicklung des Geoportal.Bund werden u.a. die zentralen Geokomponenten Map &amp; MIS (Metadateninformationssystem) implementiert. Hierzu geh&#246;ren der Geodatenkatalog-DE als zentrale Datenhaltungskomponente und Suchoberfl&#228;che, Mapserverkomponenten, Komponenten zur Visualisierung und die Verzahnung der einzelnen Module zu einem INSPIRE- und GDI-konformen Geoportal. Integriert werden die Map &amp; MIS Module in die CMS-Applikation Government Site Builder (GSB). 

Ziel
Ziel des neuen Geoportals ist eine zentrale Informationsquelle &#252;ber den Geodatenbestand in Deutschland. Der Nutzer kann deutschlandweit nach Geodaten suchen und diese direkt im Portal nutzen und verkn&#252;pfen. 

Highlights
Zu den Highlights des Geoportals geh&#246;rt die Umsetzung der im Oktober 2011 von der GDI-DE festgelegten Konventionen zur Daten-Service-Kopplung. Hier erkennt der Nutzer im Suchergebnis, ob ein Geodatensatz &#252;ber einen Dienst beschrieben wird und kann diesen dann direkt in die Kartenanwendung laden. Au&#223;erdem ist eine nutzerfreundlche performante Suche mit Live-Suggest-Funktion f&#252;r die Recherche nach Geodaten und geographischen Orten implementiert. F&#252;r die Suche nach Geodaten wurde ein eigener anpassbarer Index &#252;ber Solr entwickelt. 

Ein weiteres Highlight ist die Ermittlung der Beliebtheit von im Geoportal ver&#246;ffentlichten Themenkarten (Karte des Monats) und Suchanfragen. 

Mapbender3
Alle Geokomponenten werden mit dem neuen Mapbender3 umgesetzt. Hierbei kommen Symfony2, MapQuery, JQuery und OpenLayers zum Einsatz. F&#252;r alle, die das Mapbender-Projekt verfolgen, ist dies die erste Mapbender3 Referenzentwicklung f&#252;r ein Geoportal und zeigt auf, in welche Richtung sich Mapbender3 entwickelt.</abstract>
        <description></description>
        <persons>
          <person id="70">Olaf Knopp</person>
        </persons>
        <links>
          <link href="http://geoportal.de">Link zum Geoportal.DE</link>
          <link href="http://www.fossgis.de/w/images/a/a1/Geoportal-de_FOSSGIS_2012_knopp.pdf">Vortragsfolien</link>
          <link href="http://db0smg.afug.uni-goettingen.de/~fossgis/FOSSGIS2012-425-de-Ein%20Geoportal%20f%c3%bcr%20Deutschland.mp4">Videoaunahme des Vortrags</link>
        </links>
      </event>
      <event id="356">
        <start>16:00</start>
        <duration>00:30</duration>
        <room>H&#246;rsaal 08</room>
        <slug></slug>
        <title>Geoportal DACH+</title>
        <subtitle>Relaunch mit Drupal, OpenLayers + GeoExt</subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract>Siehe Anhang</abstract>
        <description></description>
        <persons>
          <person id="38">David Arndt</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="352">
        <start>16:30</start>
        <duration>00:30</duration>
        <room>H&#246;rsaal 08</room>
        <slug></slug>
        <title>Wie wird die Karte sichtbar f&#252;r die Suchmaschinen?</title>
        <subtitle>Eine Symbiose aus WebMapping und CMS</subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Titel der Veranstaltung: Wie wird das GIS sichtbar f&#252;r die Suchmaschinen?
Untertitel der Veranstaltung: Eine Symbiose von WebMapping und Content-Management-System(CMS)
</abstract>
        <description>Der Vortrag skizziert die Konzeption, die technische Umsetzung sowie das Ergebnis einer Symbiose von WebMapping und CMS.

Technische Komponenten u.a.: PostgreSQL mit PostGIS, MapServer, MapFish, Typo 3
Onlineressourcen: www.regiofreizeit.de, www.chemieatlas.de, www.energieatlas.org

Ausgangslage: Die Inhalte der WebMapping Angebote (des Kreises Recklinghausen) waren f&#252;r die Suchmaschinen nicht lesbar, da die &#8222;Karten&#8220; nicht indizierbar sind. Als Folge ergab sich eine schlechte Platzierung in den Suchmaschinen. Die Inhalte (der Datenbank) wurden f&#252;r die Nutzer erst ersichtlich, nachdem in der Kartenanwendung das Infofenster aktiviert wurde. Eine umst&#228;ndliche Vorgehensweise, wenn bestimmte Informationen gesucht und eine Lokalisierung in der Karte zun&#228;chst zweitrangig ist.

Fragestellung: Wie kann der &#8222;Karten&#8220;-Content aus der Datenbank (hier PostgesSQL) so aufbereitet werden, dass er indizierbar f&#252;r die Suchmaschinen wird? Wie k&#246;nnen die Informationen medial so bereitgestellt werden, dass sie &#252;bersichtlicher und intuitiver auffindbar f&#252;r die Nutzer sind? Wie k&#246;nnen die Nutzerzugriffe gesteigert werden? Wie k&#246;nnen &#8222;normale&#8220; Nutzer auch ohne Expertenwissen f&#252;r die Pflege der Anwendung bef&#228;higt werden?

L&#246;sungsansatz: Trennung von Kartenanwendung und erweiterten Informationen, durch eine Symbiose von WebMapping und CMS. Die Inhalte der r&#228;umlichen Datenbank wurden in das Open-Source CMS - Typo3 integriert und dort durch (fast) frei gestaltbare Inhalte angereichert.

Ergebnis: Die Webseiten wurden von Grund auf neu gestaltet und der Datenbankinhalt &#252;ber das CMS in &#252;bersichtlicherer Form dargestellt. Die Auffindbarkeit &#252;ber die Suchmaschinen wurde deutlich verbessert, die Zugriffszahlen mehr als verdoppelt. Die Mechanismen der Abfrage wurden vereinfacht, gleichzeitig konnte die Individualit&#228;t der einzelnen Anwendungen aufrecht erhalten werden.

Im Anschluss an den Vortrag wird die M&#246;glichkeit geboten mit allen Interessierten, z.B. anderen (kommunalen) WebMapping-Anbietern L&#246;sungsans&#228;tze zu finden f&#252;r die Fragen:
+	Suchmaschinenoptimierung f&#252;r WebMapping-Angebote
+	Marketing trotz knapper Finanzmittel
+	Verkauf &amp; Einbindung von Werbepl&#228;tzen (z.B. in die WebGis-Portale)

Alle die sich daran beteiligen m&#246;chten und Ideen oder bereits Erfahrungen in diesem Themenfeld haben, sind hierzu herzlich eingeladen. Gerne kann im Vorfeld der Veranstaltung Kontakt mit den Autoren aufgenommen werden.

Autoren: Anja Sigesmund, Christoph Lauber

Kontakt zu den Autoren:
Anja Sigesmund
Kreisverwaltung Recklinghausen, FD 18.3
Regionale und r&#228;umliche Informationssysteme
Kurt-Schumacher-Allee 1
45657 Recklinghausen
Tel.: (02361) 534500
E-Mail: as@kreis-re.de

Christoph Lauber
virtual value
In der Hohl 7
35043 Marburg
(06421) 9683490
(0157) 71432425
E-Mail: c.lauber@virtual-value.de

</description>
        <persons>
          <person id="48">Anja Sigesmund</person>
        </persons>
        <links>
          <link href="http://www.regiofreizeit.de">Anwendungsbeispiel das Freizeitportal im Kreis Recklinghausen</link>
          <link href="http://www.chemieatlas.de">Anwendungsbeispiel 2 - Der Chemieatlas NRW</link>
          <link href="http://www.energieatlas.org">Anwendungsbeispiel 3 - Der Energieatlas</link>
        </links>
      </event>
      <event id="475">
        <start>17:00</start>
        <duration>01:00</duration>
        <room>H&#246;rsaal 08</room>
        <slug></slug>
        <title>Suchmaschinenoptimierung f&#252;r WebMapping-Angebote, Marketing trotz knapper Finanzmittel</title>
        <subtitle></subtitle>
        <track>BoFs</track>
        <type>community_session</type>
        <language>de</language>
        <abstract>Suchmaschinenoptimierung f&#252;r WebMapping-Angebote
Marketing trotz knapper Finanzmittel
Verkauf &amp; Einbindung von Werbepl&#228;tzen (z.B. in die WebGis-Portale)</abstract>
        <description></description>
        <persons>
        </persons>
        <links>
        </links>
      </event>
    </room>
    <room name="H&#246;rsaal 04/114">
      <event id="361">
        <start>09:00</start>
        <duration>00:30</duration>
        <room>H&#246;rsaal 04/114</room>
        <slug></slug>
        <title>HTML5-Editor f&#252;r OpenStreetMap</title>
        <subtitle></subtitle>
        <track>Vorträge (OSM)</track>
        <type>lecture</type>
        <language></language>
        <abstract>Der Markt f&#252;r OSM-Editoren scheint recht gut abgedeckt: Potlatch bietet ein schl&#252;ssiges Bedienkonzept, JOSM besticht als Offline-Editor mit vielen Funktionen und Merkaartor findet als native Anwendung seine Anh&#228;nger. Dazu kommen Apps f&#252;r mobile Ger&#228;te. Eine Nische, die es noch auszuf&#252;llen gilt, ist ein Editor, der ohne Java und Flash als JavaScript Anwendung im Browser funktioniert. 

F&#252;r einen reinen HTML-Editor sind Webtechniken wie das Canvas-Element (zur Erzeugung dynamischer Grafiken) und SVG (Skalierbare Vektor-Grafik) entscheidende Voraussetzungen. Ein Problem war bisher die mangelnde Unterst&#252;tzung durch einzelne Browser-Hersteller, aber Besserung ist in Sicht, da die aktuellen Versionen der verbreitetsten Browser mittlerweile die ben&#246;tigten Funktionen bereitstellen.

In diesem Vortrag m&#246;chte ich einen Prototyp vorstellen, der sich im fr&#252;hen Entwicklungsstadium befindet, aber bereits die prinzipielle Machbarkeit beweist. Unter anderem ist der komplette Editier-Zyklus implementiert: Daten lassen sich vom OSM-Server Herunterladen, Rendern, Bearbeiten und wieder Hochladen. Technisch basiert dieser Ansatz wesentlich auf diversen bestehenden Projekten: Teile des JOSM-Quelltexts werden mit Hilfe des Google Web Toolkits nach JavaScript &#252;bersetzt und mit einer HTML/JavaScript Benutzeroberfl&#228;che angesteuert. F&#252;r die Anzeige von Luftbildern im Hintergrund kommt OpenLayers zum Einsatz.
</abstract>
        <description></description>
        <persons>
          <person id="252">Paul-Fiete Hartmann</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="331">
        <start>09:30</start>
        <duration>00:30</duration>
        <room>H&#246;rsaal 04/114</room>
        <slug></slug>
        <title>Video-Mapping</title>
        <subtitle>Des Mappens letzter Schluss?</subtitle>
        <track>Vorträge (OSM)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Das Erfassen von Geodaten ist einer der wichtigsten Arbeitsschritte im Workflow von OSM. Bisherige Verfahren nutzen normales Equipment um Aufzeichnungen unterwegs anzufertigen. Jeder, der jedoch schon einmal mit Zettel+Stift, Digitalkamera oder Diktierger&#228;t Notizen angefertigt hat, kennt jedoch die Nachteile bei der Auswertung:
-unklare Aufzeichnungen (schlechte Schrift, ist die gesprochene "M&#252;llerallee" nicht die "M&#252;hlenallee" gewesen)
-wenige Details (gerade beim Diktieren)
-keine durchgehende Aufzeichnungen (etwa bei einzelnen Fotos)

Diese Probleme k&#246;nnen teilweise durch die Nutzung von Videoaufzeichnungen gel&#246;st werden. Der Autor machte dazu verschiedene Untersuchungen w&#228;hrend seiner Bachelor Arbeit im letzten Jahr. Au&#223;erdem wurde daf&#252;r eine Erweiterung f&#252;r JOSM entwickelt, der den Workflow optimiert. Eine Zusammenfassung der Untersuchungen und eine Vorstellung f&#252;r die Community erfolgt in diesem Vortrag.</abstract>
        <description></description>
        <persons>
          <person id="230">Matthias Mei&#223;er</person>
        </persons>
        <links>
          <link href="http://wiki.openstreetmap.org/wiki/Video_mapping">http://wiki.openstreetmap.org/wiki/Video_mapping</link>
          <link href="http://wiki.openstreetmap.org/wiki/JOSM/Plugins/VideoMapping">http://wiki.openstreetmap.org/wiki/JOSM/Plugins/VideoMapping</link>
          <link href="http://wiki.openstreetmap.org/wiki/Mapping_techniques">http://wiki.openstreetmap.org/wiki/Mapping_techniques</link>
        </links>
      </event>
      <event id="375">
        <start>10:00</start>
        <duration>00:30</duration>
        <room>H&#246;rsaal 04/114</room>
        <slug></slug>
        <title>Geocoding mit OpenStreetMap</title>
        <subtitle></subtitle>
        <track>Vorträge (OSM)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Eine funktionierende Adresssuche (Geocoding) ist ein wichtiger Bestandteil f&#252;r eine benutzerfreundliche Kartenanwendung. Kommerzielle Kartenanbieter wie Google oder Microsoft bieten hierf&#252;r kostenlose APIs an. Eine Verwendung dieser Such-APIs mit eigenen Karten oder im kommerziellen Umfeld ist allerdings durch die Nutzungsbedingungen dieser Dienste nur eingeschr&#228;nkt m&#246;glich.

F&#252;r eigene Geocoding-Dienste bieten sich als Grundlage die freien OpenStreetMap-Daten an. Auf der Softwareseite gibt es das freie Nominatim, dass jedoch durch hohen Ressourcenverbrauch f&#252;r kleine Anwendungen umst&#228;ndlich in der Installation ist.

Der Vortrag stellt eine neue Alternative f&#252;r Geocoding mit OpenStreetMap vor. Es wird gezeigt, wie aufbauend auf dem OpenStreetMap-Konvertierer Imposm, in Geodaten gesucht werden kann. Der Ansatz wird mit Nominatim verglichen und die Schwerpunkte (Installation und Anpassbarkeit) erl&#228;utert.</abstract>
        <description></description>
        <persons>
          <person id="259">Marcel Radischat</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="406">
        <start>11:00</start>
        <duration>00:30</duration>
        <room>H&#246;rsaal 04/114</room>
        <slug></slug>
        <title>Synchronisation zwischen OpenAddresses und OpenStreetMap</title>
        <subtitle></subtitle>
        <track>Vorträge (OSM)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>OpenAddresses (OA) ist seit 2007 als Projekt im Bereich Volunteered Geographic Information (VGI) zur strukturierten Sammlung von geokodierten Adressen im Betrieb. Nach einem gr&#246;sseren Umbau im Jahr 2010 wurde nun gezielt die Synchronisation der Adressdaten mit OpenStreetMap in Angriff genommen. 
Der Beitrag zeigt, wie das Konzept f&#252;r eine zeitnahe Synchronisation zwischen den beiden Projekten aussieht. W&#228;hrend bisher OA und OSM zwei getrennte Daten-Repositories pflegten, sollen in Zukunft diese m&#246;glichst synchron gehalten werden (was die Adressdaten betrifft). Damit kommt OA mehr die Rolle eines einfach und leicht zu bedienenden Adress-Editors zu, w&#228;hrend die Master-Datenbank quasi in OSM zu finden ist. Nebst der einfachen Nutzeroberfl&#228;che, fokussiert sich OA des Weiteren dezidiert auf Geokodierungsdienste, welche &#252;ber das Web kostenlos bezogen werden k&#246;nnen. 
Damit soll das Beste der beiden Projekte zu einer Synergie zusammengef&#252;gt werden: die Bekanntheit und globale Datenhaltung von OSM mit der Schlankheit und einfachen Bedienung einschliesslich guter Services von OA.</abstract>
        <description></description>
        <persons>
          <person id="130">Hans-J&#246;rg Stark</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="414">
        <start>11:30</start>
        <duration>00:30</duration>
        <room>H&#246;rsaal 04/114</room>
        <slug></slug>
        <title>JOSM</title>
        <subtitle>Der Java OpenStreetMap Editor</subtitle>
        <track>Vorträge (OSM)</track>
        <type>lecture</type>
        <language></language>
        <abstract></abstract>
        <description>(Nicht automatisierte) Bearbeitungen werden in OpenStreetMap typischerweise mit einem Editor durchgef&#252;hrt. Diese Programme sind auf den Umgang mit OSM-bezogenen Geodaten spezialisiert und bieten eine Vielzahl von Funktionen aus dem OSM-Workflow: Laden von GPS-Tracks, Anzeigen von Hintergrundbildern, Download von Ausschnitten der OSM-Datenbank, Bearbeiten der Daten, Vergeben von Attributen, Hochladen der &#196;nderungen, Umgang mit Bearbeitungskonflikten, &#8230;
JOSM ist ein in Java entwickelter Offline-Editor, der (von Anfang an) auf erfahrene Nutzer abzielt. Derzeit wird das Projekt von Dirk St&#246;cker geleitet; urspr&#252;nglich wurde JOSM von Immanuel Scholz programmiert.

In diesem Vortrag wird auf die aktuelle Entwicklung von JOSM eingegangen. Neben dem Entwicklungskonzept wird auf relevante Funktionen/Neuerungen eingegangen. Anhand von einfachen Beispielen soll gezeigt werden, wie zus&#228;tzliche Features im Bezug auf die Validation von Daten, Tagging-Vorlagen und Styles umgesetzt werden k&#246;nnen.</description>
        <persons>
          <person id="279">Simon Legner</person>
        </persons>
        <links>
          <link href="http://josm.openstreetmap.de/">JOSM-Webseite</link>
          <link href="http://osm.simon04.net/josm.pdf">Vortragsfolien</link>
        </links>
      </event>
      <event id="462">
        <start>12:00</start>
        <duration>00:30</duration>
        <room>H&#246;rsaal 04/114</room>
        <slug></slug>
        <title>Nutzung amtlicher Geodaten - aktueller Stand</title>
        <subtitle></subtitle>
        <track>Vorträge (OSM)</track>
        <type>lecture</type>
        <language></language>
        <abstract>Nutzung amtlicher Geodaten - aktueller Stand
- Entwicklung der Kontakte zu Verwaltung und Regierung
- Welche amtlichen Daten k&#246;nnen bereits f&#252;r OSM genutzt werden
- Welche amtlichen Daten ben&#246;tigt OSM und in welcher Form
- Amtliche Daten bei Google Maps
- Stra&#223;ensondernutzungssatzung der Bundesstadt Bonn
</abstract>
        <description></description>
        <persons>
          <person id="217">Joachim Kast</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="467">
        <start>13:30</start>
        <duration>00:30</duration>
        <room>H&#246;rsaal 04/114</room>
        <slug></slug>
        <title>Lightning Talks I</title>
        <subtitle></subtitle>
        <track>Lightning Talks (OSM)</track>
        <type>lightning</type>
        <language></language>
        <abstract></abstract>
        <description></description>
        <persons>
        </persons>
        <links>
        </links>
      </event>
      <event id="445">
        <start>14:00</start>
        <duration>00:30</duration>
        <room>H&#246;rsaal 04/114</room>
        <slug></slug>
        <title>Am Puls der Zeit</title>
        <subtitle>Min&#252;tliche Daten-Updates bei OpenStreetMap</subtitle>
        <track>Vorträge (OSM)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Einmal pro Minute ver&#246;ffentlicht OpenStreetMap eine Datei mit den aktuellsten &#196;nderungen. Wer in der Lage ist, diese Dateien zu verarbeiten, der spart sich st&#228;ndige Neuimporte gro&#223;er Datenmengen und kann seinen Nutzern brandaktuelle Karten anbieten - aber wie geht das? Was steckt drin in so einem "Diff", was kann man damit machen und was nicht, und welche Software braucht man daf&#252;r? Dieser Vortrag erl&#228;utert die Funktionsweise des OSM-Diff-Mechanismus und zeigt Nutzen und Grenzen der min&#252;tlichen Aktualisierung auf.</abstract>
        <description></description>
        <persons>
          <person id="95">Frederik Ramm</person>
        </persons>
        <links>
          <link href="http://www.geofabrik.de/media/2012-03-21-fossgis-pulsderzeit.pdf">Folien als PDF</link>
          <link href="http://">http://</link>
        </links>
      </event>
      <event id="340">
        <start>14:30</start>
        <duration>00:30</duration>
        <room>H&#246;rsaal 04/114</room>
        <slug></slug>
        <title>History-Informationen in der OSM Datenbank, Reloaded</title>
        <subtitle>Ein technischer &#220;berblick &#252;ber die M&#246;glichkeiten und Probleme bei der Auswertung der History-Informationen -- und was sich im letzten Jahr getan hat</subtitle>
        <track>Vorträge (OSM)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Jede &#196;nderung an jedem Objekt wird gespeichert und ist &#246;ffentlich. Doch wie kommt man an diese Daten heran? Welche Quellen gibt es und wof&#252;r sind sie geeignet? Welche Probleme ergeben sich beim Auswerten dieser Informationen und wie kann man diese &#252;berwinden? Welche tollen und n&#252;tzlichen Anwendungen lassen sich mit diesen Daten bauen und wie k&#246;nnen solche Daten der Community helfen?</abstract>
        <description>Nach einer knappen Einf&#252;hrung in das Thema wird zun&#228;chst ein &#220;berblick &#252;ber die M&#246;glichkeiten gegeben, die durch eine Auswertung der History-Informationen entstehen. Dabei werden m&#246;gliche Anwendungen, statistische Auswertungen und wissenschaftliche Betrachtungen gegeben. Daran schlie&#223;t sich ein Exkurs &#252;ber m&#246;gliche Datenquellen, deren Formate sowie Vor- und Nachteile an. Hierbei wird insbesondere auf die neuen M&#246;glichkeiten im Vergleich zum letzten Jahr sowie die Tools, mit welchen diese neuen Datenquellen gespeist werden (z.B. History-Render) Bezug genommen. Weiterf&#252;hrend wird &#252;ber die notwendige Struktur einer History-Datenbank gesprochen, wobei konkret auf die Algorithmen zur Berechnung von Minor-Versionen und G&#252;ltigkeitsperioden sowie auf die konkrete Abbildung in PostgreSQL mit einem kombinierten Geometrie/Zeit-Index. Als Referenz-Implementierung wird auf den History-Importer und den angeschlossenen Rendering-Prozess hingewiesen. Hierbei werden auch Beispiel-Renderings pr&#228;sentiert.

Nach dem Vortrag stehe ich f&#252;r fachliche Diskussionen, Test-Renderings vom eigenen Heimatdorf sowie zum Datei-Austausch von History-Extrakten und -Dumps zur Verf&#252;gung.</description>
        <persons>
          <person id="109">Peter K&#246;rner</person>
        </persons>
        <links>
          <link href="https://github.com/MaZderMind/osm-history-renderer/blob/master/TUTORIAL.md">OpenStreetMap History Renderer Tutorial</link>
          <link href="http://mazdermind.github.com/osm-history-renderer/karlsruhe.html">Beispiel History-Animation von Karlsruhe</link>
          <link href="http://ftp5.gwdg.de/pub/misc/openstreetmap/osm-full-history-extracts/110919/pbf/">History-Extrakte im XML und PBF-Formar</link>
          <link href="http://odbl.poole.ch/extracts/">Andere History-Extrakte im XML-Format</link>
          <link href="http://www.openstreetmap.org/browse/way/32552464/history">OSM Historie (Beispiel)</link>
          <link href="http://osmhv.openstreetmap.de/">OSM History Viewer</link>
          <link href="http://osm.virtuelle-loipe.de/history/">OSM History Browser</link>
          <link href="http://wiki.openstreetmap.org/wiki/JOSM/Plugins/Reverter">JOSM Reverter</link>
          <link href="https://github.com/MaZderMind/osm-history-splitter">OpenStreetMap History Splitter</link>
          <link href="https://github.com/MaZderMind/osm-history-renderer">OpenStreetMap History Renderer &amp; Tools</link>
          <link href="http://osm.personalwerk.de/history-extracts/120213/">Aktuelle (Februar) History-Extrakte</link>
          <link href="http://osm.personalwerk.de/full-experimental-pbf/">Full-Planet-Full-Histroy-Dump im PBF-Format</link>
        </links>
      </event>
      <event id="398">
        <start>15:30</start>
        <duration>00:30</duration>
        <room>H&#246;rsaal 04/114</room>
        <slug></slug>
        <title>Das Osmium-Framework</title>
        <subtitle></subtitle>
        <track>Vorträge (OSM)</track>
        <type>lecture</type>
        <language></language>
        <abstract>Osmium ist eine performante und flexible C++- und Javascript-Bibliothek f&#252;r die Arbeit mit OSM-Daten. Osmium kann OSM-Dateien (XML- und PBF-Format) lesen und schreiben, Geometrien aus OSM-Objekten zusammensetzen (Linestrings aus Ways, Multipolygone aus Relations, usw.), OSMChange-Dateien anwenden, OSM-Objekte und Node-Geometrien zwischenspeichern, OSM-Daten in Shapefiles und viele OGR-Formate wandeln und vieles mehr. Osmium kann sowohl "normale" OSM-Daten als auch OSM-History-Daten verarbeiten.

Seine volle Funktionalit&#228;t stellt Osmium unter C++ zur Verf&#252;gung. Dank der eingebundenen Google V8 Javascript-Engine ist es aber auch m&#246;glich, ganz ohne C++-Kenntnisse nur mit Javascript viele seiner F&#228;higkeiten zu nutzen.

Dieser Vortrag stellt Osmium und das Tool osmjs vor und erkl&#228;rt, wie man die Funktionalit&#228;t in C++ und Javascript nutzen und erweitern kann.

Osmium ist Open Source. Weitere Informationen gibt es unter http://wiki.openstreetmap.org/wiki/Osmium .
</abstract>
        <description></description>
        <persons>
          <person id="2">Jochen Topf</person>
        </persons>
        <links>
          <link href="http://wiki.openstreetmap.org/wiki/Osmium">Osmium</link>
        </links>
      </event>
      <event id="418">
        <start>16:00</start>
        <duration>00:30</duration>
        <room>H&#246;rsaal 04/114</room>
        <slug></slug>
        <title>Overpass API</title>
        <subtitle></subtitle>
        <track>Vorträge (OSM)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Es wird Overpass API vorgestellt: Dieses erm&#246;glicht, ad hoc und minutenaktuell Ausz&#252;ge aus den OpenStreetMap-Daten &#252;ber das Web zu beziehen. Beispielsweise nutzt die Slippy Map http://mappa-mercia.org/novam/ Overpass API, um Bushaltestellen anzuzeigen. Im Gegensatz zu einer vollwertigen Datenbank hat Overpass API nahezu keine Installationsanforderungen, l&#228;uft ohne Root-Rechte und ist auf Robustheit und Skalierbarkeit ausgelegt. Zun&#228;chst arbeiten wir heraus, wie in einigen beispielhaften Einsatzzwecken Overpass API mit verschiedenen anderen Werkzeugen zusammenspielt. Dann folgen Beispiele f&#252;r den konkreten Einsatz. Abgerundet wird der Vortrag mit einem &#220;berblick &#252;ber die angestrebten Ziele zur Weiterentwicklung.
</abstract>
        <description>Overpass API erm&#246;glicht Abfragen der weltweiten OpenStreetMap-Daten in einer spezialisierten Abfragesprache. Beispielsweise l&#228;sst sich auf diesem Weg eine thematische Slippy Map mit stets minutenaktuellen Daten ausstatten. Ein anderer Anwendungszweck ist es, Liniendiagramme aus den in OSM gespeicherten &#214;PNV-Daten vollautomatisch zu erstellen. Ebenfalls Verwendung gefunden hat Overpass API beim nur selektiven Laden eines Datenausschnitts in JOSM. Aus dem Ziel, f&#252;r diese Szenarien attraktive Reaktionszeiten zu erm&#246;glichen, ergibt sich sofort das Ziel, den Server leicht skalieren zu k&#246;nnen. Wegen der Natur als Spiegel bedeutet dies auch, potentiellen Nutzern das Installieren einer eigenen Instanz m&#246;glichst zu vereinfachen: dazu steht Overpass API unter GPL und l&#228;sst sich mit "make install" installieren.

Wir zeigen anhand der beiden ersten Szenarien zun&#228;chst die Entwicklungsziele f&#252;r JOSM auf, dann f&#252;hren wir anhand konkreter Beispiele f&#252;r die beiden obigen Szenarien in die Benutzung ein. Es folgt ein &#220;berblick &#252;ber die interne Struktur, die Geschichte des Projekts und seine erwartete Entwicklung.
</description>
        <persons>
          <person id="280">Roland Olbricht</person>
        </persons>
        <links>
          <link href="http://wiki.openstreetmap.org/wiki/Overpass_API">http://wiki.openstreetmap.org/wiki/Overpass_API</link>
        </links>
      </event>
      <event id="363">
        <start>16:30</start>
        <duration>00:30</duration>
        <room>H&#246;rsaal 04/114</room>
        <slug></slug>
        <title>OpenStreetMap und R</title>
        <subtitle>Integration freier Geodaten in die Lingua franca der Statistik</subtitle>
        <track>Vorträge (OSM)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Dieser Vortrag stellt eine Schnittstelle zwischen der freien Statistiksoftware R und der OpenStreetMap-Datenbank vor. Das R Add-On Paket "osmar" erm&#246;glicht einen einfachen Zugriff auf OSM-Daten aus verschiedenen Quellen, ein -- f&#252;r den R-Benutzer -- gewohntes Arbeiten mit diesen Daten und das Konvertieren der OSM-Daten in Objekte anderer R Add-On Pakete.</abstract>
        <description>Das freie Projekt R hat sich in den letzten Jahren zu einer ernstzunehmenden Softwareumgebung in der akademischen Statistik entwickelt. Durch die M&#246;glichkeit Add-On Pakete zu schreiben, bietet R inzwischen einen gewaltigen Funktionsumfang in allen m&#246;glichen Teilbereichen der Statistik und Datenanalyse. Die Verkn&#252;pfung eigener Daten mit Geodaten stellt in vielen F&#228;llen eine Bereicherung der Analyse dar. Und auch durch die statistische Auswertung der Geodaten ansich,  k&#246;nnen sich spannende Analysen und neue Erkenntnisse ergeben. Aus diesem Grund, bietet das Add-On Paket "osmar" eine Integration der OpenStreetMap-Daten in das R-Projekt an.

Dieser Vortrag gibt eine kurze allgemeine Einf&#252;hrung in das R-Projekt und stellt dann das Add-On Paket "osmar" vor. Anhand von Beispielanwendung werden die drei Kernpunkte des Paketes dargestellt: (1) Der Zugrif auf OSM-Daten aus unterschiedlichen Quellen (API v0.6 und Planet files). (2) Das einfache Arbeiten mit diesen Daten in gewohnter R Manier; d.h., das Begutachten, Zusammenfassen und Visualisieren, sowie das Suchen und Bilden von Teildatens&#228;tzen. (3) Das Konvertieren der OSM-Daten in Objekte anderer Add-On Pakete; zum Beispiel in die Pakete "sp" und "igraph", welche Strukturen und Analysemethoden f&#252;r r&#228;umliche Daten bzw. Graphen bereitstellen.</description>
        <persons>
          <person id="245">Thomas Schlesinger</person>
        </persons>
        <links>
          <link href="http://www.r-project.org/">The R Project for Statistical Computing</link>
          <link href="http://cran.r-project.org/web/packages/osmar/">osmar-add-on</link>
          <link href="http://osmar.r-forge.r-project.org/">OpenStreetMap and R</link>
        </links>
      </event>
      <event id="469">
        <start>17:15</start>
        <duration>00:30</duration>
        <room>H&#246;rsaal 04/114</room>
        <slug></slug>
        <title>OSM Quiz 2012</title>
        <subtitle></subtitle>
        <track>Allgemeines</track>
        <type></type>
        <language></language>
        <abstract></abstract>
        <description></description>
        <persons>
        </persons>
        <links>
        </links>
      </event>
      <event id="395">
        <start>18:00</start>
        <duration>00:45</duration>
        <room>H&#246;rsaal 04/114</room>
        <slug></slug>
        <title>OSMF local chapter</title>
        <subtitle>Was wollen wir ?</subtitle>
        <track>Community Sessions</track>
        <type>community_session</type>
        <language>de</language>
        <abstract></abstract>
        <description></description>
        <persons>
        </persons>
        <links>
        </links>
      </event>
    </room>
    <room name="H&#246;rsaal 04/113">
      <event id="383">
        <start>09:00</start>
        <duration>00:30</duration>
        <room>H&#246;rsaal 04/113</room>
        <slug></slug>
        <title>MapFish</title>
        <subtitle>Ein OSGeo WebGIS 2.0 Framework</subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>MapFish ist ein Framework, welches die Bildung von individuell gestalteten und erweiterbaren Web-GIS Anwendungen vereinfacht.

MapFish ist so gestaltet, dass es einfach zu benutzen ist, entweder als selbst&#228;ndige Anwendung oder als Bestandteil einer bestehenden Webseite.
Als selbst&#228;ndige Anwendung ist MapFish via einige Parameter konfigurierbar und bietet schnell ein funktionales Web-GIS. MapFish kann auch in bestehenden Webseiten wie CMS oder Informations System orientierte Anwendungen ohne Aufwand integriert werden.

Der Client Teil erm&#246;glicht es via OpenLayers2, ExtJS3 und GeoExt4, weiterf&#252;hrende WEB2.0 Funktionalit&#228;ten einzubauen.

Der Server Teil stellt in verschiedene Programmiersprachen flexible Prozesse zur Verf&#252;gung (Routing, Suchmaschine, thematische Kartografie, usw).</abstract>
        <description></description>
        <persons>
          <person id="263">ebelo</person>
        </persons>
        <links>
          <link href="http://www.mapfish.org">http://www.mapfish.org</link>
          <link href="http://">http://</link>
        </links>
      </event>
      <event id="400">
        <start>09:30</start>
        <duration>00:30</duration>
        <room>H&#246;rsaal 04/113</room>
        <slug></slug>
        <title>Mapbender3</title>
        <subtitle>Neues aus dem Mapbender-Projekt</subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract>NAch sieben Jahren hat das Mapbender-Team den Neustart gewagt und eine neue Version, Mapbender3 angefangen. Basierend auf dem aktuellen Symfony2 Framework haben wir eine moderne Webanwendung geschaffen, die durch das Baukastensystem der Bundles von Symfony2 einzeln als auch in andere Anwendungen integriert Verwendung finden kann.

Als moderne Web-Application basiert Mapbender3 auf den Javascript-Bibliotheken jQuery, jQuery UI, OpenLayers und MapQuery als Br&#252;cke zwischen der OpenLayers- und jQuery-Welt. Zusammen mit einem modernen Verwaltungsbackend f&#252;r die Kartenanwendungen ist Mapbender3 ein komfortables Werkzeug f&#252;r die Erstellung und Pflege von Kartenanwendungen.

Bereits heute haben Kunden, die gemeinsam mit der Wheregroup die Entwicklung von Mapbender3 aktiv begleitet haben, diesen im Einsatz.

Mit diesem Vortrag m&#246;chten wir die Neuerungen in Architektur und Verwendung von Mapbender3 vorstellen. Neben aktuellen Verwendungsm&#246;glichkeiten soll auch ein Ausblick auf m&#246;gliche Eins&#228;tze von Morgen wie Verwaltung von mobilen Webanwendungen Ausblick gegeben werden.</abstract>
        <description></description>
        <persons>
          <person id="268">Christian Wygoda</person>
        </persons>
        <links>
          <link href="http://svn.osgeo.org/mapbender/trunk/documents/presentations/FOSSGIS2012/mapbender3_vortrag_fossgis2012.pdf">Vortragsfolien</link>
          <link href="http://mapbender3.org">http://mapbender3.org</link>
          <link href="http://mapbender.org">http://mapbender.org</link>
          <link href="http://mapbender3.org/index.php/Demo">Mapbender3 Demo</link>
        </links>
      </event>
      <event id="433">
        <start>10:00</start>
        <duration>00:30</duration>
        <room>H&#246;rsaal 04/113</room>
        <slug></slug>
        <title>SHOGun</title>
        <subtitle>Spring, Hibernate, OpenLayers, GeoExt und weitere</subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Ein komplettes WebGIS aus einem Guss basierend auf modernen Open Source Web-Frameworks? Der Vortrag zeigt die Umsetzung einer komplexen WebGIS-L&#246;sung inklusive Java-Backend, einem konfigurierbaren WebGIS-Client auf Basis von JavaScript sowie einer Nutzerverwaltung und diversen Sicherheitsmechanismen. Die Kommunikation zwischen Client und Server wird komplett &#252;ber AJAX und (Geo)-JSON realisiert. Die Anwendung wurde im Rahmen des Forschungsprojektes MoMo (http://www.iwrm-momo.de/) entwickelt, wo die Software f&#252;r integriertes Wasserressourcen-Management in Zentralasien eingesetzt werden soll.

Bei den eingestzten Frameworks handelt es sich um

  - Spring Framework (http://www.springsource.org/)
  - Hibernate (http://hibernate.org/)
  - Hibernate Spatial (http://www.hibernatespatial.org/)
  - Ext JS (http://www.sencha.com)
  - OpenLayers (http://www.openlayers.org)
  - GeoExt (http://www.geoext.org)

Durch den Einsatz dieser renommierten und hochqualitativen Open Source Frameworks wird die Nachhaltigkeit, Wartbarkeit sowie die Qualit&#228;t der Anwendung gew&#228;hrleistet.</abstract>
        <description></description>
        <persons>
          <person id="163">Christian Mayer</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="454">
        <start>11:00</start>
        <duration>00:30</duration>
        <room>H&#246;rsaal 04/113</room>
        <slug></slug>
        <title>Ausschreibungen und Open Source Software</title>
        <subtitle>Wie Open Source Software in Ausschreibungen ber&#252;cksichtigt werden kann</subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract>Dieser Vortrag gibt eine kurze Einf&#252;hrung in die Besonderheiten von Open Source (Lizenzen, Gew&#228;hrleistung, Kosten, Investitionssicherheit) und wie diese bei der Erstellung von Ausschreibungen ber&#252;cksichtigt werden. </abstract>
        <description>Ausschreibungspraktiken sowohl in der &#246;ffentlichen Verwaltung als auch in der Privatwirtschaft sind in einer Zeit entstanden, als quelloffene Software noch etwas Besonderes war. Heute ist Open Source zwar bereits &#252;berall in der Standard-IT im Einsatz, wird aber vor allem in Nischenbereichen (wie der Geoinformationsverarbeitung) wenig ber&#252;cksichtigt. Es wird immer wieder diskutiert, ob in einer Ausschreibung explizit Open Source oder auch spezielle Software-Produkte angefordert werden k&#246;nnen oder nicht. Des weiteren ist die Preiskalkulation und damit die Vergleichbarkeit von Angeboten unterschiedlicher Hersteller oder Dienstleister wesentlich schwieriger, als es mit festen, sogenannten "Commercial Off-the-Shelf" Produkten (einsatzfertige Produkte aus dem Regal) der Fall ist. 

Inzwischen gibt es jedoch eine Reihe von Open Source Projekten, die durchaus wie "Commercial Off-the-Shelf" Produkte eingesetzt werden k&#246;nnen. Auch kann eine durchdachte Ausschreibung wesentlich besser die Dienstleistungskomponente in Wert setzen, als dies bei herk&#246;mmlicher propriet&#228;rer Software der Fall ist. 

Der Vortrag stellt unterschiedliche M&#246;glichkeiten vor, wie die Vorteile von Open Source auch in Ausschreibungen ber&#252;cksichtigt werden k&#246;nnen, ohne sich darauf festlegen zu m&#252;ssen. </description>
        <persons>
          <person id="51">Arnulf Christl</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="455">
        <start>11:30</start>
        <duration>00:30</duration>
        <room>H&#246;rsaal 04/113</room>
        <slug></slug>
        <title>Neuigkeiten aus dem Open Geospatial Consortium</title>
        <subtitle></subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract>R&#252;ckblick 2011 und eine Zusammenfassung der letzten OGC Technical Committee Meetings. Aufbauend auf dem Vortrag der FOSSGIS 2011 und entsprechenden Fragen aus dem Publikum, werden in diesem Vortrag Neuigkeiten aus dem OGC vorgestellt. Zus&#228;tzlich wird erl&#228;utert, welche M&#246;glichkeiten es f&#252;r Interessierte gibt, sich am OGC Prozess zu beteiligen.</abstract>
        <description>Die Standards des OGC bilden die Grundlagen f&#252;r viele GDI- und Geoportal-Anwendungen und WebGIS L&#246;sungen in den verschiedensten Bereichen. Zus&#228;tzlich nutzen immer mehr &#8222;Communities&#8220; die OGC Standards, um fachspezifische Anforderungen zu l&#246;sen. Dies zeigt sich in den verschiedenen Standards- und Domain-Arbeitsgruppen, die in den letzten Jahren von OGC-Mitgliedern ins Leben gerufen wurden. Standards aus dem Sensor Web Bereich (f&#252;r z.B. Fr&#252;hwarnsysteme oder Internet of Things), der Open GeoSMS Standard (z.B. f&#252;r Crowed Sourcing Anwendungen) oder die Arbeiten in den Bereichen Augmented Reality und 3D Visualisierung (Smart Cities, St&#228;dteplanung etc.) sind nur einig Beispiele der aktuellen T&#228;tigkeiten des OGC.
Der Vortrag gibt einen &#220;berblick &#252;ber folgende Aspekte:
-&gt; Aktuelles der letzten OGC Technical Committee Meetings.
-&gt; Neuigkeiten aus den einzelnen Arbeitsgruppen, wie z.B. welche neuen Arbeitsgruppen wurden in den vergangenen 12 Monaten in Leben gerufen, wie ist der Standard der Dinge der OGC Web Services Testbeds (OWS-8 und OWS-9) etc.
-&gt; Welche &#8222;Requests for Comments&#8220; und &#8222;Requests for Participations&#8220; gibt es und wie k&#246;nnen sich Interessierte einbringen?
-&gt; Ausblick auf das OGC TC Meeting in Europa in 2012</description>
        <persons>
          <person id="208">Athina Trakas</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="409">
        <start>12:00</start>
        <duration>00:30</duration>
        <room>H&#246;rsaal 04/113</room>
        <slug></slug>
        <title>Open Source GIS im UNIGIS eLearning</title>
        <subtitle>Vortrag zum Nutzen und Bedarf von FOSSGIS in der universit&#228;ren Fernlehre</subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>In diesem Vortrag geht es um den Einsatz von Open Source GIS Software im Rahmen des universit&#228;ren Fernlehrgang UNIGIS mit einem Einblick &#252;ber verwendete FOSSGIS Software und Lernmodule, den thematischen Schwerpunkten in denen Open Source und Open Content in der Fernlehre eingesetzt werden und nicht zuletzt der Bedarfsimpuls in Richtung FOSSGIS Community f&#252;r eine effektive und nachhaltige Fernlehre aus der mehrj&#228;hrigen Erfahrung seitens UNIGIS.</abstract>
        <description>Open Source GIS Software in der UNIGIS Fernlehre	

1 Kurzfassung
2 Einf&#252;hrung - UNIGIS Salzburg und FOSSGIS
3 Open Source GIS Software in der UNIGIS Fernlehre
4 Offene Software und offene Standards als Chance f&#252;r die Lehre
5 Trainingsumgebungen und Betriebssystembedarf
6 Zusammenfassung

Kurzfassung
In diesem Vortrag geht es um den Einsatz von Open Source GIS Software im Rahmen des universit&#228;ren Fernlehrgang UNIGIS mit einem Einblick &#252;ber verwendete FOSSGIS Software und Lernmodule, den thematischen Schwerpunkten in denen Open Source und Open Content in der Fernlehre eingesetzt werden und nicht zuletzt der Bedarfsimpuls in Richtung FOSSGIS Community f&#252;r eine effektive und nachhaltige Fernlehre aus der mehrj&#228;hrigen Erfahrung seitens UNIGIS.

... weitere Inhalte im Paper.</description>
        <persons>
          <person id="273">Mag. Cornelius Roth</person>
        </persons>
        <links>
          <link href="http://www.unigis.ac.at">UNIGIS Salzburg</link>
          <link href="http://www.zgis.at/research">Z_GIS Research</link>
          <link href="http://www.unigis.ac.at/club/offline/archiv/">UNIGIS OFFLINE Archiv</link>
          <link href="http://www.unigis.ac.at/club/weiterbildung/optmod_gvsig.pdf">UNIGIS Optionales Modul gvSIG</link>
        </links>
      </event>
      <event id="382">
        <start>13:30</start>
        <duration>00:30</duration>
        <room>H&#246;rsaal 04/113</room>
        <slug></slug>
        <title>Freie Software und infekti&#246;se Krankheiten: Von Rohdaten zu &#246;kologischen Indikatoren</title>
        <subtitle></subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Zoonosen sind vom Tier (Vektoren) auf den Menschen &#252;bertragene Infektionskrankheiten, die in vielen L&#228;ndern ein gro&#223;es Gesundheitsproblem darstellen. GIS-Modellierung wird routinem&#228;&#223;ig eingesetzt, um die r&#228;umliche Verteilung der insbesondere von Nagetieren, Zecken und Stechm&#252;cken &#252;bertragenen Zoonosen besser zu verstehen. Die Eingangsdaten sind &#252;blicherweise heterogene GIS-Datenquellen sowie neue, zeitlich hochaufl&#246;sende Fernerkundungsdaten. Besonders letztere helfen, die r&#228;umlichen und zeitlichen Muster von vektor&#252;bertragenen Krankheiten zu verstehen. Obwohl Satellitendaten seit mehr als zwei Jahrzehnten erfolgreich in epidemiologischen Anwendungen eingesetzt wurden, gibt es erst seit kurzem zeitlich hochaufl&#246;sende Zeitreihen (insb. MODIS Sensor: vier Abdeckungen der Erde pro Tag in verschiedenen Aufl&#246;sungen (250m-1000m). Mittels GIS werden aus diesen neuen Fernerkundungszeitreihen, u.a. Land-Oberfl&#228;chentemperatur (LST), Vegetationsindizes (NDVI/EVI) und Schneebedeckung, &#246;kologische Indikatoren extrahiert. 

Die Datenaufbereitung (Geocodierung, Projektion, GIS-Integration und Qualit&#228;tsbewertung) ist oft mit erheblichem Aufwand verbunden. Hier bieten Freie GIS Software-Tools (PROJ4, GDAL/OGR, GRASS GIS etc.) alle notwendigen Methoden und Algorithmen zur Datenaufbereitung und -analyse an.  Aus den t&#228;glichen LST Karten sind aggregierte Temperaturwerte ableitbar, die u.a. zur Identifizierung von Sp&#228;tfrost, hei&#223;en Sommern, und Gradzahltagen dienen. Der EVI erlaubt, saisonale und regionale Unterschiede des Vegetationszustandes oder Fr&#252;hling- / Herbst-Anfang zu erkennen. Der Vortrag geht auf einige Indizes ein und zeigt deren Anwendung (potenzielle Verbreitungskarten zu Zecken und Tigerm&#252;cken).

Die schiere Menge an Daten erfordert ausreichende Rechenkapazit&#228;ten (Cluster). Freie GIS Software-Tools erlauben, parallel Batch-Jobs auszuf&#252;hren, um gro&#223;e Mengen von Satellitendaten &#252;ber High Performance Computing (HPC) Einrichtungen zu bearbeiten.</abstract>
        <description></description>
        <persons>
          <person id="262">Markus Neteler</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="381">
        <start>14:00</start>
        <duration>00:30</duration>
        <room>H&#246;rsaal 04/113</room>
        <slug></slug>
        <title>Verarbeitung sehr gro&#223;er r&#228;umlicher Datens&#228;tze mit GRASS GIS</title>
        <subtitle></subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Sowohl die Ausdehnung als auch der Detailreichtum r&#228;umlicher Daten w&#228;chst best&#228;ndig mit verfeinerten Technologien und dem Bedarf f&#252;r hochaufgel&#246;ste Daten. Beispiele f&#252;r sehr gro&#223;e Datens&#228;tze sind globale administrative Gebiete (GADM), OpenStreetMap, Landbedeckungs- und Landnutzungskarten sowohl als Raster als auch als Vektor, digitale H&#246;henmodelle und Fernerkundungsdaten. Solche gro&#223;en Datens&#228;tze stellen besondere Anforderungen f&#252;r die Verarbeitung mit GIS Software, um z.B. Speicher&#252;berl&#228;ufe und extrem lange Bearbeitungszeiten zu vermeiden. Zeit- und Arbeitsspeicheranforderungen k&#246;nnen die Analyse gro&#223;er Datens&#228;tze ineffektiv bzw. Unm&#246;glich machen, teils weil viele GIS Pakete zur Bearbeitung alle Daten in den Arbeitsspeicher laden, was leicht  die vorhandenen Resourcen selbst moderner Workstations &#252;besschreiten kann. Bedauerlicherweise geht eine Reduzierung der Arbeitsspeicheranforderungen oft mit verl&#228;ngerten Bearbeitungszeiten einher. Besonders anspruchsvolle Analysen sind z.B. Kostenoberfl&#228;chen und Suche nach k&#252;rzesten Pfaden, hydrologische Modellierung, Georektifizierung, Umprojektionen, Erstellung und Bereinigung von Vektortopologie. Um in der Lage zu sein, gro&#223;e Datens&#228;tze zu verabeiten, m&#252;ssen Algorithmen derart angepasst werden, dass Limiterungen durch Hardware-Ressourcen ber&#252;cksichtigt werden, sie aber gleichzeitig effizient und schnell bleiben. &#220;bliche Ans&#228;tze sind Kacheln, die Verwendung externen Speichers, und schnelle Such- und Sortierungsalgorithmen. Diese Mechanismen werden bereits seit langem in GRASS GIS benutzt. Die n&#228;chste GRASS-Version wird diese Mechanismen verst&#228;rkt benutzen, die zum Teil &#252;berarbeitet wurden und werden. Die F&#228;higkeiten der zuk&#252;nftigen GRASS-Version zur Verarbeitung gro&#223;er Datens&#228;tze werden dargestellt und mit der aktuellen stabilen Version verglichen.</abstract>
        <description></description>
        <persons>
          <person id="260">Markus Metz</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="357">
        <start>14:30</start>
        <duration>00:30</duration>
        <room>H&#246;rsaal 04/113</room>
        <slug></slug>
        <title>SEXTANTE in gvSIG CE</title>
        <subtitle>geodata analysis for everyone</subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract>FOSSGIS 2012 (Vortrag)

Titel

SEXTANTE: geodata analysis for everyone
 
Referent 

Ruth Sch&#246;nbuchner &lt;ruth.schoenbuchner@csgis.de&gt;

Kurzbeschreibung 

Sextante ist eine freie Bibliothek, die neben gvSIG CE auch unter jedem anderen Open Source Java-basierten GIS-System (uDig,OpenJump) oder propiet&#228;rer Software wie ArcGIS verwendet werden kann. 
Durch die Anbindung von Grass GIS und SAGA bietet Sextante eine m&#228;chtige Toolbox  mit  mehr als 700 Funktionalit&#228;ten f&#252;r die Vektor- und Rasterdatenverarbeitung.
Im Jahr 2008 wurde die Ausf&#252;hrung von Geoprozessen durch die Integration eines Modelbuilders sowie der batch-Processing-Methode vereinfacht. 
F&#252;r bestimmte Fragestellungen ist es oft notwendig, verschiedene Prozesse spezifisch zu
kombinieren. Daf&#252;r wurde ein Modeller integriert, mit dem sich verschiedene Funktionalit&#228;ten
durch einfache Prozessketten abbilden lassen.
Die Software ist sehr leicht bedienbar und mit einer Kontexthilfe, die eine sehr gute Hilfestellung bei der Arbeit mit Sextante bietet, ausgestattet. Ein eigener Videokanal bietet zudem zahlreiche Videos, die den korrekten Umgang mit der Software veranschaulichen. 
Da in gvSIG CE keine Installation oder Konfiguration von Sextante durchgef&#252;hrt werden muss, f&#228;llt der Umgang mit dieser Software sehr leicht. 
Sextante wird in englischer Sprache entwickelt, um das Projekt f&#252;r jedermann zug&#228;nglich zu machen. 
Eine kurze Live-Einf&#252;hrung der aktuellen Version sowie die Vorstellung der konkreten Web-Organisation des Projektes runden den Vortrag ab.
Ansprechpartner
CSGIS 
Jos&#233; Canalejo &amp; Ruth Sch&#246;nbuchner GbR
Innere Wiener Stra&#223;e 32
D-81667 M&#252;nchen
Telf.:0049/(0)89 37415227
Mobil:0049/(0)178 6931412
Fax: 0049/(0)8323 986407
Email:ruth.schoenbuchner@csgis.de
Web: http://www.csgis.de </abstract>
        <description>Mehr Information &#252;ber Sextante erhalten Sie durch den  nachfolgenden Artikel: 
- Sextante - eine freie Java-Bibliothek zur Geodatenanalyse: GIS Business - Geoinformationstechnologie f&#252;r die Praxis 4/2011- ISSN: 1869-9286 (http://csgis.de/joomla/images/stories/pdf/Sextante_GB.pdf)</description>
        <persons>
          <person id="68">Ruth Sch&#246;nbuchner</person>
        </persons>
        <links>
          <link href="http://csgis.de/joomla/images/stories/pdf/Sextante_GB.pdf">http://csgis.de/joomla/images/stories/pdf/Sextante_GB.pdf</link>
        </links>
      </event>
      <event id="371">
        <start>15:30</start>
        <duration>00:30</duration>
        <room>H&#246;rsaal 04/113</room>
        <slug></slug>
        <title>MapProxy - das "Schweizer-Taschenmesser" f&#252;r Kartenserver</title>
        <subtitle></subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract>Reine Caching-L&#246;sungen waren gestern. Zwei Jahre nach der ersten Ver&#246;ffentlichung des MapProxy auf der FOSSGIS Konferenz 2010 in Osnabr&#252;ck, ist das MapProxy Projekt um viele Funktionen erweitert worden und stellt weit mehr als eine reine Caching L&#246;sung dar.

Der Vortrag gibt einen Einblick in die vielf&#228;ltigen Einsatzm&#246;glichkeiten des MapProxy. Hierbei greift der Vortrag L&#246;sungen aus der Praxis auf und zeigt an ihnen die Verwendung des MapProxy. Vor allem stehen Funktionen im Mittelpunkt die sich nicht ausschlie&#223;lich auf das Thema Caching beziehen.

Themen sind unteranderem: Zusammenfassen mehrerer Dienste mit Geltungsbereichen f&#252;r jeden einzelnen Layer ("Coverages"). Absichern von gesamten WMS, einzelnem Layern oder genauen Bereichen vor ungewollten Zugriffen. Einbinden von bestehende Benutzerdatenbanken f&#252;r die Zugangsberechtigung. Weiterleiten von FeatureInfo-Anfragen an andere Server, sowie dem Umformatieren von FeatureInfo-Antworten.</abstract>
        <description></description>
        <persons>
          <person id="142">Dominik Helle</person>
        </persons>
        <links>
          <link href="http://mapproxy.org">MapProxy Projekt Homepage</link>
          <link href="http://">http://</link>
        </links>
      </event>
      <event id="458">
        <start>16:00</start>
        <duration>00:30</duration>
        <room>H&#246;rsaal 04/113</room>
        <slug></slug>
        <title>MapServer MapCache - der neue WMTS Tile Cache</title>
        <subtitle>Ein leistungsf&#228;higer Tile Cache f&#252;r den Apache Web Server</subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract>Der MapServer MapCache bietet umfangreiche Funktionalit&#228;t mit h&#246;chster Performance.
* Unterst&#252;tzte Dienste: WMS, WMTS, TMS, VirtualEarth/Bing and Google Maps kompatible Tiles
* Schneller WMS Server mittels Kombination von Kacheln aus dem Tile Cache
* Unterst&#252;tzt WMS und WMTS GetFeatureInfo Anfragen (Weiterleitung an WMS Backend)
* KML Superoverlay Generierung
* Beliebiger WMS Server als Backend. Z.B. UMN MapServer oder QGIS Server
* Cache Speicherarten: Dateisystem, SQlite-DB, Memcached, Tiled TIFFs
* Konfigurierbares Meta-Tiling
* On-the-fly Tile Kombination mehrer Tile-Layer in ein Einzelbild
* Post-Processing von Images: Kompression, Wasserzeichen, etc.
* Seeding-Applikation mit paralleler Tile-Cache (Konfiguierbare Zoomstufen und sogar geografische Bereiche)
* Optimierte Behandlung von leeren Tiles (Symlinks)

Der Vortrag zeigt die praktische Anwendung von MapCache f&#252;r die schnelle Darstellung von aggregierten verteilten WMS-Diensten im nationalen Geoportal der Schweiz.</abstract>
        <description></description>
        <persons>
          <person id="99">Pirmin Kalberer</person>
        </persons>
        <links>
          <link href="http://mapserver.org/trunk/mapcache/">http://mapserver.org/trunk/mapcache/</link>
        </links>
      </event>
      <event id="432">
        <start>16:30</start>
        <duration>00:30</duration>
        <room>H&#246;rsaal 04/113</room>
        <slug></slug>
        <title>WMS2GO &#8211; Der WMS zum Mitnehmen</title>
        <subtitle></subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Sie brauchen einen WMS, sind aber gerade nicht im B&#252;ro und haben kein Internet? Mit WMS2GO exitsert eine Open Source Software, die WMS offline in einem vollwertigen WebGIS verf&#252;gbar macht. 
WMS2GO ist ein Gemeinschaftsprojekt der Firmen terrestris GmbH &amp; Co. KG und WhereGroup GmbH &amp; Co. KG sowie dem Dienstleistungszentrum IT (DLZIT) der Bundesanstalt f&#252;r Wasserbau.

Der Anwender von WMS2GO hat zun&#228;chst &#252;ber einen WebGIS-Client die M&#246;glichkeit, die gew&#252;nschten WMS-Dienste auszuw&#228;hlen. Anschlie&#223;end kann grafisch &#252;ber die Karte ein Begrenzungsbereich (BoundingBox) festgelegt werden, der das Interessengebiet abdeckt. Daraufhin wird im Hintergrund eine Prozessierung gestartet, die die Kacheln und Informationen der Dienste abruft und diese zusammen mit einem offline nutzbaren WebGIS-Client konfiguriert. 
Das Endprodukt stellt einen, vom System dynamisch konfigurierten und offline nutzbaren WebGIS-Client auf Basis der Bibliotheken Ext JS, GeoExt und OpenLayers dar. Dieser Client kann vom Benutzer z.B. auf ein Notebook kopiert werden und anschlie&#223;end vollst&#228;ndig offline, also ohne Internetanbindung, genutzt werden.
Der Anwender hat somit die M&#246;glichkeit, WMS-Dienste auch in Bereichen zu nutzen, in denen keine oder nur eine sehr langsame Internetverbindung zur Verf&#252;gung steht. Als typisches Anwendungsbeispiel w&#228;re etwa die Nutzung &#8222;im Freien&#8220; zur Digitalisierung oder zur Orientierung zu nennen. 
Der Vortrag wird den Gesamtaufbau und die Funktionsweise des WMS2GO-Systems erl&#228;utern sowie nat&#252;rlich die Quellen zum Code und der Dokumentation des Projekts nennen.</abstract>
        <description></description>
        <persons>
          <person id="162">Johannes Weskamm</person>
        </persons>
        <links>
        </links>
      </event>
    </room>
    <room name="WSRaum1">
      <event id="380">
        <start>09:00</start>
        <duration>01:30</duration>
        <room>WSRaum1</room>
        <slug></slug>
        <title>PostGIS 2.0 - Workshop rund um die neue Version</title>
        <subtitle></subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language>de</language>
        <abstract>Die Version 2.0 wird f&#252;r M&#228;rz 2011 erwartet. Anhand von einigen Beispielen sollen die Neuerungen der PostGIS Version 2.0 vorgestellt werden. Welche neuen Funktionen wird es geben? Neue Funktionen zur Datenbereinigung. Rasterunterst&#252;tzung. Topologien. TypMod.

Der Workshop richtet sich an Anwender, die bereits Erfahrungen im Umgang mit PostGIS haben. Anhand von Beispielen sollen die Neuerungen im Workshop ausprobiert werden.

Die PostGIS Version 2.0.0 wurde f&#252;r das erste Quartal 2012 angek&#252;ndigt. Nur noch wenige offene Tickets verhindern die Ver&#246;ffentlichung. Die Entwickler haben &#252;ber 900 Tickets f&#252;r die Version 2.0.0 bearbeitet. Zahlreiche Neuerungen erwarten uns mit diesem Release.

Die Liste der Neuerungen in der Version 2.0 ist sehr lang, und zu Recht wurde hier der Hauptversionssprung gew&#228;hlt.
Nachfolgend werden einige Neuerungen aufgef&#252;hrt, die im Vortrag vorgestellt werden sollen. Nat&#252;rlich kann hier nur eine kleine Auswahl pr&#228;sentiert werden. Au&#223;erdem wird vorgestellt, was beim Wechsel nach PostGIS 2.0.0 zu beachten ist. 

* geometry_columns ist nun eine Sicht (wie auch geography_columns), die aus dem Systemkatalog aufgebaut wird, und keine Tabelle mehr 
* Unterst&#252;tzung der Installation von PostGIS &#252;ber CREATE EXTENSION (ab PostgreSQL 9.1)
* neue Unterst&#252;tzung f&#252;r Raster [5]
* Topologie-Unterst&#252;tzung &#8211; setzt die SQL/MM Vorgaben um und stellt weitere Funktionen bereit
* verbesserte 3D Unterst&#252;tzung
* N-dimensionaler r&#228;umlicher Index
* neue 3D Typen TIN und PolyHedralSurface
* viele tolle neue Funktionen
** ST_Split 
** ST_Snap 
** Datenbereinigung: ST_IsValidDetail, ST_MakeValid, ST_RemoveRepeatedPoints 
* KNN Gist Index (K Nearest Neighbor Index) f&#252;r schnellere Distanzabfragen mit Limit
* der Shapefile Loader kann nun mehrere Shape-Dateien laden
</abstract>
        <description></description>
        <persons>
          <person id="65">Astrid Emde</person>
        </persons>
        <links>
          <link href="http://postgis.org">http://postgis.org</link>
          <link href="http://http://www.fossgis.de/wiki/Datei:PostGIS_2.0_Emde_FOSSGIS_2012_WS.pdf">PostGIS - Was bringt die neue Version? (Vortragsfolien)</link>
          <link href="http://trac.osgeo.org/osgeo/wiki/Live_GIS_Workshop_Install">Workshopunterlagen</link>
        </links>
      </event>
      <event id="349">
        <start>11:00</start>
        <duration>01:30</duration>
        <room>WSRaum1</room>
        <slug></slug>
        <title>R Workshop </title>
        <subtitle>Grundlagen f&#252;r Einsteiger</subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language>de</language>
        <abstract>Der Kurs richtet sich an GIS-Anwender und soll einen Einblick in die Grundlagen der (geo)-statistischen Analyse der Software R vermitteln. R ist eine Sprache und Umgebung f&#252;r (geo)statistische Berechnungen und bietet eine gro&#223;e Anzahl von Paketen f&#252;r r&#228;umliche, statistische Methoden sowie Schnittstellen zu GIS. Als Schnittstellen wird auf GRASS und Quantum GIS eingegangen.</abstract>
        <description>* Im- und Export von r&#228;umlichen Daten und deren Visualisierung
* Einf&#252;hrung in r&#228;umliche, statistische Analysen mit R
* &#220;berblick und Einsatzm&#246;glichkeiten R in Kombination mit GRASS und QGIS

</description>
        <persons>
          <person id="9">Otto Dassau</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="346">
        <start>13:30</start>
        <duration>01:30</duration>
        <room>WSRaum1</room>
        <slug></slug>
        <title>Kartografie und Kartenlayout mit QGIS</title>
        <subtitle>Arbeiten mit der Symbolisierung und dem Print Composer</subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language>de</language>
        <abstract>Im Workshop werden die M&#246;glichkeiten der neuen Symbolisierung, der automatischen und manuellen Beschriftung und die Kartenlayoutfunktionen der Druckzusammenstellungen (Print Composer) erkl&#228;rt und anhand von Beispielen be&#252;bt. Es werden eine SpatiaLite Datenbank mit &#220;bungsdaten sowie SVG Symbole, Marker und Muster zur Verf&#252;gung gestellt.</abstract>
        <description>* Arbeiten mit Ebenen
  - hierarchische Gruppierung der Ebenen
  - Trennung zwischen logischer Gruppierung und Zeichenreihenfolge
* Vorstellen der verschiedenen Renderer
  - Einzelsymbol
  - Kategorisiert
  - Abgestuft
  - Regelbasiert (der m&#228;chtigste Renderer)
  - Punktverdr&#228;ngung
* Arbeiten mit Symbolebenen
  - Anlegen und verschieben von Symbolebenen
  - Symbollayer-Typen
    + Einfache F&#252;llung
    + Einfache Linien (mit Strichlierung, Strichst&#228;rke/farbe, Offset, etc.9
    + SVG Muster
    + Rasterungen
    + Schraffuren
    + Markerlinien (Pfeile, Marker entlang von Linien, St&#252;tzpunkte visualieren)
* Beschriftung (Labeling)
  - automatische Beschriftung
  - manuelle Beschriftung
  - Kombination automatisch/manuell
* Diagramme
* Kartenlayout mit dem Print Composer
  - Vorstellen der Layoutelemente
  - Platzierungs-, Verteil-, Snapping und Anordnungsfunktionen
  - Rotieren von Pl&#228;nen
  - Legende
  - Kartenrandausstattung (Grid/Koordinatenkreuze, Massstab, Dekorationen)
  - Tips und Tricks (z.b. aktuelles Datum einblenden, etc.)
  - Massendruck &#252;ber vordefinierte Planrahmen (EasyPrint Plugin)</description>
        <persons>
          <person id="79">Andreas Neumann</person>
          <person id="9">Otto Dassau</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="397">
        <start>15:30</start>
        <duration>01:30</duration>
        <room>WSRaum1</room>
        <slug></slug>
        <title>Neue Funktionen in QGIS f&#252;r Poweruser</title>
        <subtitle></subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language></language>
        <abstract>Im QGIS Projekt hat es in den letzten Jahren viele Neuentwicklungen gegeben. Oftmals ist es schwierig, vom GUI aus alles zu entdecken und den vollen Nutzen aus der Funktionalit&#228;t zu ziehen. Im Rahmen dieses Workshops gehen wir auf folgende Bereiche vertieft ein:
- Benutzerdefinierte Formulare
- Rasterrechner, Feldrechner, Querybuilder
- Verkn&#252;pfung von Tabellen</abstract>
        <description></description>
        <persons>
          <person id="151">Marco Hugentobler</person>
        </persons>
        <links>
        </links>
      </event>
    </room>
    <room name="WSRaum2">
      <event id="348">
        <start>09:00</start>
        <duration>01:30</duration>
        <room>WSRaum2</room>
        <slug></slug>
        <title>GRASS GIS Workshop</title>
        <subtitle>Grundlagen f&#252;r Einsteiger</subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language>de</language>
        <abstract>Der Workshop gibt einen &#220;berblick &#252;ber die umfangreichen Funktionalit&#228;ten von GRASS GIS und vermittelt anhand eines praktischen Workflows, wie man auf einfache Art und Weise eine Arbeitsumgebung erstellt, Analysen durchf&#252;hrt und eine ansprechende Karte erzeugt.
</abstract>
        <description>Das Programm:

* &#220;berblick zu den GRASS Funktionalit&#228;ten
* Wie arbeitet man am effektivsten mit der Software
* Wie erstellt man eine Arbeitsumgebung
* Einfache Analysebeispiele f&#252;r Raster- und Vektordaten
* Erstellen einer druckfertigen Karte</description>
        <persons>
          <person id="9">Otto Dassau</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="353">
        <start>11:00</start>
        <duration>01:30</duration>
        <room>WSRaum2</room>
        <slug></slug>
        <title>gvSIG CE</title>
        <subtitle>ein freies Desktop-GIS mit SEXTANTE, GRASS GIS und SAGA</subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language>de</language>
        <abstract>FOSSGIS 2012 (Workshop) - 90min.

Titel

gvSIG CE: ein freies Desktop-GIS mit SEXTANTE, GRASS GIS und SAGA
 
Workshopleiter 

Benjamin Ducke &lt;benducke@fastmail.fm&gt;
Ruth Sch&#246;nbuchner &lt;ruth.schoenbuchner@csgis.de&gt; 

Kurzbeschreibung 

Der Workshop gibt einen &#220;berblick zu gvSIG CE, welches sich durch die Anbindung an andere Open-Source-GIS-Software in ein leistungsstarkes, freies Desktop GIS entwickelt hat.
 
gvSIG CE ist die aktive und offen entwickelte Nachfolgeversion von gvSIG OADE (2010). Sie beinhaltet die aktuellsten Versionen von SEXTANTE (inkl. Unterst&#252;tzung der Module von GRASS GIS und SAGA) und weiteren Neuerungen. Die Software ist portabel (keine Installation notwendig) und lauff&#228;hig unter Windows, Linux oder Mac OS X. Sie bietet eine enorme Anzahl an Funktionen zur Geodaten-verwaltung, und -analyse, Datenbankanbindung (z.B. PostGIS) und Gestaltung von kartographischen Ausdrucken.

Im Rahmen des Workshops wird eine Einf&#252;hrung in die Grundfunktionen der Software sowie die M&#246;glichkeiten zur Geodatenprozessierung gegeben. In gvSIG CE steht hierf&#252;r eine m&#228;chtige, mit mehr als 700 Funktionen ausgestattete, Werkzeugpalette f&#252;r die Vektor- und Rasterdatenverar-beitung zur Verf&#252;gung.

Ansprechpartner

Benjamin Ducke &lt;benducke@fastmail.fm&gt;
Ruth Sch&#246;nbuchner &lt;ruth.schoenbuchner@csgis.de&gt;

</abstract>
        <description></description>
        <persons>
          <person id="289">Benajmin Ducke</person>
          <person id="68">Ruth Sch&#246;nbuchner</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="437">
        <start>13:30</start>
        <duration>01:30</duration>
        <room>WSRaum2</room>
        <slug></slug>
        <title>Mobile GIS WebApps mit GeoExt Mobile (GXM)</title>
        <subtitle></subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language>de</language>
        <abstract>GeoExt Mobile (GXM, https://github.com/geoext/GXM und http://trac.geoext.org/wiki/mobile) ist eine noch junge Open Source Bibliothek, welche die Funktionalit&#228;ten von OpenLayers (http://openlayers.org/) und Sencha Touch (http://www.sencha.com/products/touch) verkn&#252;pft, um Entwickler in die Lage zu versetzen, mobile WebGIS-Anwendungen (WebApps) zu erstellen. Hierbei k&#246;nnen die vielf&#228;ltigen M&#246;glichkeiten der Basisbibliotheken voll ausgenutzt werden:

    Verwendung aller Kartentypen und Interaktionswerkzeuge, die OpenLayers unterst&#252;tzt
    Oberfl&#228;chenelemente von Sencha Touch, die natives Look and Feel im mobilen Browser gew&#228;hrleisten

GXM ist das Schwesterprojekt der bekannten Bibliothek GeoExt; so ist der Quellcode von GXM via GeoExt verf&#252;gbar und w&#228;hrend der Entwicklung von GXM fanden mehrmalige Codereviews durch Basisentwickler von GeoExt statt. Die Workshopleiter haben GXM ma&#223;geblich mitentwickelt.

Im Workshop werden die verwendeten Bibliotheken OpenLayers, Sencha Touch und GXM theoretisch und an Beispielen vorgestellt. Anschlie&#223;end werden wir iterativ gemeinsam eine mobile WebGIS-Anwendung erstellen, die aus einem Kartenpanel, einer Layerliste und einigen Kartenwerkzeugen besteht. Die Anwendung k&#246;nnen Sie dann direkt auf ihrem Smartphone (z.B. iPhone, Android oder Blackberry) und/oder Tablet-Computer (etwa iPad) ansehen.

Zielgruppe sind alle, die an WebGIS mit mobilen Endger&#228;ten Interesse zeigen. Wenn Sie absch&#228;tzen m&#246;chten, ob und wie Sie den Wachstumstrend mobiler Internetnutzung durch Smartphone/Tablets f&#252;r ihre GIS-Fragestellung nutzen k&#246;nnen, wird der Workshop erste Fingerzeige geben k&#246;nnen.

Vorwissen in JavaScript und/oder in der Verwendung der Bibliotheken ist sicherlich hilfreich, aber mitnichten Voraussetzung zur Teilnahme am Workshop. Ein Smartphone und/oder Tablet-PC sind von Vorteil, aber nicht zwingend notwendig. Auf Anfrage kann ggf. ein solches Ger&#228;t f&#252;r den Workshop gestellt werden.
</abstract>
        <description></description>
        <persons>
          <person id="162">Johannes Weskamm</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="401">
        <start>15:30</start>
        <duration>01:30</duration>
        <room>WSRaum2</room>
        <slug></slug>
        <title>Mapbender3 Workshop</title>
        <subtitle></subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language></language>
        <abstract>In Weiterf&#252;hrung des Mapbender3-Vortrages soll auf diesem Workshop ein erster Einstieg in die Erstellung einer Kartenanwendung auf Mapbender3-Basis durchgef&#252;hrt werden.

Teilnehmer werden in die Backend-Anwendung erhalten und dort lernen, eine eigene Kartenanwendung aus Diensten und Anwendungsbausteinen zu erstellen. Neben der Verwendung des universellen Editors soll auch die Verwendung von angepassten Editoren f&#252;r Anwendungsbausteine gezeigt werden, der spezielle Konfigurations- und Logikanforderungen angepasst umsetzten kann.</abstract>
        <description></description>
        <persons>
          <person id="268">Christian Wygoda</person>
        </persons>
        <links>
          <link href="http://mapbender.org/download/get_mapbender3.sh">Installationspaket get_mapbender3.sh</link>
          <link href="http://svn.osgeo.org/mapbender/trunk/documents/presentations/FOSSGIS_2012/Mapbender3_Workshop_FOSSGIS_2012.pdf">Mapbender3 Kursunterlagen</link>
        </links>
      </event>
    </room>
    <room name="WSRaum3">
      <event id="451">
        <start>09:00</start>
        <duration>01:30</duration>
        <room>WSRaum3</room>
        <slug></slug>
        <title>Lagebezugssystemwechsel mit GDAL </title>
        <subtitle>Thematischer Workshop f&#252;r Fortgeschrittene</subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language>de</language>
        <abstract>Die Geodata Abstraction Library (GDAL) stellt mit gdal_translate und gdalwarp zwei leistungsf&#228;hige Kommandozeilenprogramme bereit, die sich u.a. herrvorragend f&#252;r die Umrechnung und Transformation von Rasterdaten in verschiedene geod&#228;tische Referenzsysteme eignen. 

Im Mittelpunkt dieses Workshops steht der Lagebezugssystemwechsel von Gau&#223;-Kr&#252;ger/DHDN nach ETRS89/UTM. Nach einer theoretischen Einf&#252;hrung werden verschiedene Transformationsans&#228;tze vorgestellt, die von den Teilnehmerinnen und Teilnehmern in praktischen Beispielen an Rasterdaten und Vektordaten nachvollzogen werden k&#246;nnen. Die Beispiele zeigen, dass mit der Transformation zugleich eine &#220;berf&#252;hrung in ein beliebiges Blattschnittgitter vorgenommen werden kann. Zum Abschluss werden in einem konkreten Fallbeispiel die M&#246;glichkeiten der Massendatenverarbeitung durch Einbindung der Kommandozeilenprogramme in ein Shellscripte vorgestellt.

Nach den Erfahrungen der vergangenen beiden FOSSGIS- Konferenzen wird es dieses Jahr erstmals einen Grundlagen-Workshop f&#252;r Einsteiger und einen thematischen Workshop f&#252;r Fortgeschrittene geben. Wenn Sie schon erste Erfahrungen mit den GDAL-Tools gesammelt oder den Grundlagenworkshop besucht haben und Ihnen der Lagebezugssystemwechsel von Gau&#223;-Kr&#252;ger/DHDN nach ETRS89/UTM bevorsteht, werden Sie sich mit diesem Workshop einen guten &#220;berblick &#252;ber diese Thematik verschaffen k&#246;nnen. </abstract>
        <description></description>
        <persons>
          <person id="17">Andreas Fischer</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="342">
        <start>11:00</start>
        <duration>01:30</duration>
        <room>WSRaum3</room>
        <slug></slug>
        <title>Workshop Fernerkundung mit Open Source Software</title>
        <subtitle></subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language>de</language>
        <abstract>In dem Workshop sollen klassische Fernerkundungsaufgaben (Mosaikierung, Pansharpening, Klassifizierung, ...) und Aufgaben aus dem Bereich der Vorprozessierung (Level 1A, Level 1B) mit Open Source Software behandelt werden. Zu diesem Zweck werden Desktop-Programme (Ossim, Orfeo Toolbox, Opticks) und Bibliotheken (Python, R) vorgestellt und an einfachen Anwendungsbeispielen eingef&#252;hrt.
Die Daten sollen so weit wie m&#246;glich mit frei zug&#228;nglichen Daten (Landsat, MODIS) durchgef&#252;hrt werden.</abstract>
        <description></description>
        <persons>
          <person id="238">Christian Strobl</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="440">
        <start>13:30</start>
        <duration>01:30</duration>
        <room>WSRaum3</room>
        <slug></slug>
        <title>Einf&#252;hrung in Rich Map Clients mit GeoExt</title>
        <subtitle>Anspruchsvolle Benutzeroberfl&#228;chen f&#252;r Kartenanwendungen programmieren</subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language></language>
        <abstract>GeoExt (http://geoext.org) ist eine auf den JavaScript-Bibliotheken OpenLayers (f&#252;r Karten im Web, http://openlayers.org) und Ext JS (f&#252;r interaktive Webanwendungen, http://www.sencha.com/products/js/) aufbauende JavaScript- Bibliothek, die es vereinfacht, Kartenmaterial in ansprechenden und komplexen Oberfl&#228;chen im Web zu pr&#228;sentieren.

Im Workshop, der von Christian Mayer (einem Patch-Contributor von GeoExt und OpenLayers) &amp; Marc Jansen (einem der Autoren des deutschsprachigen Buches zu OpenLayers, dort Kernentwickler und daneben ebenfalls GeoExt-Patch-Contributor) gehalten wird, werden die folgenden Themen behandelt:
  - GeoExt Grundlagen: Wie erzeugt man ein verschiebbares Kartenfenster inklusive WMS-Layer mit GeoExt?
  - WMS mit Readern und Stores: Verwendung der Methoden GetCapabilities, GetMap, GetFeatureInfo und GetLegendGraphic, um das Potential der standardisierten Interaktionen mit den Diensten auszusch&#246;pfen
  - WFS einfach gemacht: Wir entwickeln einen WFS-T Editor mit automatisch synchronisierter Karten- und Tabellendarstellung der geographischen Features

Zus&#228;tzlich zu oben genannten Themen werden wir, je nach zur Verf&#252;gung stehender Zeit und den konkreten W&#252;nschen der Teilnehmer, gegebenenfalls die folgenden Aspekte behandeln:
  - Weitere OGC Standards
    - WFS GetCapabilities und DescribeFeatureType
    - Filter Encoding (FE) and Styled Layer Descriptor (SLD)

Zielgruppe sind alle an Webkartographie Interessierten, die bereits OpenLayers kennen und ansprechende Oberfl&#228;chen mit GeoExt entwickeln m&#246;chten. Auch Teilnehmer, die GeoExt bereits einsetzen, k&#246;nnen von einem Besuch sicherlich profitieren, etwa um die Eigenschaften der k&#252;rzlich erschienenen Version 1.1 kennenzulernen. Wenn Sie absch&#228;tzen m&#246;chten, ob OpenLayers, Ext JS und GeoExt Ihnen bei Ihrer Fragestellung helfen kann, wird der Workshop erste Antworten liefern. Grunds&#228;tzliche Kenntnisse von JavaScript, OpenLayers und Ext JS sind sicherlich n&#252;tzlich, werden aber nicht zwingend vorausgesetzt.</abstract>
        <description></description>
        <persons>
          <person id="163">Christian Mayer</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="393">
        <start>15:30</start>
        <duration>01:30</duration>
        <room>WSRaum3</room>
        <slug></slug>
        <title>Geoprozessieren mit PostgreSQL/PostGIS</title>
        <subtitle>Workshop f&#252;r Fortgeschrittene</subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language>de</language>
        <abstract>Der Workshop vermittelt einen Einblick zum Umgang mit r&#228;umlichen Funktionen der Datenbankerweiterung PostGIS. Es sollen eigenst&#228;ndig vordefinierte &#220;bungen nachvollzogen werden. Geometrische Fragestellung werden in SQL-Skript &#252;bertragen und anschlie&#223;end mit &#220;bungsdaten getestet. Inhaltlich wird den Fragen nachgegangen: Stimmen meine Daten? Sind meine Daten valide? Wo sind die Fehler? Sind Auff&#228;lligkeiten tats&#228;chlich Fehler? Und weitere. Die einzelnen Fragestellungen sind noch in der Bearbeitung.

Der Workshop richtet sich an Personen die Erfahrung im Umgang mit PostGIS-Funktionen sammeln m&#246;chten. Die &#220;bungen basieren auf SQL-Skripten und k&#246;nnen aktiv nachvollzogen werden. Eine Affinit&#228;t zum Arbeiten mit einer PC-Konsole ist von Vorteil. Grundlagen im Umgang mit der Skriptsprache SQL sind erforderlich. Weiterhin ist ein abstraktes geometrisches Vorstellungsverm&#246;gen hilfreich. Die &#220;bungsschritte werden nur rudiment&#228;r visualisiert.

Einen &#220;berblick gibt der angef&#252;gte Link.</abstract>
        <description></description>
        <persons>
          <person id="31">Harald Schwenk</person>
        </persons>
        <links>
          <link href="http://www.agentur-geoinfo.de/referenz/Vortrag/ws/ws_agit_2011.sql">http://www.agentur-geoinfo.de/referenz/Vortrag/ws/ws_agit_2011.sql</link>
          <link href="http://www.agentur-geoinfo.de/referenz/Vortrag/ws/ws_geoprozessieren_mit_postgresql_postgis_dessau_2012.sql">http://www.agentur-geoinfo.de/referenz/Vortrag/ws/ws_geoprozessieren_mit_postgresql_postgis_dessau_2012.sql</link>
          <link href="http://">http://</link>
        </links>
      </event>
    </room>
    <room name="Vor Ort Aushang">
      <event id="483">
        <start>11:00</start>
        <duration>01:00</duration>
        <room>Vor Ort Aushang</room>
        <slug></slug>
        <title>Multilingual Maps</title>
        <subtitle></subtitle>
        <track>Community Sessions</track>
        <type></type>
        <language></language>
        <abstract>Wikipedia-Projekt zu mehrsprachigen Webkarten.</abstract>
        <description></description>
        <persons>
          <person id="2">Jochen Topf</person>
          <person id="96">Tim Alder</person>
        </persons>
        <links>
          <link href="http://wiki.openstreetmap.org/wiki/Multilingual_maps">Projekt-Seite</link>
          <link href="http://blog.openstreetmap.de/2012/03/wikipedia-projekt-multilingual-maps/">Hintergrundinfos</link>
        </links>
      </event>
      <event id="474">
        <start>13:30</start>
        <duration>01:30</duration>
        <room>Vor Ort Aushang</room>
        <slug></slug>
        <title>INSPIRE</title>
        <subtitle></subtitle>
        <track>BoFs</track>
        <type>community_session</type>
        <language>de</language>
        <abstract>INSPIRE ist eine europ&#228;ische Direktive, die von allen EU-Mitgliedsstaaten umgesetzt werden muss. Auch wenn es inzwischen eine Menge Information gibt ist diese doch oft noch nicht in verst&#228;ndlicher Weise bis zu denen durchgedrungen, die sie umsetzen m&#252;ssen oder sogar davon profitieren k&#246;nnten. In dem Workshop werden die relevanten Eckdaten der Direktive in konzentrierter Form vorgestellt, dar&#252;ber hinaus zus&#228;tzlich aber auch technische L&#246;sungsvarianten mit Open Source Technologie und Tipps und Tricks, die die Umsetzung vereinfachen.</abstract>
        <description>In einem kurzen Einf&#252;hrungsvortrag werden die aktuell zur Umsetzung anstehenden Vorgaben der INSPIRE Direktive vorgestellt. Im Anschluss werden die Zusammenh&#228;nge zwischen den europ&#228;ischen Vorgaben und der gesetzlichen Verpflichtungen der Mitgliedsstaaten vorgestellt. Hierbei werden sowohl die "Implementation Rules" als auch die "Technical Guidelines" ber&#252;cksichtigt und erl&#228;utert was diese genau bedeuten. Dabei wird auch der Einfluss des rechtlichen Aspekts auf die technische Umsetzung erl&#228;utert. Anders als h&#228;ufig angenommen unterliegt die Umsetzung INSPIRE nicht klar spezifizierten technischen Standards wie sie z.B. von ISO und OGC ver&#246;ffentlicht werden, auch wenn die Einhaltung dieser Standards bereits eine gute Ausgangsbasis bildet. INSPIRE-Dienste m&#252;ssen jedoch einige zus&#228;tzliche Aspekte ber&#252;cksichtigen, die nicht durch die technischen Standards beschrieben sind. 

Ein weiterer wichtiger Aspekt der von INSPIRE leider nicht besonders klar formuliert wurde, sind die rechtlichen Grundlagen auf deren Basis die Geodaten '''ver&#246;ffentlicht''' werden sollen. In vielen F&#228;llen gibt es keine nationale Rechtsgrundlagen auf deren Grundlage die Nutzung der Geodaten m&#246;glich w&#228;re. Hier besteht gro&#223;er Handlungsbedarf, der von einigen L&#228;ndern und auf kommunaler Ebene bereits vorbildich pragmatisch umgesetzt wird. 

Der Workshop wird durch mehrere Dozenten gehalten, die sich auf unterschiedliche Bereiche der Technologie spezialisiert haben und bereits umfangreiche Projekterfahrung in Technologie sammeln konnten, die sich f&#252;r die Umetzung der unterschiedlichen Anforderungen durch INSPIRE bereits bew&#228;hren konnten. 

Der Workshop wird offen gestaltet, um den Teilnehmern zu erm&#246;glichen die Inhalte aktiv mitzugestalten und eigene Fragen aber auch Erfahrungen mit einzubringen. Der Workshop wird durch eine offizielle Teilnahmebest&#228;tigung dokumentiert. </description>
        <persons>
          <person id="51">Arnulf Christl</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="480">
        <start>17:00</start>
        <duration>00:30</duration>
        <room>Vor Ort Aushang</room>
        <slug></slug>
        <title>PostNAS Anwendertreffen</title>
        <subtitle></subtitle>
        <track>Anwendertreffen</track>
        <type></type>
        <language></language>
        <abstract>Es soll auf der FOSSGIS 2012 ein PostNAS-Treffen geben, zu dem alle 
Interessierten herzlich eingeladen sind.

Auf dem Treffen k&#246;nnen wir die derzeitigen M&#246;glichkeiten von PostNAS 
anschauen und &#252;berlegen, wie sich das Projekt weiter entwickeln soll und 
was noch zu tun ist.

Au&#223;erdem w&#228;re es gut, wenn auf dem Treffen PostNAS Anwender von Ihren 
Erfahrungen berichten k&#246;nnten.

Wer nicht zu dem Treffen kommen kann, kann gerne &#252;ber die Liste 
Fragen/Anregen f&#252;r das Treffen einreichen und die Erfahrungen per Mail 
schicken.

</abstract>
        <description></description>
        <persons>
        </persons>
        <links>
          <link href="http://postnas.org">Link zur PostNAS Projektseite </link>
          <link href="http://www.fossgis.de/konferenz/2012/programm/events/386.de.html">Nicht verpassen: NAS - BasisDLM Aufbereitung mit gdal/PostNAS  (Armin Retterath) Mi 21.3.2012 11:00 Uhr</link>
          <link href="http://trac.wheregroup.com/PostNAS/wiki/PostNASAnwendertreffen2012-03-21">Link zum Protokoll des Treffens</link>
        </links>
      </event>
      <event id="482">
        <start>17:30</start>
        <duration>01:30</duration>
        <room>Vor Ort Aushang</room>
        <slug></slug>
        <title>QGIS/GRASS Anwendertreffen</title>
        <subtitle></subtitle>
        <track>Anwendertreffen</track>
        <type>user_meeting</type>
        <language></language>
        <abstract>Alle QGIS-Interessierten sind herzlich eingeladen, die sich &#252;ber den Stand der QGIS-Entwicklung zu informieren und Erfahrungen untereinander auszutauschen.</abstract>
        <description></description>
        <persons>
        </persons>
        <links>
        </links>
      </event>
      <event id="478">
        <start>18:00</start>
        <duration>02:00</duration>
        <room>Vor Ort Aushang</room>
        <slug></slug>
        <title>M&#246;glichkeiten der Abendgestaltung</title>
        <subtitle></subtitle>
        <track>Community Sessions</track>
        <type>community_session</type>
        <language></language>
        <abstract></abstract>
        <description></description>
        <persons>
        </persons>
        <links>
          <link href="http://www.fossgis.de/konferenz/2012/socialevents/">&#220;bersicht Social Events</link>
        </links>
      </event>
      <event id="481">
        <start>19:00</start>
        <duration>03:00</duration>
        <room>Vor Ort Aushang</room>
        <slug></slug>
        <title>FOSSGIS e.V. Vollversammlung</title>
        <subtitle>Treffen der FOSSGIS e.V. Vereinsmitglieder</subtitle>
        <track>Community Sessions</track>
        <type>community_session</type>
        <language></language>
        <abstract></abstract>
        <description></description>
        <persons>
        </persons>
        <links>
          <link href="http://www.fossgis.de/projekte.html">FOSSGIS e.V. Aktivit&#228;ten</link>
          <link href="http://www.fossgis.de/verein.html">FOSSGIS e.V. Vereinsziele</link>
          <link href="http://www.fossgis.de/community.html">FOSSGIS e.V. Community</link>
        </links>
      </event>
    </room>
  </day>
  <day date="2012-03-22" index="4">
    <room name="H&#246;rsaal des Umweltbundesamtes (UBA)">
      <event id="456">
        <start>12:30</start>
        <duration>00:30</duration>
        <room>H&#246;rsaal des Umweltbundesamtes (UBA)</room>
        <slug></slug>
        <title>Bericht von der OSGeo</title>
        <subtitle>Ein Jahresbericht und Ausblick</subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>In dem Vortrag werden die Aufgaben und Ziele der Open Source Geospatial Foundation (OSGeo) vorgestellt und von den Ergebnissen der Arbeit des letzten Jahres berichtet. </abstract>
        <description>Bereits im sechsten Jahr seit ihrer Gr&#252;ndung z&#228;hlt die OSGeo zu einem der "Industry-Leaders" in der Geo-Branche. Ende 2011 wurde die OSGeo zusammen mit bekannten Gr&#246;&#223;en wie Google, Intergraph (bzw. Hexagon), Microsoft, Trimble (als Vertreter f&#252;r Vermessungs-Hardware) und Samsung SDS von den Vereinten Nationen zum konstituierenden Treffen der "Global Geospatial Information Management" (GGIM) Arbeitsgruppe der UN eingeladen. Ziel von GGIM ist es, den Mitgliedsstaaten eine Plattform zu bieten auf der sie sich zu Fragen der r&#228;umlichen Datenverarbeitung und Bereitstellung von Geodaten austauschen k&#246;nnen. 

Gleichzeitig kann die OSGeo inzwischen auf 40 sogenannte "Local Chapters" zur&#252;ckgreifen, die im nationalen oder regionalen Kontext den Open Source Gedanken pflegen, Software entwickeln und Know-How weitergeben. Damit ist die OSGeo ein fast normales multinationales Unternehmen, nur eben mit einem sehr kleinen Budget und ausschlie&#223;lich freiwilligen Mitarbeitern. Der Vortrag erl&#228;utert wie das geht &#8211; und wie sie mitmachen k&#246;nnen. 

Die Open Source Geospatial Foundation, kurz OSGeo, ist eine non-Profit Organisation, die sich f&#252;r die F&#246;rderung von Freier und Open Source Software in der r&#228;umlichen Datenverarbeitung einsetzt. Als unabh&#228;ngige, rechtlich eigenst&#228;ndige Organisation bietet sie ihren Mitgliedern die Sicherheit, dass die investierte Zeit, beigesteuerter Code, Dokumentationen und auch finanzielle Mittel sinnvoll f&#252;r die gemeinsamen Ziele eingesetzt werden. 

Die urspr&#252;nglich bereits im Jahr 2000 in Deutschland gegr&#252;ndete GRASS Anwendervereinigung wurde im September 2008 in FOSSGIS e.V. umbenannt und ist die offizielle deutschsprachige Repr&#228;sentanz der OSGeo (das Local Chapter DACH). Der FOSSGIS hat mit einer Vielzahl von Aktivit&#228;ten die Open Source und Open Data Bewegung vorangebracht.</description>
        <persons>
          <person id="51">Arnulf Christl</person>
        </persons>
        <links>
          <link href="http://www.osgeo.org">OSGeo Foundation</link>
          <link href="http://www.fossgis.de">FOSSGIS e.V.</link>
          <link href="http://wiki.osgeo.org/wiki/Category:Local_Chapters">Liste der OSGeo Local Chapters</link>
        </links>
      </event>
      <event id="472">
        <start>13:00</start>
        <duration>00:30</duration>
        <room>H&#246;rsaal des Umweltbundesamtes (UBA)</room>
        <slug></slug>
        <title>Finale</title>
        <subtitle>Abschlussvortrag und Preisverlosung</subtitle>
        <track>Allgemeines</track>
        <type>podium</type>
        <language></language>
        <abstract></abstract>
        <description></description>
        <persons>
        </persons>
        <links>
        </links>
      </event>
    </room>
    <room name="H&#246;rsaal 08">
      <event id="359">
        <start>09:00</start>
        <duration>00:30</duration>
        <room>H&#246;rsaal 08</room>
        <slug></slug>
        <title>Couchbase Mobile, GeoCouch und MapQuery</title>
        <subtitle>Mobile Anwendungen auch ohne Konnektivit&#228;t</subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Die moderne mobile Welt erm&#246;glicht uns fast grenzenlosen Zugriff auf Informationen und Daten. Problematisch wird es jedoch, wenn die Verbindung zum Internet unterbrochen ist, beispielsweise in einem Tunnel oder in Gegenden, in denen das Netz noch nicht ausgebaut wurde.

Funkl&#246;cher sind immer &#228;rgerlich, besonders jedoch, wenn man eine Verbindung zu einem zentralen Server ben&#246;tigt, etwa zum &#220;bertragen der gerade gesammelten Informationen im Feld. Die L&#246;sung des Problems besteht darin, die Daten zun&#228;chst lokal auf dem mobilen Ger&#228;t zu speichern und erst dann zu &#252;bertragen wenn eine Internetverbindung besteht.

Damit sich Entwickler um die Applikation selbst und nicht um die Synchronisation k&#252;mmern m&#252;ssen, kommt Couchbase Mobile zum Einsatz. Diese Datenbank liefert bereits alles, um eine solche Offline-Anwendung zu schreiben.

Dabei ist Couchbase Mobile mehr als eine Datenbank. Sie kann nicht nur Daten im JSON Format speichern, sondern auch HTML5-Anwendungen direkt ausf&#252;hren. Es gen&#252;gen also bereits Grundkenntnisse im Webbereich, um eine Anwendung zu entwickeln. Durch GeoCouch ist es m&#246;glich, r&#228;umliche Anfragen lokal auf dem Ger&#228;t zu bearbeiten.

MapQuery, ein Web-Mapping-Framework das auf OpenLayers und jQuery basiert, vereinfacht die Entwicklung zus&#228;tzlich.

Dieser Vortrag gibt zun&#228;chst einen kurzen &#220;berblick &#252;ber die verwendeten Technologien Couchbase Mobile, GeoCouch und MapQuery. Danach wird demonstriert, wie leicht eine Anwendung gebaut werden kann, die die oben beschriebene Datensynchronisation erm&#246;glicht.

Alle erw&#228;hnten Softwareprodukte sind Open Source. Couchbase Mobile und GeoCouch stehen unter der Apache License Version 2.0, MapQuery steht unter der MIT Lizenz.
</abstract>
        <description></description>
        <persons>
          <person id="33">Volker Mische</person>
        </persons>
        <links>
          <link href="http://couchbase.com/">Couchbase</link>
          <link href="https://github.com/couchbase/geocouch/">GeoCouch</link>
          <link href="http://mapquery.org/">MapQuery</link>
        </links>
      </event>
      <event id="387">
        <start>09:30</start>
        <duration>00:30</duration>
        <room>H&#246;rsaal 08</room>
        <slug></slug>
        <title>OpenPOIMap, eine ganzheitliche erweiterbare Point-Of-Interest L&#246;sung</title>
        <subtitle>OpenPOIMap ist f&#252;r Entwickler als auch Anwender</subtitle>
        <track>Vorträge (OSM)</track>
        <type></type>
        <language></language>
        <abstract>Wie oft haben Sie sich gefragt, wie lautet ein Key-Value Pair zu einem bestimmten Gegenstand der erfasst oder abgefragt werden soll. Beispielsweise wollen Sie eine neue Busshaltestelle erfassen. Muss die Haltestelle als "amenity" und "bus_stop" oder als "highway" und "busstation" abgespeichert werden. Oder Sie m&#246;chten eine Menge von Informationen in Ihrer Software weiterverarbeiten. Dabei interessiert Sie ausschliesslich eine kleiner Ausschnitt oder gewisse Eigenschaften von Informationen die Sie in einem speziellen Format brauchen. OpenStreetMap bietet Ihnen, ob Entwickler oder Anwender, eine massgeschneiderte L&#246;sung.

OpenPOIMap ist auf der einen Seite eine modulare ganzheitliche L&#246;sung, um massgeschneiderte Applikationen zu entwickeln, und andererseits bietet es Nutzern, OSM-Daten anzuschauen und in gew&#252;nschter Form herunterzulassen.</abstract>
        <description>Was ist wenn:
* Sie sich nicht um die Darstellung von POIs k&#252;mmern m&#252;ssen?
* Sie nicht wissen m&#252;ssen wie die Daten gekennzeichnet sind?
* Sie nicht von einer gesamten L&#246;sung abh&#228;ngig sind, sondern die L&#246;sung auf Ihre Bed&#252;rfnisse zuschneiden l&#228;sst?
* Die Software automatisch eine optimale grafische Repr&#228;sentation von POIs erstellt?
All dies mehr bietet Ihnen OpenPOIMap.

OpenPOIMap ist auf der einen Seite eine modulare ganzheitliche L&#246;sung, um massgeschneiderte Applikationen zu entwickeln, und andererseits bietet es Nutzern, OSM-Daten anzuschauen und in gew&#252;nschter Form herunterzulassen.

Ein Benutzer kann auf einfache Art und Weise die korrekten Key-Value Paare finden, um nach den n&#246;tigen Informationen zu suchen. OpenPOIMap sucht automatisch nach den geeignetsten Key-Value Paaren im OSM Jargon und hilf Ihnen bei der Erstellung der korrekten Abfrage.

Ferner werden die abgefragten Informationen anhand ihrer grafischen Repr&#228;sentation auf der Karte aufbereitet. Sprich, es werden keine &#220;berlagerung zugelassen, was eine optimierte Darstellung erm&#246;glicht. Durch einen geeigneten Einsatz von Informationstips k&#246;nnen zus&#228;tzliche Informationen zu gruppierten Informationen nachgefragt werden.

OpenPOIMap erlaubt es zus&#228;tzlich, alle Informationen in Ihrem gew&#252;nschten Format herunterzuladen.</description>
        <persons>
          <person id="253">Michel Ott</person>
          <person id="265">Stefan Keller</person>
        </persons>
        <links>
          <link href="http://openpoimap.ch">openpoimap.ch</link>
        </links>
      </event>
      <event id="431">
        <start>10:00</start>
        <duration>00:30</duration>
        <room>H&#246;rsaal 08</room>
        <slug></slug>
        <title>GeoExt Mobile (GXM)</title>
        <subtitle>GIS WebApps mit nativem Look and Feel f&#252;r unterwegs</subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>GeoExt Mobile (GXM, https://github.com/geoext/GXM und http://trac.geoext.org/wiki/mobile) ist eine noch junge Open Source Bibliothek, welche die Funktionalit&#228;ten von OpenLayers (http://openlayers.org/) und Sencha Touch (http://www.sencha.com/products/touch) verkn&#252;pft, um Entwickler in die Lage zu versetzen, mobile WebGIS-Anwendungen (WebApps) zu erstellen. Hierbei k&#246;nnen die vielf&#228;ltigen M&#246;glichkeiten der Basisbibliotheken voll ausgenutzt werden:

  * Verwendung aller Kartentypen und Interaktionswerkzeuge, die OpenLayers unterst&#252;tzt
  * Oberfl&#228;chenelemente von Sencha Touch, die natives Look and Feel im mobilen Browser gew&#228;hrleisten

Der Vortrag wird die Schwestersoftware von GeoExt (http://www.geoext.org/) vorstellen und deren M&#246;glichkeiten aufzeigen. Hierbei werden die Entstehungsgeschichte der Software, die verf&#252;gbaren Klassen und auch Beispiele f&#252;r den Einsatz von GXM in Kundenprojekten beleuchtet.</abstract>
        <description></description>
        <persons>
          <person id="34">Marc Jansen</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="420">
        <start>11:00</start>
        <duration>00:30</duration>
        <room>H&#246;rsaal 08</room>
        <slug></slug>
        <title>WPS-Appstore</title>
        <subtitle>Markplatz f&#252;r freie Algorithmen</subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract>Seit einiger Zeit &#228;ndert sich das Paradigma zur Verarbeitung von Geodaten: Weg von monolithischen GIS Systemen-hin zu verteilten Prozessierungsdiensten mit offenen Schnittstellen (i.e. OGC Web Processing Service (WPS) ).
Dieser Vortrag stellt eine Weiterentwicklung vor, die es erm&#246;glich freie Verarbeitunslogiken (Algorithmen und Modelle) in einfacher Weise aufzufinden und in seiner eigenen vertrauensw&#252;rdigen und performanten Infrastruktur (Desktop, Server, Private Cloud) auszuf&#252;hren. Mittels eines Markplatzes &#8222;WPS-Appstore&#8220; lassen sich Algorithmen in einfachster Weise auffinden und austauschen. Revolution&#228;r ist hier das angewandte Prinzip des &#8222;Moving Code&#8220; bei dem die Prozesse zu den Daten kommen und nicht umgekehrt. Dies erm&#246;glicht die rasante Verarbeitung auch von gro&#223;en Datenmengen, da sie nicht transferiert werden m&#252;ssen. Weiterhin ist man so nicht auf fremde, fragw&#252;rdige oder nicht verf&#252;gbare Dienste angewiesen.
Der Vortrag stellt das zugrundeliegende Konzept und Anwendungsbeispiele da und zeigt in anschaulicher Weise die Vorteile gegen&#252;ber klassischen Geoprozessierungsmethoden auf.
</abstract>
        <description></description>
        <persons>
          <person id="52">Bastian Sch&#228;ffer</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="369">
        <start>11:30</start>
        <duration>00:30</duration>
        <room>H&#246;rsaal 08</room>
        <slug></slug>
        <title>Marble - ein Schweizer Taschenmesser f&#252;r Karten</title>
        <subtitle>Neues vom freien virtuellen Globus</subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Auf der letzten FOSSGIS wurde Marble vorgestellt: ein freier virtueller Globus und ein "Schweizer Taschenmesser" f&#252;r Kartenmaterial. Mit Marble kann der Anwender spielerisch die Welt erkunden oder er kann Marble als kleines Navi verwenden. In diesem Vortrag pr&#228;sentieren wir den Entwicklungssprung, den Marble im vergangenen Jahr gemacht hat: Marble's Routing verf&#252;gt inzwischen &#252;ber Sprachnavigation, die den Anwender in Sprachen wie Deutsch, Englisch, Spanisch oder Hindi zum Ziel f&#252;hren kann.
Als Teil von Marble 1.3 wird "Marble Touch" ausgeliefert: eine spezielle Version von Marble, die vor allem an Smartphones und Tablet-Ger&#228;te angepasst ist. Au&#223;erdem zeigen wir Neuerungen in Marble's Unterst&#252;tzung von OpenStreetMap: Dazu geh&#246;ren die ersten Schritte des OSM Vektorrenderings und die Unterst&#252;tzung von OSM basierten Kartenthemen, wie zum Beispiel OpenSeaMap. Schlie&#223;lich werfen wir noch einen Blick ins All: Dort stellen wir die Neuerungen vor, die im Rahmen des "ESA Summer of Code in Space" umgesetzt wurden.</abstract>
        <description></description>
        <persons>
          <person id="186">Torsten Rahn</person>
        </persons>
        <links>
          <link href="http://edu.kde.org/marble">Marble Virtual Globe Website</link>
          <link href="http://developer.kde.org/~tackat/marble_1_2.pdf">Marble 1.2 - &#220;bersicht f&#252;r Anwender</link>
          <link href="http://developer.kde.org/~tackat/libmarble_0_12_0.pdf">libMarble 1.2 - Softwarebibliothek f&#252;r Entwickler</link>
        </links>
      </event>
    </room>
    <room name="H&#246;rsaal 04/114">
      <event id="465">
        <start>09:00</start>
        <duration>01:00</duration>
        <room>H&#246;rsaal 04/114</room>
        <slug></slug>
        <title>OSM 3D Block</title>
        <subtitle></subtitle>
        <track>Vorträge (OSM)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract></abstract>
        <description>Der Gemeinschaftsvortrag von Tobias Knerr, Matthias Mei&#223;er und Matthias Uden geht auf aktuelle und zuk&#252;nftige Entwicklungen rund um das Thema OSM 3D ein.

Folgend die Abstracts der drei Redner:

Tobias Knerr
=====
OSM2World (osm2world.org) erzeugt dreidimensionale Szenen aus OpenStreetMap-Daten. Das flexible Konzept der Software erlaubt die Erstellung von Standbildern oder Kartenkacheln ebenso wie den Export von Dateien in g&#228;ngigen 3D-Modellformaten oder das Echtzeitrendering mit OpenGL.
Der Vortrag informiert &#252;ber Anwendungsm&#246;glichkeiten, den aktuellen Stand der Entwicklung und Pl&#228;ne f&#252;r die Zukunft.


Matthias Mei&#223;er
=====
Das Thema 3D ist gerade sehr in Bewegung bei OSM. Es gibt bereits seit l&#228;ngerem einige L&#246;sungen wie OSM3D OSM2pov oder OSM2World die Bereiche der Weltkarte nehmen und zum Beispiel Geb&#228;ude in die dritte Dimension extrudieren. Doch f&#252;r viele Anwendungen wie Simulationen, Spiele und nat&#252;rlich die Argumented- und Virtual-Reality sind es gerade die kleinen Objekte, die eine Wiedererkennung ausmachen. Au&#223;erdem bietet eine Erfassung mittels des OSM Datenmodels nur sehr eingeschr&#228;nkte M&#246;glichkeiten f&#252;r 3D Modellierung.

O3DM soll dagegen ein Portal werden, dass es erlaubt 3D Modelle gegen OSM Objekte zu linken. So k&#246;nnen generelle Objekte (Poller, Ampeln, ...) modelliert werden und nat&#252;rlich ebenso Geb&#228;ude mit einem hohen Detaillierungsgrad (Schl&#246;sser, Denkm&#228;ler,...)

So soll eine weitreichende Alternative zu dem Google 3D Warehouse entstehen, &#252;ber die f&#252;r OSM hoffentlich noch weitere Designer und Entwickler aus dem klassischen 3D Umfeld gewonnen werden k&#246;nnen. Den bisherigen Entwicklern, die sich mit der Thematik 3D besch&#228;ftigen, soll so ein neues Detaillevel gemeinsam nutzbar gemacht werden. Eine gr&#246;&#223;ere Projektvorstellung folgt in diesem Talk.


Matthias Uden
=====
OpenStreetMap hat sich in letzter Zeit von einer reinen, zwei-dimensionalen Stra&#223;enkarte zu einer umfangreichen Sammlung von verschiedensten Datentypen und Inhalten entwickelt. L&#228;ngst geht die abgelegte Information &#252;ber eine einfache Stra&#223;enkarte hinaus. Die erstellten Geometrien werden immer detaillierter und beschreiben in manchen Regionen kleinr&#228;umige Ph&#228;nomene wie einzelne Wanderwege oder U-Bahn-Trassen. Dar&#252;ber hinaus wird auch die Semantik verbessert, indem vielf&#228;ltige Zusatzbeschreibungen in Form von verschiedenen tags abgelegt werden. Dazu z&#228;hlen vermehrt auch dreidimensionale Informationen, vor allem im Bezug auf kartierte Geb&#228;ude (z.B. H&#246;he, Dachform usw.). Die Anzahl der Geb&#228;udegrundrisse hat vor kurzem die Anzahl der Stra&#223;en in OSM &#252;berholt. Dies zeigt, dass der Fokus zunehmend von den Stra&#223;en und Wegen hin zu Geb&#228;uden und anderen Objekten unserer Umgebung geht. Die Welt besteht aus drei Dimensionen und die zus&#228;tzliche H&#246;heninformation erm&#246;glicht  verschiedene neue Anwendungsszenarien. Beispiele sind in der Stadtplanung (L&#228;rmkartierung, Sichtbarkeitsanalyse, Telekommunikation etc.), dem Katastrophenmanagement (Hochwasseranalyse, Evakuierung etc.) und vor allem der mobilen Fu&#223;g&#228;ngernavigation zu finden. Es ist daher zu begr&#252;&#223;en, dass auch OSM immer mehr dreidimensionale Daten enth&#228;lt. Diese Daten k&#246;nnen genutzt werden, um 3D-Modelle von Geb&#228;uden und dem Gel&#228;nde zu erstellen, um somit der virtuellen Welt (Digital Earth) n&#228;her zu kommen.
Projekte wie OSM-3D (www.osm-3d.de) und zahlreiche Diskussionen im OSM Wiki zeigen, dass das Interesse in der Community an 3D schnell zunimmt und auf gro&#223;e Zustimmung st&#246;&#223;t. Die Entwicklung steckt allerdings noch in den Kinderschuhen und es gibt viele offene Fragen hinsichtlich der Erfassung, Verarbeitung und Pr&#228;sentation der 3D-Daten in OSM. Der Vortrag zeigt die neuesten Entwicklungen rund um die dritte Dimension in der Community auf und beschreibt insbesondere die neuesten Arbeiten an der Universit&#228;t Heidelberg im Bereich OSM-3D. Dabei reichen die Ideen und M&#246;glichkeiten von der Erweiterung der 3D-Tags, &#252;ber die Verfeinerung/Erweiterung von 3D Viewern f&#252;r OSM Daten, &#252;ber die Entwicklung von 3D Indoor OSM f&#252;r Innenr&#228;ume, bis hin zur kollaborativen Entwicklung, Bereitstellung und Nutzung einer Datenbank mit vollst&#228;ndigen 3D Modellen von Geb&#228;uden oder Gegenst&#228;nden in unserer Umgebung. Auch auf die Verkn&#252;pfung von OSM mit offenen Geodatenstandards wird eingegangen.
</description>
        <persons>
          <person id="230">Matthias Mei&#223;er</person>
          <person id="291">Matthias Uden</person>
          <person id="66">Pascal Neis</person>
          <person id="144">Tobias Knerr</person>
        </persons>
        <links>
          <link href="http://wiki.openstreetmap.org/wiki/3D_Development">3D Development im OSM Wiki</link>
          <link href="http://osm2world.org">OSM2World</link>
          <link href="http://www.osm-3d.de">OSM-3D</link>
        </links>
      </event>
      <event id="466">
        <start>10:00</start>
        <duration>00:30</duration>
        <room>H&#246;rsaal 04/114</room>
        <slug></slug>
        <title>Lightning Talks II</title>
        <subtitle></subtitle>
        <track>Lightning Talks (OSM)</track>
        <type>lightning</type>
        <language></language>
        <abstract></abstract>
        <description></description>
        <persons>
        </persons>
        <links>
        </links>
      </event>
      <event id="468">
        <start>11:00</start>
        <duration>01:00</duration>
        <room>H&#246;rsaal 04/114</room>
        <slug></slug>
        <title>Indoor OSM Block</title>
        <subtitle></subtitle>
        <track>Vorträge (OSM)</track>
        <type>lecture</type>
        <language></language>
        <abstract>Der Gemeinschaftsvortrag von Marcus G&#246;tz, Andreas Hubel und Frederic Kerber geht auf aktuelle und zuk&#252;nftige Entwicklungen rund um das Thema Indoor OSM ein.

Themen sind unter anderem:

- Bestehende Indoor L&#246;sungen
- Tagging Schemas
- Indoor Routing
- Technik (Kompass, Beschleunigungssensor, Kamera)
- etc.
</abstract>
        <description></description>
        <persons>
          <person id="248">Andreas Hubel</person>
          <person id="236">Frederic Kerber</person>
          <person id="213">Marcus G&#246;tz</person>
          <person id="153">Oliver Tonnhofer</person>
        </persons>
        <links>
        </links>
      </event>
    </room>
    <room name="H&#246;rsaal 04/113">
      <event id="376">
        <start>09:00</start>
        <duration>00:30</duration>
        <room>H&#246;rsaal 04/113</room>
        <slug></slug>
        <title>INSPIRE View Service in MapServer</title>
        <subtitle>INSPIRE Darstellungsdienst mit MapServer</subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract>Dieser Vortrag gibt einen &#220;berblick &#252;ber den derzeitigen Stand der Implementierung in [http://mapserver.org](MapServer) zur Unterst&#252;tzung des von INSPIRE geforderten Darstellungsdienstes. Anhand von konkreten Beispielen werden verschiedene M&#246;glichkeiten einer Umsetzung nach der technischen Anleitung (Technical Guidance) von INSPIRE gezeigt.

Diese technische Anleitung empfiehlt die Verwendung und Erweiterung des Web Map Service (WMS), ein offener Standard des Open Geospatial Consortium (OGC). MapServer unterst&#252;tzt bereits alle g&#228;ngigen WMS Versionen sowie einige weitere OGC Standards wie den Web Feature Service (WFS) und den Web Coverage Service (WCS).

Die Umsetzung der von INSPIRE empfohlenen Erweiterungen des bestehenden WMS in MapServer ist im [http://mapserver.org/development/rfc/ms-rfc-75.html](Request for Comments (RFC) 75) beschrieben.</abstract>
        <description></description>
        <persons>
          <person id="258">Stephan Mei&#223;l</person>
        </persons>
        <links>
          <link href="http://mapserver.org">MapServer</link>
          <link href="http://mapserver.org/development/rfc/ms-rfc-75.html">MapServer RFC 75</link>
        </links>
      </event>
      <event id="449">
        <start>09:30</start>
        <duration>00:30</duration>
        <room>H&#246;rsaal 04/113</room>
        <slug></slug>
        <title>Das OGC Coverage Konzept: Daten und Dienste</title>
        <subtitle>Konzepte, Standards, Umsetzung - von OGC bis INSPIRE</subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language></language>
        <abstract>In diesem Vortrag stellen wir "Coverages" vor, als Verallgemeinerung von Rasterdaten wie z.B. Orthophotos. Mit dem WCS 2.0 Standard wurde das Coverage-Konzept neu definiert, mit GML und Sensor Web Enablement harmonisiert und vom WCS-Dienst unabh&#228;ngig gemacht. Damit sind Coverages als universelle Datenstruktur f&#252;r multi-dimensionale Sensor-, Bild- und Statistikdaten zwischen den OGC-Diensten austauschbar. Der Web Coverage Service (WCS) ist ein solcher Dienst, er erlaubt den Zugriff auf die originalen, weiterverarbeitbaren Daten (im Unterschied zum bildgebenden WMS).

Im Vortrag stellen wir das Coverage-Konzept sowie die aktuelle WCS 2.0 Suite vor und beleuchten Einfluss auf INSPIRE. Schlie&#223;lich werden Open-Source Implementierungen vorgestellt.

Der Referent ist Chair der OGC WCS-Gruppe, Editor der Coverage-Standards sowie eingeladener Experte bei den INSPIRE-Arbeitsgruppen.</abstract>
        <description></description>
        <persons>
          <person id="250">Peter Baumann</person>
        </persons>
        <links>
          <link href="http://www.opengeospatial.org/standards/wcs">Web Coverage Service (WCS)</link>
          <link href="http://www.earthlook.org">EarthLook: WCS Demo Suite</link>
        </links>
      </event>
      <event id="379">
        <start>10:00</start>
        <duration>00:30</duration>
        <room>H&#246;rsaal 04/113</room>
        <slug></slug>
        <title>EOxServer, GDAL, MapServer - Zugang zu gro&#223;en Archiven von Erdbeobachtungsdaten</title>
        <subtitle>Entwicklungen im Rahmen des FP7 Projektes EarthServer</subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Infrastruktur f&#252;r Erdbeobachtungsdaten spielt aufgrund des steigenden Angebots und Nachfrage eine immer wichtigere Rolle. Seit Beginn der satellitengest&#252;tzten Erdbeobachtung vor knapp 30 Jahren steigt die Anzahl der Anbieter, sowie die r&#228;umliche und zeitliche Aufl&#246;sung der Daten signifikant an. Dieses Angebot auf der einen sowie die steigende Nachfrage von Forschung und Industrie auf der anderen Seite, erfordern eine gut strukturierte, &#252;bersichtliche und hochperformante Infrastruktur.

[http://www.eoxserver.org](EOxServer) ist ein Open Source Projekt, welches sich zum Ziel gemacht hat, Software zu entwickeln um gro&#223;e Best&#228;nde von Erdbeobachtungsdaten und deren Metadaten zu verwalten. Mittels MapServer werden diese Daten in Folge &#252;ber offene Schnittstellen f&#252;r Clients oder aber auch anderen Servern zur Verf&#252;gung gestellt.

Als standardisierte Schnittstelle f&#252;r den Austausch Erdbeobachtungsdaten, oder Coverages, wurde WCS (Web Coverage Service) entwickelt. Das Ziel eines offenen Standards ist klar: je mehr Server und Clients offene Standards unterst&#252;tzen, desto einfacher wird der Zugang zu verschiedensten Archiven und gr&#246;&#223;er somit die Vorteile und M&#246;glichkeiten der einzelnen Akteure.

Das EU Projekt [http://earthserver.eu/]("EarthServer - European Scalable Earth Science Service Environment")[1] versucht f&#252;r verschiedene Dom&#228;nen der Erdwissenschaften mittels Open Source Softwarekomponenten Infrastrukturen basierend auf offenen Standards zur Verf&#252;gung zu stellen. W&#228;hrend der dreij&#228;hrigen Projektlaufzeit sollen Softwarekomponenten und Standards entwickelt beziehungsweise weiterentwickelt werden.

Dieser Vortrag gibt einen &#220;berblick &#252;ber das Potential einer derartigen Infrastruktur aus den Sichtweisen der Maintainer und der User sowie den M&#246;glichkeiten von "User-Tailored Data Download" und serverseitigem "Geospatial Data Analytics".

[1] EU FP7-INFRA Projekt 283610</abstract>
        <description></description>
        <persons>
          <person id="261">Joachim Ungar</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="362">
        <start>11:00</start>
        <duration>00:30</duration>
        <room>H&#246;rsaal 04/113</room>
        <slug></slug>
        <title>djeo: eine einheitliche Open Source API f&#252;r unterschiedliche geographische Web-Engines</title>
        <subtitle></subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Im Vortrag wird die Javascript Bibliothek djeo vorgestellt. djeo ist f&#252;r die Entwicklung geographischer Webanwendungen entworfen. djeo ist auf Dojo Toolkit basiert.

Man kann drei Besonderheiten von djeo unterscheiden. Erstens, wie mit anderen Open-Source und kommerzielen Bibliotheken, kann man Vektor-Objekte auf Bitmap-Tiles mit djeo darstellen. Zweitens, kann man das eigene Engine mit popul&#228;ren kommerziellen APIs (Google Maps, Google Earth, Yandex Maps) ersetzen. So derselbe Anwendungscode funktioniert sowohl mit dem eigenen Engine als auch mit anderen APIs. Drittens, statt grafischer Objekten auf einem Browserfenster kann mann eine textuelle Datei generieren. POV-Ray Format ist zur Zeit unterst&#252;tzt, mit dem bekommt man photorealistische Darstellung von geographischen Objekten.     

djeo hat eine Art Analogie mit HTML, CSS und Document Object Model. Mit djeo beschreibt man geographische Objekte als eine Baumstruktur. Ein Objekt erbt den Stil seines Vorfahren. Man kann ein Ereignis zu einem Objekt sowie zu einem Objektcontainer befestigen.

Webseite des Projekts mit dem Source-Code: http://djeo.org
Demobeispiele: https://github.com/vvoovv/djeo/wiki/demos</abstract>
        <description></description>
        <persons>
          <person id="249">Vladimir Elistratov</person>
        </persons>
        <links>
          <link href="http://djeo.org">Webseite des Projekts mit dem Source-Code</link>
          <link href="https://github.com/vvoovv/djeo/wiki/demos">Demobeispiele</link>
        </links>
      </event>
      <event id="423">
        <start>11:30</start>
        <duration>00:30</duration>
        <room>H&#246;rsaal 04/113</room>
        <slug></slug>
        <title>SOS-Importer</title>
        <subtitle>Werkzeug zum Ver&#246;ffentlichen von Daten im Sensor Web</subtitle>
        <track>Vorträge (GIS)</track>
        <type>lecture</type>
        <language>de</language>
        <abstract>Die Idee des Sensor Webs ist es, den interoperablen Austausch von Sensordaten zu erm&#246;glichen und eine m&#246;glichst gro&#223;e Menge an Daten verf&#252;gbar zu machen. Die Sensor Web Enablement-Technologie des Open Geospatial Consortiums stellt hierzu eine wichtige Basis dar. W&#228;hrend die Anzahl von Service- und Client-Implementierungen stetig w&#228;chst, stellt die Ver&#246;ffentlichung der Sensordaten noch eine H&#252;rde f&#252;r viele Datenanbieter dar. Dies liegt insbesondere an einem hohen Aufwand zur Einarbeitung.

Daher wurde im Rahmen des EU-Projekts EO2HEAVEN die Entwicklung eines Tools begonnen, welches diese Problematik adressiert. Im Zuge von EO2HEAVEN sollen Fachanwender die M&#246;glichkeit erhalten, ihre Daten anderen Fachkollegen interoperabel bereitzustellen. Allerdings ist von den Fachanwendern nicht zu erwarten, dass sie einen erheblichen Aufwand investieren k&#246;nnen um sich die Sensor Web-Spezifikationen einzuarbeiten bevor sie ihre Daten ver&#246;ffentlichen k&#246;nnen. Stattdessen ist es wichtig, dass sie Werkzeuge erhalten, mit deren Hilfe die Ver&#246;ffentlichung von Sensordaten auch ohne detaillierte Kenntnisse der OGC-Spezifikationen m&#246;glich ist. Insbesondere ist es wichtig, Sensor Web-Spezifische Konzepte (z.B. &#8222;Observation Offering&#8220; oder &#8222;Procedure&#8220;) weitgehend zu verbergen.

Dieser Vortrag stellt das 52&#176;North Sensor Web-Import-Tool vor. Dieses Open Source-Tool unterst&#252;tzt Fachanwender durch einen Assistenten bei der Ver&#246;ffentlichung von Sensordaten, welche in Form von Textdateien mit komma-separierten Werten vorliegen. Notwendige Metadaten f&#252;r die Publikation im Sensor Web werden dabei vom Anwender abgefragt, ohne ihn mit Sensor Web-spezifischen Begriffen zu konfrontieren. Das Tool &#252;bernimmt die Transformation der Daten in die erforderlichen Datenmodelle und l&#228;dt die Informationen &#252;ber standardisierte Schnittstellen hoch. Somit entf&#228;llt f&#252;r Datenanbieter die Einarbeitung in die Sensor Web-Spezifikationen und der Aufwand Datenbest&#228;nde manuell in die Sensor Web-Datenstrukturen zu &#252;berf&#252;hren.</abstract>
        <description></description>
        <persons>
          <person id="39">Simon Jirka</person>
        </persons>
        <links>
        </links>
      </event>
    </room>
    <room name="WSRaum1">
      <event id="360">
        <start>09:00</start>
        <duration>01:30</duration>
        <room>WSRaum1</room>
        <slug></slug>
        <title>Introduction to GeoServer</title>
        <subtitle></subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language>en</language>
        <abstract>Introduction to the use of GeoServer made by one of the core developers of GeoServer.
</abstract>
        <description>The workshop will provide a hands on introduction to the GeoServer usage and configuration. 
In particular the workshop will cover the following topics:
-GeoServer installation
-brief theoretical introduction to GeoServer configuration and data models
-vector data configuration
-raster data configuration  
-basic usage of WMS
-styling data with SLD (both as manual SLD writing, and style creation with uDig)
-KML file generation and Google Earth integration, with time series and extrusion handling.</description>
        <persons>
          <person id="251">simone giannecchini</person>
        </persons>
        <links>
        </links>
      </event>
    </room>
    <room name="WSRaum2">
      <event id="372">
        <start>09:00</start>
        <duration>01:30</duration>
        <room>WSRaum2</room>
        <slug></slug>
        <title>MapProxy - Eine praktische Einf&#252;hrung</title>
        <subtitle></subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language></language>
        <abstract>Schnelle Karten mit dem WMS-Standard bietet das OpenSource Projekt MapProxy. Mit dem MapProxy werden die Dienste dabei einer aktiven Geschwindigkeitsverbesserung unterzogen. Die Funktionsweise des MapProxy ist denkbar einfach. MapProxy beschleunigt Kartenanwendungen durch das Vorgenerieren und Zwischenspeichern von Karten in einem lokalen Zwischenspeicher. 

Ziel des Workshops ist es die Teilnehmer in die Lage zu versetzen, eine bestehende Geodateninfrastruktur mit Hilfe des MapProxy zu beschleunigen. Neben der Installation wird im Workshop eine Einf&#252;hrung in die aktuell wichtigsten Funktionen geben. Der Workshop umfasst praktische &#220;bungen bis hin zur Beschleunigung bestehender WMS-Dienste.

Programm:

Funktionsweise des MapProxy
Infrastruktur und Installation
Erstellen einer Konfiguration
Beschleunigen eines WMS Dienste
</abstract>
        <description></description>
        <persons>
          <person id="142">Dominik Helle</person>
        </persons>
        <links>
        </links>
      </event>
    </room>
    <room name="WSRaum3">
      <event id="341">
        <start>09:00</start>
        <duration>01:30</duration>
        <room>WSRaum3</room>
        <slug></slug>
        <title>PostGIS Raster</title>
        <subtitle>Wie Rasterdaten in die PostGIS-Datenbanken kommen (und wieder raus)</subtitle>
        <track>Workshops (bezahlt)</track>
        <type>workshop</type>
        <language>de</language>
        <abstract>Der Workshop wird &#252;bersichtsartig zeigen, wie man mit PostGIS 2.0 mit seinen Rasterdaten arbeitet. Dabei wird besonderer Fokus auf die folgenden Punkte gelegt:
* Einspielen von Rasterdaten
* Manipulieren von Rasterdaten
* Verschneiden von Raster- und Vektordaten in PostGIS
* Visualisieren mit UMN MapServer und QGIS

Grundlegende SQL- und PostGIS-Kenntnisse werden in diesem Workshop vorausgesetzt.</abstract>
        <description>Der Workshop wird &#252;bersichtsartig zeigen, wie man mit PostGIS 2.0 mit seinen Rasterdaten arbeitet. Dabei wird besonderer Fokus auf die folgenden Punkte gelegt:
* Einspielen von Rasterdaten
* Manipulieren von Rasterdaten
* Verschneiden von Raster- und Vektordaten in PostGIS
* Visualisieren mit UMN MapServer und QGIS

Grundlegende SQL- und PostGIS-Kenntnisse werden in diesem Workshop vorausgesetzt.</description>
        <persons>
          <person id="46">Stephan Holl</person>
        </persons>
        <links>
          <link href="http://postgis.org">http://postgis.org</link>
          <link href="http://trac.osgeo.org/postgis/wiki/WKTRaster">http://trac.osgeo.org/postgis/wiki/WKTRaster</link>
          <link href="http://ftp.intevation.de/users/stephan/fossgis-2012/ws/postgis-raster/postgis2.0ALPHA7-osgeolive5.5.tar.gz">PostGIS 2.0 f&#252;r OSGeo-Live 5.5</link>
        </links>
      </event>
    </room>
    <room name="Vor Ort Aushang">
      <event id="403">
        <start>11:00</start>
        <duration>00:30</duration>
        <room>Vor Ort Aushang</room>
        <slug></slug>
        <title>Mapbender Anwendertreffen</title>
        <subtitle></subtitle>
        <track>Anwendertreffen</track>
        <type></type>
        <language></language>
        <abstract>Bei dem Treffens werden zun&#228;chst die neusten Entwicklungen im Mapbender-Projekt vorgestellt.

Alle sind herzlich eingeladen, die sich &#252;ber den Stand der
Mapbender Entwicklung informieren m&#246;chten.

Das Treffen wird sicherlich auch eine M&#246;glichkeit bieten, die Erfahrungen
mit Mapbender auszutauschen.
</abstract>
        <description></description>
        <persons>
          <person id="268">Christian Wygoda</person>
          <person id="70">Olaf Knopp</person>
        </persons>
        <links>
        </links>
      </event>
      <event id="479">
        <start>18:00</start>
        <duration>01:00</duration>
        <room>Vor Ort Aushang</room>
        <slug></slug>
        <title>Closing Event</title>
        <subtitle></subtitle>
        <track>Community Sessions</track>
        <type>community_session</type>
        <language>de</language>
        <abstract>Hier m&#246;chte das Local Team die Konferenz ausklingen lassen. Speisen und Getr&#228;nke sind im Angebot und werden selbst getragen.</abstract>
        <description></description>
        <persons>
        </persons>
        <links>
          <link href="http://www.fossgis.de/konferenz/2012/socialevents/">&#220;bersicht Social Events</link>
        </links>
      </event>
    </room>
  </day>
</schedule>
